#lang pollen
<!DOCTYPE html>
<html xmlns="http://www.w3.org/1999/xhtml" lang="" xml:lang="">
<head>
  <meta charset="utf-8" />
  <meta name="generator" content="pandoc" />
  <meta name="viewport" content="width=device-width, initial-scale=1.0, user-scalable=yes" />
  <title>Ο Προγραμματισμός της Διάδρασης</title>
  <style>
    html {
      color: #1a1a1a;
      background-color: #fdfdfd;
    }
    body {
      margin: 0 auto;
      max-width: 36em;
      padding-left: 50px;
      padding-right: 50px;
      padding-top: 50px;
      padding-bottom: 50px;
      hyphens: auto;
      overflow-wrap: break-word;
      text-rendering: optimizeLegibility;
      font-kerning: normal;
    }
    @media (max-width: 600px) {
      body {
        font-size: 0.9em;
        padding: 12px;
      }
      h1 {
        font-size: 1.8em;
      }
    }
    @media print {
      html {
        background-color: white;
      }
      body {
        background-color: transparent;
        color: black;
        font-size: 12pt;
      }
      p, h2, h3 {
        orphans: 3;
        widows: 3;
      }
      h2, h3, h4 {
        page-break-after: avoid;
      }
    }
    p {
      margin: 1em 0;
    }
    a {
      color: #1a1a1a;
    }
    a:visited {
      color: #1a1a1a;
    }
    img {
      max-width: 100%;
    }
    h1, h2, h3, h4, h5, h6 {
      margin-top: 1.4em;
    }
    h5, h6 {
      font-size: 1em;
      font-style: italic;
    }
    h6 {
      font-weight: normal;
    }
    ol, ul {
      padding-left: 1.7em;
      margin-top: 1em;
    }
    li > ol, li > ul {
      margin-top: 0;
    }
    blockquote {
      margin: 1em 0 1em 1.7em;
      padding-left: 1em;
      border-left: 2px solid #e6e6e6;
      color: #606060;
    }
    code {
      font-family: Menlo, Monaco, Consolas, 'Lucida Console', monospace;
      font-size: 85%;
      margin: 0;
      hyphens: manual;
    }
    pre {
      margin: 1em 0;
      overflow: auto;
    }
    pre code {
      padding: 0;
      overflow: visible;
      overflow-wrap: normal;
    }
    .sourceCode {
     background-color: transparent;
     overflow: visible;
    }
    hr {
      background-color: #1a1a1a;
      border: none;
      height: 1px;
      margin: 1em 0;
    }
    table {
      margin: 1em 0;
      border-collapse: collapse;
      width: 100%;
      overflow-x: auto;
      display: block;
      font-variant-numeric: lining-nums tabular-nums;
    }
    table caption {
      margin-bottom: 0.75em;
    }
    tbody {
      margin-top: 0.5em;
      border-top: 1px solid #1a1a1a;
      border-bottom: 1px solid #1a1a1a;
    }
    th {
      border-top: 1px solid #1a1a1a;
      padding: 0.25em 0.5em 0.25em 0.5em;
    }
    td {
      padding: 0.125em 0.5em 0.25em 0.5em;
    }
    header {
      margin-bottom: 4em;
      text-align: center;
    }
    #TOC li {
      list-style: none;
    }
    #TOC ul {
      padding-left: 1.3em;
    }
    #TOC > ul {
      padding-left: 0;
    }
    #TOC a:not(:hover) {
      text-decoration: none;
    }
    code{white-space: pre-wrap;}
    span.smallcaps{font-variant: small-caps;}
    div.columns{display: flex; gap: min(4vw, 1.5em);}
    div.column{flex: auto; overflow-x: auto;}
    div.hanging-indent{margin-left: 1.5em; text-indent: -1.5em;}
    ul.task-list{list-style: none;}
    ul.task-list li input[type="checkbox"] {
      width: 0.8em;
      margin: 0 0.8em 0.2em -1.6em;
      vertical-align: middle;
    }
    .display.math{display: block; text-align: center; margin: 0.5rem auto;}
    /* CSS for citations */
    div.csl-bib-body { }
    div.csl-entry {
      clear: both;
    }
    .hanging-indent div.csl-entry {
      margin-left:2em;
      text-indent:-2em;
    }
    div.csl-left-margin {
      min-width:2em;
      float:left;
    }
    div.csl-right-inline {
      margin-left:2em;
      padding-left:1em;
    }
    div.csl-indent {
      margin-left: 2em;
    }  </style>
  <!--[if lt IE 9]>
    <script src="//cdnjs.cloudflare.com/ajax/libs/html5shiv/3.7.3/html5shiv-printshiv.min.js"></script>
  <![endif]-->
</head>
<body>
<header id="title-block-header">
<h1 class="title">Ο Προγραμματισμός της Διάδρασης</h1>
</header>
<h1 id="πρόλογος">Πρόλογος</h1>
<blockquote>
<p>Τα πράγματα που πρέπει να κάνεις τα μαθαίνεις κάνοντάς τα.
Αριστοτέλης</p>
</blockquote>
<p>Ο σκοπός αυτού του βιβλίου είναι να δώσει μια σύντομη εισαγωγή στα
συστήματα διάδρασης ανθρώπου και υπολογιστή και κυρίως να ενθαρρύνει ένα
κριτικό διάλογο αναφορικά με τις ατομικές και συλλογικές επιλογές που
έχουν διαμορφώσει τα σύγχρονα συστήματα. Η μελέτη των παλιότερων
συστημάτων έχει ιστορικό χαρακτήρα μόνο σε μια πρώτη επιφανειακή
ανάγνωση, γιατί ο βασικός σκοπός είναι να εντοπιστούν εκείνες οι
συνθήκες, οι δυνάμεις, και τα υλικά που θα επιτρέψουν την κατασκευή νέων
συστημάτων. Μέσα από την κριτική ανάλυση των παλιότερων συστήματων
προκύπτουν ερμηνείες για την μορφή τους. Επιπλέον, η μελέτη των
παλιότερων συστημάτων αποκαλύπτει τις διαχρονικές αξίες και τις
βέλτιστες πρακτικές που μπορούν να οδηγήσουν σε καλύτερα συστήματα
διάδρασης, με τρόπο συστηματικό και με τεκμηριωμένες παραδοχές.</p>
<p>Μια προσεκτική μελέτη των παραδοσιακών και των σύγχρονων συστημάτων
διάδρασης δείχνει πως δημιουργήθηκαν σε ένα συγκεκριμένο τεχνολογικό και
πολιτισμικό πλαίσιο και πως εξυπηρετούν συγκεκριμένα κίνητρα και
στόχους. Αυτή η διαπίστωση απελευθερώνει τον αναγνώστη, καθώς του
επιτρέπει να κατανοήσει όλα τα σύγχρονα συστήματα, απλά ως ένα
στιγμιότυπο μιας διαδρομής με πολλές εναλλακτικές, και όχι ως κάτι
αναπόφεκτο, ούτε καν ως αναγκαίο βήμα, για αυτά που θα μπορούσαν να
δημιουργηθούν. Ακόμη περισσότερο από μια κριτική ανάγνωση της
τεχνολογικής εξέλιξης, το κυρίαρχο αφήγημα που διατρέχει το σώμα του
κειμένου, αλλά και το συμπληρωματικό περιεχόμενο, είναι μια έμφαση σε
εκείνες τις διαχρονικές τεχνολογίες και τεχνικές που επιτρέπουν την
κατασκευή νέων εναλλακτικών συστημάτων διάδρασης για τις ανάγκες του
σήμερα αλλά και του αύριο.</p>
<p>Αυτό που παραμένει διαχρονικό δεν είναι τόσο κάποια δεδομένη γραφική
διεπαφή, όπως αυτή του κινητού ή επιτραπέζιου συστήματος, αλλά κυρίως
εκείνη η σύνθεση υλικών και δυνάμεων όπως, διαδραστικών αξιών, μεθόδων,
αρχετύπων, τεχνικών, και μοντέλων που δημιούργησαν εκείνες τις διεπαφές.
Με αυτόν τον τρόπο, ο αναγνώστης μαθαίνει κυρίως να σκέφτεται για τις
συνθήκες και για τον τρόπο που κατασκευάστηκαν τα υπάρχοντα διαδραστικά
συστήματα, έτσι ώστε να μπορέσει στην συνέχεια, αφού κρίνει και
ερμηνεύσει το παρελθόν, να συνθέσει τις δυνάμεις της σύγχρονης εποχής
για την κατασκευή μελλοντικών συστημάτων διάδρασης.</p>
<p>Οι παραπάνω παραδοχές επηρεάζουν το περιεχόμενο και την μορφή του
βιβλίου. Το περιεχόμενο φαίνεται σαν να γράφτηκε κάπου την δεκαετία του
2000, έτσι ώστε σε δέκα χρόνια από σήμερα να έχει την ίδια αξία, αφού η
κατανόηση μας για εκείνα τα συστήματα λίγο θα έχει αλλάξει στο μεταξύ.
Επιπλέον, δίνεται έμφαση στα κλασικά συστήματα διάδρασης γιατί με την
βοήθεια της χρονικής απόστασης που έχουμε μπορούμε να ξεχωρίσουμε
καθαρότερα τις ιδιότητες εκείνες που είναι διαχρονικές από εκείνες που
απλά εξυπηρετούσαν παλιά κίνητρα, ή ταίριαζαν στο οργανωσιακό πλαίσιο
μιας εποχής ή οργανισμού. Αντίστοιχα, και η μορφή του βιβλίου ακολουθεί
το περιεχόμενο του και συνοδεύεται από εικόνες συστημάτων που θεωρούνται
κλασικά, ανεξάρτητα από την εμπορική αποδοχή τους, αρκεί να περιέχουν
αξίες και ιδέες που τελικά συναντάμε διαχρονικά.</p>
<p>Συνοπτικά, σε αυτό το βιβλίο γίνεται μια σύνθεση γνώσεων με στόχο την
έμπνευση του αναγνωστή, ο οποίος θα αναζητήσει περισσότερα έξω από αυτό,
και γιατί όχι θα μπει σε ένα διάλογο με τον συγγραφέα, στο αποθετήριο
ανοικτού πηγαίου κειμένου του βιβλίου που υπάρχει για αυτόν τον σκοπό.
Με αυτόν τον τρόπο, τόσο η συγγραφή όσο και η ανάγνωση αυτού του
βιβλίου, γίνονται με μορφή κριτικού διαλόγου, όπως ακριβώς δηλαδή και το
πνεύμα που διατρέχει το βιβλίο απέναντι στις τεχνολογίες των συστημάτων
διάδρασης.</p>
<h1 id="εισαγωγή">Εισαγωγή</h1>
<blockquote>
<p>Η μάθηση δεν είναι το αποτέλεσμα της διδασκαλίας, αλλά το αποτέλεσμα
της δραστηριότητας του μαθητή. John Holt</p>
</blockquote>
<p>Η κατασκευή της διάδρασης είναι μια σχετικά νέα γνωστική περιοχή, η
οποία δημιουργήθηκε από τη μεγάλη αποδοχή που γνώρισαν τα συστήματα
διάδρασης ανθρώπου και υπολογιστή σε ένα ευρύτατο φάσμα εφαρμογών της
καθημερινότητας και της εργασίας. Είναι τόσες πολλές οι ψηφιακές ανάγκες
των ανθρώπων σε διαφορετικές πτυχές της ζωής τους (π.χ., ευζωία,
ψυχαγωγία, μάθηση, εμπόριο, εργασία, κτλ.) και ταυτόχρονα δημιουργούνται
συνέχεια τόσο νέες συσκευές όσο και νέες συνδέσεις μεταξύ τους, ώστε η
κατασκευή της διάδρασης αναδεικνύεται οργανικά σε πρωταγωνιστή στη
σχεδίαση και κατασκευή νέων ανθρώπινων και κοινωνικών δραστηριοτήτων. Το
βιβλίο αυτό βασίζεται στην άποψη ότι η κατασκευή της διάδρασης, εκτός
του ότι είναι κάτι περισσότερο από το άθροισμα των επιμέρους τμημάτων,
είναι κυρίως ένα νέο τεχνολογικό επίπεδο το οποίο έχει τη δυνατότητα να
επαναπροσδιορίσει με καλό ή κακό τρόπο όλες τις ανθρώπινες και
κοινωνικές δραστηριότητες.</p>
<p>Συνήθως, όταν έχουμε μια νέα γνωστική περιοχή οι επιστήμονες θα
προσπαθήσουν να την προσεγγίσουν μεθοδικά, σύμφωνα με τις τεχνικές που
έχουν δουλέψει σε παρόμοιες περιοχές στο παρελθόν. Για παράδειγμα, ο
προγραμματισμός αντιμετωπίζεται ως υποπερίπτωση της ευρύτερης περιοχής
των μηχανικών (π.χ., μηχανολόγοι μηχανικοί), αφού έχει να κάνει με την
κατασκευή και λειτουργία μιας μηχανής. Ταυτόχρονα, είναι λογικό η
διάδραση να αντιμετωπίζεται ως υποπερίπτωση της ευρύτερης περιοχής του
βιομηχανικού σχεδιασμού (όπως π.χ. η γραφιστική και η εργονομία). Στην
ειδική περίπτωση της κατασκευής της διάδρασης και με δεδομένο ότι
αναφερόμαστε σε μια σύνθετη περιοχή, διαφορετικού επιπέδου από τις
επιμέρους, δεν έχουμε την ευχέρεια να κάνουμε τις παραπάνω
απλουστεύσεις.</p>
<p>Οι συσκευές διάδρασης με τους υπολογιστές, και αντίστοιχα η κατασκευή
της διάδρασής τους, είναι έννοιες φευγαλέες τουλάχιστον για την περίοδο
από τη δεκαετία του 1970 μέχρι και τη δεκαετία του 2010, αφού η διάδραση
με τους υπολογιστές ξεκινάει από το τραπέζι και περνάει στα κινητά,
φορετά, και διάχυτα συστήματα. Tη δεκαετία του 1970, η τυπική μορφή του
προσωπικού υπολογιστή ήταν ο επιτραπέζιος υπολογιστής χωρίς γραφικό
περιβάλλον εργασίας, το οποίο υπήρξε αντικείμενο έρευνας στα εργαστήρια.
Τη δεκαετία του 1980, η γραφική επιφάνεια εργασίας έγινε εμπορικά
διαθέσιμη, ενώ παράλληλα, το μεγαλύτερο μέρος του λογισμικού είχε
περάσει από τη γραμμή εντολών στα μενού και στις φόρμες, οπότε το
πληκτρολόγιο παρέμεινε η πιο δημοφιλής συσκευή εισόδου. Τη δεκαετία του
1990, η γραφική επιφάνεια εργασίας και το ποντίκι έγιναν ο κυρίαρχος
τρόπος διάδρασης με τον προσωπικό υπολογιστή, οπότε η συσκευή εισόδου
ποντίκι και η έμμεση διάδραση με αντικείμενα στην οθόνη μέσω του δείκτη
καθόρισε τα πιο δημοφιλή στυλ διάδρασης. Στα τέλη της δεκαετίας του
2000, ο κινητός υπολογιστής με οθόνη αφής έφερε στο προσκήνιο τις
χειρονομίες και την άμεση διάδραση στην οθόνη, ενώ τη δεκαετία του 2010,
ο υπολογιστής διαχέεται πέρα από το γραφείο, τόσο στο περιβάλλον όσο και
στο ανθρώπινο σώμα, δημιουργώντας έτσι ένα οικοσύστημα συσκευών και
εφαρμογών για τον χρήστη. Αντίστοιχα, η κατασκευή της διάδρασης
εξελίσσεται έτσι ώστε τα βασικά αρχέτυπα και εργαλεία να διευκολύνουν
τον χειρισμό των νέων συσκευών του χρήστη, όπως είναι το πληκτρολόγιο, η
οθόνη, το ποντίκι, η οθόνη αφής, κτλ.</p>
<p>Παράλληλα και πάντα αλληλένδετα με την εξέλιξη του υλικού και της
φυσικής μορφής του υπολογιστή, έχουμε μια εξέλιξη του λογισμικού και του
στυλ διάδρασης με τον υπολογιστή, η οποία σχετίζεται περισσότερο με τις
εφαρμογές και τις διεργασίες του χρήστη. Οι πρώτες δημοφιλείς εφαρμογές
του προσωπικού υπολογιστή ήταν ο επεξεργαστής κειμένου και τα φύλλα
εργασίας, τα οποία αποτελούσαν το βασικό κίνητρο αγοράς κατά τις
δεκαετίες του 1970 και του 1980. Τη δεκαετία του 1990 είχαμε τη μεγάλη
υπόσχεση των εκπαιδευτικών και ψυχαγωγικών πολυμέσων, τα οποία τελικά
δεν έφτασαν στον τελικό χρήστη όπως αρχικά είχε σχεδιαστεί (μέσω της
καλωδιακής τηλεόρασης), αλλά περισσότερο μέσω του οπτικού δίσκου, των
κονσολών για βιντεο-παιχνίδια, και του διαδικτύου. Από το τέλος της
δεκαετίας του 2000, έχουμε την επικράτηση των κοινωνικών μέσων δικτύωσης
ως κύριαρχο στυλ διάδρασης με τον υπολογιστή. Πλέον, όλες οι εφαρμογές,
ανεξάρτητα από το αν έχουν στόχο την παραγωγικότητα, την εκπαίδευση, την
ψυχαγωγία, τις εμπορικές συναλλαγές ή την πληροφόρηση, βασίζονται ή
τουλάχιστον έχουν μια διάσταση κοινωνικού δικτύου. Αντίστοιχα, η
κατασκευή της διάδρασης εξελίσσεται, έτσι ώστε τα βασικά αρχέτυπα και
εργαλεία να διευκολύνουν τον χειρισμό των οντοτήτων του χρήστη, όπως
είναι τα τοπικά αρχεία, τα πολυμέσα, τα υπερμέσα, το κοινωνικό δίκτυο,
κτλ.</p>
<p>Η κατασκευή της διάδρασης ανθρώπου και υπολογιστή, όπως είδαμε
συνοπτικά παραπάνω, έχει παραμείνει για πολύ καιρό μια φευγαλέα περιοχή,
επειδή σε κάθε χρονική περίοδο έχουμε διαφορετικές τεχνολογικές μορφές
υπολογιστών (π.χ., επιτραπέζιος, κινητός, φορετός, διάχυτος) διεπαφών με
τους χρήστες (π.χ., γραμμή εντολών, γραφικό περιβάλλον, χειρονομίες,
φυσική γλώσσα) και εφαρμογών (π.χ., προσομοίωση, γραφείο, πλοήγηση,
φωτογραφία). Για παράδειγμα, ένας χρήστης υπολογιστών που έλαβε τη
βασική, δευτεροβάθμια, και τριτοβάθμια εκπαίδευση τη δεκαετία του 1970,
ή το πολύ μέχρι τα μισά της δεκαετίας του 1980, είναι πολύ πιθανό να
έχει μεγάλη εξοικείωση με τη γραμμή εντολών και τους επιτραπέζιους
υπολογιστές, αφού αυτή ήταν η βασική μορφή στα χρόνια της εκπαίδευσής
του. Αντίθετα, ένας χρήστης που έλαβε την εκπαίδευσή του μετά το 2000
και κατά τη δεκαετία του 2010, είναι πολύ πιθανό να μην έχει καθόλου
προσωπικό επιτραπέζιο υπολογιστή, αφού οι βασικές διεργασίες του χρήστη
αυτήν τη χρονική περίοδο (π.χ., αναζήτηση στον παγκόσμιο ιστό, κοινωνική
δικτύωση, ψηφιακό περιεχόμενο, κτλ.) μπορούν να γίνουν εξίσου καλά, αν
όχι καλύτερα, με έναν κινητό υπολογιστή με διεπαφή χειρονομίας, η οποία
δεν απαιτεί σχεδόν καμία ανάπτυξη νέων δεξιοτήτων. Η αποδοχή και η
επικράτηση της έννοιας της ευχρηστίας περισσότερο ως οικειότητα με τις
πρώτες εμπειρίες μας έχει αυξήσει μεν την προσβασιμότητα στην πληροφορία
αλλά ταυτόχρονα έχει μειώσει την διαφάνεια των τεχνολογιών διάδρασης
καθώς και τις δεξιότητες στην κατασκευή της διάδρασης.</p>
<p>Βλέπουμε, λοιπόν, ότι στην πράξη, τόσο ο υπολογιστικός όσο και ο
ψηφιακός αλφαβητισμός είναι έννοιες περισσότερο σχετικές με τη
δημογραφία και την ημερομηνία γέννησης, παρά με μια διαχρονική αξία. Για
παράδειγμα, ο όρος υπολογιστής για πολλές δεκαετίες πριν την δημιουργία
των πρώτων ηλεκτρονικών και ψηφιακών υπολογιστών αναφερόταν στον άνθρωπο
που έκανε μαθηματικούς υπολογισμούς για να φτιάξει τριγωνομετρικούς και
λογαριθμικούς πίνακες. Για αυτό τον λόγο, το περιεχόμενο του βιβλίου,
σκόπιμα αποφεύγει τις πιο νέες εξελίξεις και προϊόντα, έτσι ώστε να
είναι όσο γίνεται πιο διαχρονικό. Η έμφαση δίνεται σε παλαιότερα
συστήματα, όχι επειδή υπάρχει μια ρετρολαγνεία, αλλά επειδή υπάρχουν
διαχρονικές τάσεις, που είναι παρούσες και σε σύγχρονα προϊόντα και οι
οποίες ενδέχεται να επηρεάσουν τα μελλοντικά. Η μελέτη παλαιότερων
συστημάτων δεν έχει απλά ιστορικό χαρακτήρα, αλλά σκοπεύει να φωτίσει
εκείνα τα τεχνολογικά και ανθρωπιστικά μοτίβα που εμφανίζονται και σε
σύγχρονα συστήματα, και πολύ πιθανόν και σε μελλοντικά.</p>
<p>Εκτός από την έμφαση στα σύγχρονα και επίκαιρα συστήματα, τα
περισσότερα βιβλία σε θέματα τεχνολογίας προσπαθούν να χωρέσουν όσο
γίνεται περισσότερο περιέχομενο στο τυπικό μέγεθος ενός τυπωμένου ή
ηλεκτρονικού βιβλίου. Σε αυτό το βιβλίο, ο στόχος ήταν να καλύψουμε όσο
γίνεται περισσότερα θέματα σε όσο γίνεται μικρότερο χώρο, άρα και σε
λιγότερο χρόνο για τον αναγνώστη. Επιπλέον, το ύφος της γραφής παραμένει
προφορικό και σκόπιμα αποφεύγει το εγκυπλοπαιδικό, αφού όλες οι
πληροφορίες είναι πλέον διαθέσιμες σε ηλεκτρονικά μέσα, καθώς και στα
κλαδικά βιβλία αναφοράς του τομέα. Ακόμη, το βιβλίο συνοδεύεται από
πολλές εικόνες συσκευών και λογισμικού διάδρασης με τον χρήστη. Οι
εικόνες αυτές σκόπιμα παρουσιάζονται σε ζευγάρια με σχετικά εκτενείς
λεζάντες στην ίδια σελίδα, έτσι ώστε να παρέχουν μια παράλληλη διεπαφή
ανάγνωσης, η οποία είναι σίγουρα πολύ οικεία στην εποχή της εικόνας.
Ακόμη περισσότερες εικόνες και πρόσθετους τρόπους οργάνωσής τους θα βρει
ο αναγνώστης στην ιστοσελίδα του βιβλίου, όπου υπάρχουν εικόνες σε
χρονολόγια και σε διαφάνειες. Με αυτόν τον τρόπο, το βιβλίο γίνεται
περισσότερο προσβάσιμο για τον αναγνώστη, αλλά και συμπληρωματικό με
άλλες προσπάθειες.</p>
<p>Αυτό το βιβλίο απευθύνεται σε όσους εμπλέκονται με οποιονδήποτε ρόλο
στην σχεδιάση και κατασκευή συστημάτων διάδρασης ανθρώπου και
υπολογιστή. Επομένως, είναι χρήσιμο τόσο σε επαγγελματίες όσο και σε
φοιτητές μαθημάτων πληροφορικής, μηχανικής και σχεδίασης, που θέλουν να
αποκτήσουν μια εισαγωγή στην περιοχή ή θέλουν να τακτοποιήσουν σκόρπιες
γνώσεις. Επιπλέον, με δεδομένη την εξάπλωση των εργαλείων της
πληροφορικής σε πολλούς συγγενείς τεχνολογικούς και επιστημονικούς
κλάδους, αλλά και σε ακόμη περισσότερους κλάδους που ωφελούνται ή ακόμη
και επηρεάζονται από τις εφαρμογές της, το βιβλίο αυτό απευθύνεται σε
όλους αυτούς που συμμετέχουν σε μια ομάδα που καλείται να σχεδιάσει ή να
βελτιώσει ένα διαδραστικό σύστημα που εμπλέκεται σε μια ανθρώπινη
δραστηριότητα, ανεξάρτητα από τον ρόλο τους και ανεξάρτητα από τη βασική
τους δεξιότητα.</p>
<p>Υπάρχουν πολλά βιβλία και ακόμη περισσότερες ελεύθερες πηγές στο
δίκτυο τα οποία είναι πλούσια σε περιεχόμενο και εγκυκλοπαιδικές
γνώσεις, και στα οποία αξίζει να ανατρέξουμε κάθε φορά που θα έχουμε ένα
καλά ορισμένο ερώτημα και θέλουμε να ενημερωθούμε σε βάθος. Η ανάγνωση
ενός βιβλίου είναι μεν αναγκαία συνθήκη, αλλά όχι και ικανή για να
μεταδώσει πρακτικές γνώσεις, ακόμη και όταν ο αναγνώστης μπορεί να
θυμάται το περιεχόμενο. Για αυτόν τον σκοπό, το βιβλίο συνοδεύεται με
συμπληρωματικό πολυμεσικό περιεχόμενο και κυρίως με την δυνατότητα για
την προσθήκη περιεχομένου από τους αναγνώστες σε δικό τους αντίγραφο του
πηγαίου κώδικα. Η εποικοδομητική μελετή του συμπληρωματικού περιεχόμενου
δίνει την δυνατότητα στον αναγνώστη να μεταβεί σταδιακά στην
δραστηριότητα της σκέψης και της συγγραφής και μέσα από αυτήν την
προσπάθεια να κατανόησει καλύτερα όχι απλά το περιεχόμενο, αλλά και την
ευρύτερη γνωστική περιοχή. Η ουσιαστική όμως κατανόηση πρακτικών
ζητημάτων, όπως η κατασκευή της διάδρασης απαιτεί και την πρακτική
ενασχόληση με τα αντίστοιχα ζητήματα, το οποίο γίνεται με τις προτάσεις
για πρόσθετες δραστηριότητες κατασκευής διαδραστικών συστημάτων.</p>
<p>Στα επόμενα κεφάλαια αυτού του βιβλίου μελετάμε εκείνα τα θέματα που
ανεξάρτητα από τις τεχνολογικές εξελίξεις των τελευταίων δεκαετιών
παραμένουν διαχρονικά και επίκαιρα.</p>
<h1 id="ορισμός">Ορισμός</h1>
<blockquote>
<p>Ο προγραμματισμός είναι ένας τρόπος σκέψης, όχι μια μηχανιστική
δεξιότητα. Το να μάθεις τους βρόγχους ‘for’ δε σημαίνει πως μαθαίνεις να
προγραμματίζεις, όπως δε σημαίνει πως μαθαίνεις να ζωγραφίζεις
μαθαίνοντας για τα μολύβια. Bret Victor</p>
</blockquote>
<h3 id="περίληψη">Περίληψη</h3>
<p>Η διάδραση του ανθρώπου με υπολογιστές έχει καθιερωθεί στις
περισσότερες ανθρώπινες δραστηριότητες, από την εργασία μέχρι την
εκπαίδευση και τη διασκέδαση. Ο προγραμματισμός της διάδρασης που
απαιτείται για την κατασκευή άρτιων συστημάτων είναι μια σύνθετη έννοια
και μια διαδικασία που προϋποθέτει δεξιότητες τόσο τεχνολογικές, όσο και
ανθρωπιστικές. Για παράδειγμα, δεν αρκεί ένας κατασκευαστής να είναι
ικανός προγραμματιστής, θα πρέπει να έχει και άριστη κατανόηση του
ανθρώπινου παράγοντα αλλά και της διαδικασίας σχεδίασης. Αν και υπάρχουν
πολλοί ικανοί κατασκευαστές συστημάτων, όπως και σχεδιαστές με γνώσεις
ανθρωπιστικών επιστημών, για να λύσουμε ένα πρόβλημα από δυο οπτικές
(μηχανή-άνθρωπος) απαιτείται μια σύνθεση των δύο οπτικών. Η ενότητα αυτή
ορίζει ποιος είναι αυτός ο γόνιμος συνδυασμός και γιατί είναι
απαραίτητος στον προγραμματισμό διαδραστικών συστημάτων.</p>
<h2 id="η-αξία-της-κατασκευής-συστημάτων-διάδρασης">Η αξία της
κατασκευής συστημάτων διάδρασης</h2>
<p>Για κάθε σύστημα που δίνει ρόλο στον ανθρώπινο παράγοντα θα πρέπει
πρώτα να τεκμηριώσουμε πως ορίζουμε και καταλαβαίνουμε τον άνθρωπο. Η
κατανόηση αυτή δεν μπορεί να είναι αντικειμενική γιατί ανάλογα με την
γνωστική περιοχή υπάρχει μια διαφορετική οπτική γωνία, ενώ ακόμη και
μέσα στην ίδια γνωστική περιοχή έχουμε διαφορετικές σχολές. Για
παράδειγμα, στην περιοχή της σύγχρονης δυτικής ιατρικής η έμφαση είναι
στα επιμέρους ανθρώπινα όργανα, ενώ στις αντίστοιχες παραδοσιακές
ανατολικές, η έμφαση είναι σε μια ολιστική αντίλειψη. Ακόμη, στην
περιοχή της βιολογίας η έμφαση είναι στις αντικειμενικές διαδράσεις που
έχουν τα κύταρα σε κλίμακα, τα οποία λίγο διαφέρουν από τα αντίστοιχα
συγγενικών βιολογικών οργανισμών. Από την άλλη, στην ψυχολογία και στην
κοινωνιολογία υπάρχουν σχολές που δίνουν έμφαση στην ατομική και
συλλογική συμπεριφορά τα οποία διαμορφώνονται κυρίως από το εκπαιδευτικό
και πολιτισμικό περιβάλλον των ανθρώπων. Πράγματι, το αξιακό σύστημα
ενός πολιτισμού καθορίζει στον μεγαλύτερο βαθμό και τον ορισμό που
έχουμε για τον άνθρωπο, ενώ σημαντικό ρόλο παίζει και η οπτική γωνία των
επιμέρους γνωστικών περιοχών. Όμοια στην περιοχή της διάδρασης υπάρχουν
διαφορετικές σχολές, αλλά και χρονικές περίοδοι, με διαφορετικά αξιακά
συστήματα.</p>
<figure id="fig:augmentation-typewriter">
<img src="../images/augmentation-typewriter.jpg"
alt="Η επαύξηση της ανθρώπινης σκέψης με την συνδρομή κάποιου εργαλείου είναι μια πολύ δυνατή ιδέα, αλλά ταυτόχρονα κάπως δύσκολη να την μοιραστούμε γιατί δεν υπάρχουν πολλά πετυχημένα παραδείγματα. Για αυτόν τον σκοπό, ο Douglas Engelbart συνήθιζε να κάνει ένα πείραμα ως αναλογία, όπου ζητούσε στους συνομιλητές του να γράψουν το ίδιο κείμενο με μια γραφομηχανή, με ένα στυλό, και τέλος με έναν στυλό δεμένο με ένα τούβλο." />
<figcaption aria-hidden="true">Η επαύξηση της ανθρώπινης σκέψης με την
συνδρομή κάποιου εργαλείου είναι μια πολύ δυνατή ιδέα, αλλά ταυτόχρονα
κάπως δύσκολη να την μοιραστούμε γιατί δεν υπάρχουν πολλά πετυχημένα
παραδείγματα. Για αυτόν τον σκοπό, ο Douglas Engelbart συνήθιζε να κάνει
ένα πείραμα ως αναλογία, όπου ζητούσε στους συνομιλητές του να γράψουν
το ίδιο κείμενο με μια γραφομηχανή, με ένα στυλό, και τέλος με έναν
στυλό δεμένο με ένα τούβλο.</figcaption>
</figure>
<figure id="fig:nls-cscw">
<img src="../images/nls-cscw.jpg"
alt="Ο επεξεργαστής κειμένου στο NLS δεν σχεδιάστηκε για να γράφει κείμενο σε αρχεία ένας χρήστης, γιατί αυτό θα ήταν απλά μια κακή προσομοίωση της γραφομηχανής. Ο σκοπός αυτού του συστήματος διάδρασης είναι να συνεργάζονται πολλοί χρήστες μαζί πάνω σε ένα επαυξημένο έγγραφο, το οποίο επιτρέπει εκτός από την είσοδο νέων δεδομένων, την πλοήγηση και την οπτικοποίηση διαφορετικών όψεων. Η συνεργασία μπορεί να γίνει τόσο με το πληκτρολόγιο, όσο και με τις χειρονομίες από τον δείκτη του ποντικιού, καθώς και με ταυτόχρονη προβολή βίντεο από τον χρήστη, με στόχο την επαύξηση της νοημοσύνης μέσω της συνεργασίας ανθρώπων και υπολογιστών." />
<figcaption aria-hidden="true">Ο επεξεργαστής κειμένου στο NLS δεν
σχεδιάστηκε για να γράφει κείμενο σε αρχεία ένας χρήστης, γιατί αυτό θα
ήταν απλά μια κακή προσομοίωση της γραφομηχανής. Ο σκοπός αυτού του
συστήματος διάδρασης είναι να συνεργάζονται πολλοί χρήστες μαζί πάνω σε
ένα επαυξημένο έγγραφο, το οποίο επιτρέπει εκτός από την είσοδο νέων
δεδομένων, την πλοήγηση και την οπτικοποίηση διαφορετικών όψεων. Η
συνεργασία μπορεί να γίνει τόσο με το πληκτρολόγιο, όσο και με τις
χειρονομίες από τον δείκτη του ποντικιού, καθώς και με ταυτόχρονη
προβολή βίντεο από τον χρήστη, με στόχο την επαύξηση της νοημοσύνης μέσω
της συνεργασίας ανθρώπων και υπολογιστών.</figcaption>
</figure>
<p>Τα συστήματα διάδρασης έχουν ενσωματώσει διαχρονικά πολλές επιρροές
από διαφορετικές γνωστικές περιοχές, ενώ και το πολιτισμικό υπόβαθρο των
σημαντικότερων συντελεστών διαφέρουν σημαντικά σε κάθε περίοδο. Η αρχική
θεμελίωση της περιοχής της κατασκευής των συστημάτων διάδρασης έγινε την
δεκαετία του 1960, <a href="#fn1" id="fnref1" class="footnote-ref"
role="doc-noteref"><sup>1</sup></a> όπου οραματίζονται έναν συχνό και
προχωρημένο χρήστη, ο οποίος συνεργάζεται με άλλους χρήστες μέσω του
συστήματος, <a href="#fn2" id="fnref2" class="footnote-ref"
role="doc-noteref"><sup>2</sup></a> <a href="#fn3" id="fnref3"
class="footnote-ref" role="doc-noteref"><sup>3</sup></a> με στόχο την
κατανόηση πολύπλοκων φυσικών ή κοινωνικών φαινομένων. Εδώ, ο άνθρωπος
είναι μια δυναμική οντότητα που μαθαίνει συνέχεια και μετασχηματίζεται
μέσα από την συνεργασία και την διάδραση, ενώ και τα προβλήματα που
αντιμετωπίζει δεν είναι σαφώς ορισμένα.</p>
<p>Μια δεκαετία αργότερα, η πιο συστηματική θεμελίωση έγινε από
γνωστικούς ψυχολόγους, <a href="#fn4" id="fnref4" class="footnote-ref"
role="doc-noteref"><sup>4</sup></a> οι οποίοι μοντελοποιούν τον άνθρωπο
σαν έναν επεξεργαστή πληροφορίας, ο οποίος βρίσκεται μόνος του μπροστά
σε ένα τερματικό και εκτελεί επαναλαμβανόμενες απλές διεργασίες, οι
οποίες δεν απαιτούν δεξιότητα πέρα από μια σύντομη εκπαίδευση. Στη
περίπτωση αυτή, ο άνθρωπος είναι κάτι σταθερό, σαν ένα γρανάζι μιας
μηχανής που εκτελεί συνέχεια την ίδια διεργασία. <a href="#fn5"
id="fnref5" class="footnote-ref" role="doc-noteref"><sup>5</sup></a></p>
<p>Το παράδειγμα της στατικής θεώρησης του ανθρώπου είναι αυτό που
επικράτησε, γιατί σίγουρα είναι το πιο εύκολο να μάθουν οι χρήστες και
ταυτόχρονα είναι το πιο αποδοτικό για όσους οργανώνουν τις διεργασίες
των χρηστών. Αν δηλαδή θεωρήσουμε τον άνθρωπο σαν το στατικό εξάρτημα
μιας μηχανής που είναι πάντα το ίδιο και σχετικά προβλέψιμο, τότε το
συνολικό σύστημα είναι πιο εύκολο να κατασκευαστεί. Ταυτόχρονα όμως, η
στατική θεώρηση του ανθρώπινου παράγοντα δεν αφήνει πολλά περιθώρια για
την βελτίωση και επαύξηση του προς μια νέα κατάσταση με περισσότερες
γνώσεις και δεξιότητες, από την οποία νέα κατάσταση θα αλληλεπιδράσει με
νέα μηχανήματα που θα κατασκευάσει.<a href="#fn6" id="fnref6"
class="footnote-ref" role="doc-noteref"><sup>6</sup></a></p>
<p>Έχοντας δώσει ένα πλαίσιο και ενδεικτικά παραδείγματα για τον ορισμό
του ανθρώπου, θα πρέπει να κάνουμε το ίδιο και για τον υπολογιστή. Για
παράδειγμα, η χρήση της λέξης υπολογιστής για την περιγραφή των
δημοφιλών επιτραπέζιων και κινητών συστημάτων είναι μια σχετικά πρόσφατη
σύμβαση. Μέχρι και την δεκαετία του 1950, η λέξη υπολογιστής αναφέρεται
με απόλυτη σαφήνεια σε μια ανθρώπινη δουλειά γραφείου,<a href="#fn7"
id="fnref7" class="footnote-ref" role="doc-noteref"><sup>7</sup></a> που
αφορούσε τον υπολογισμό λογαριθμικών πινάκων για χρήση στον υπολογισμό
της τροχιάς πυραύλων και στην θαλάσσια πλοήγηση. Η εφεύρεση και διάδοση
των πρώτων κεντρικών υπολογιστών λίγο αργότερα άλλαξε εντελώς το νόημα
της λέξης, αφού την ίδια ακριβώς δουλειά, δηλαδή τον υπολογισμό των
λογαριθμικών πινάκων, την έκαναν πλέον μηχανήματα.</p>
<figure id="fig:human-computers">
<img src="../images/human-computers.jpg"
alt="Από τον 17ο αιώνα και μέχρι την δεκαετία του 1950 ο όρος υπολογιστής αναφέρεται σε έναν άνθρωπο που κάνει υπολογισμούς για να ετοιμάσει τριγωνομετρικούς και λογαριθμικούς πίνακες, οι οποίοι χρησιμοποιούνταν ευρέως στην ναυτική πλοήγηση. Με την εμφάνιση των πρώτων ηλεκτρονικών και λίγο μετά ψηφιακών υπολογιστών η χρήση του όρου άλλαξε για να αναφέρεται πλέον σε συσκευές και όχι σε ανθρώπους." />
<figcaption aria-hidden="true">Από τον 17ο αιώνα και μέχρι την δεκαετία
του 1950 ο όρος υπολογιστής αναφέρεται σε έναν άνθρωπο που κάνει
υπολογισμούς για να ετοιμάσει τριγωνομετρικούς και λογαριθμικούς
πίνακες, οι οποίοι χρησιμοποιούνταν ευρέως στην ναυτική πλοήγηση. Με την
εμφάνιση των πρώτων ηλεκτρονικών και λίγο μετά ψηφιακών υπολογιστών η
χρήση του όρου άλλαξε για να αναφέρεται πλέον σε συσκευές και όχι σε
ανθρώπους.</figcaption>
</figure>
<figure id="fig:transistor-radio">
<img src="../images/transistor-radio.png"
alt="Το τρανζιστοράκι της δεκαετίας του 1950 ήταν συνώνυμο με την πρώτη πραγματικά φορητή και δημοφιλή εκδοχή του ραδιοφώνου με τρανζίστορ. Ταυτόχρονα ήταν και η πρώτη δημοφιλής εφαρμογή της εφεύρεσης του τρανζίστορ, το οποίο στην συνέχεια θα μπει σε πολλές συσκευές που μέχρι τότε δούλευαν με λυχνίες, όπως ο υπολογιστής. Εκτός από την χρήση τρανζίστορ, αυτό που είναι κοινό και στις δύο αυτές περιπτώσεις (τρανζιστοράκι, υπολογιστής) είναι πως τα ονομάζουμε με αναφορά στην εσωτερική τους λειτουργία και όχι αναφορικά με την χρήση τους, η οποία στην περίπτωση του υπολογιστή είναι ένα ανοιχτό θέμα." />
<figcaption aria-hidden="true">Το τρανζιστοράκι της δεκαετίας του 1950
ήταν συνώνυμο με την πρώτη πραγματικά φορητή και δημοφιλή εκδοχή του
ραδιοφώνου με τρανζίστορ. Ταυτόχρονα ήταν και η πρώτη δημοφιλής εφαρμογή
της εφεύρεσης του τρανζίστορ, το οποίο στην συνέχεια θα μπει σε πολλές
συσκευές που μέχρι τότε δούλευαν με λυχνίες, όπως ο υπολογιστής. Εκτός
από την χρήση τρανζίστορ, αυτό που είναι κοινό και στις δύο αυτές
περιπτώσεις (τρανζιστοράκι, υπολογιστής) είναι πως τα ονομάζουμε με
αναφορά στην εσωτερική τους λειτουργία και όχι αναφορικά με την χρήση
τους, η οποία στην περίπτωση του υπολογιστή είναι ένα ανοιχτό
θέμα.</figcaption>
</figure>
<p>Την ίδια ακριβώς περίοδο, η εφεύρεση του τρανζίστορ επέτρεψε την
κατασκευή μικρών φορητών ραδιοφώνων, τα όποια έμειναν γνωστά για μια
γενιά ανθρώπων ως τρανζιστοράκια.<a href="#fn8" id="fnref8"
class="footnote-ref" role="doc-noteref"><sup>8</sup></a> Με το ίδιο
σκεπτικό, θα μπορούσαμε να ονοματίσουμε τους λεγόμενους κινητούς και
φορετούς υπολογιστές επίσης τρανζιστοράκια, αφού είναι γεμάτοι από αυτά.
Ταυτόχρονα, η ονομασία έξυπνο τηλέφωνο και η συσχέτιση της με τις
δημοφιλείς συσκευές Android και iOS αποτελεί μια ακόμη χειρότερη
παρανόηση για μια κατηγορία προϊόντων που οι κατασκευαστές τους θέλουν
να θεωρούνται έξυπνα. Επομένως, το γεγονός ότι ένα κατασκεύασμα
χρησιμοποιεί κάποιο υλικό ή λογισμικό για να κάνει κάποια λειτουργία δεν
μπορεί να καθορίζει την ονομασία του, ούτε φυσικά μπορούμε να
βασιζόμαστε σε χαρακτηρισμούς από τον κατασκευαστή.<a href="#fn9"
id="fnref9" class="footnote-ref" role="doc-noteref"><sup>9</sup></a></p>
<p>Έχοντας περιγράψει ένα πλαίσιο επιμέρους ορισμών για τον άνθρωπο και
τον υπολογιστή, μπορούμε να περάσουμε στο κεντρικό μας θέμα που είναι η
διάδραση τους. Μια από τις αρχικές και πολύ δημοφιλείς θεωρήσεις της
διάδρασης είναι αυτή του αυτοματισμού, ή της κατασκευής έξυπνων
συστημάτων, δηλαδή ο στόχος της κατασκευής της διάδρασης είναι να μην
έχουμε καθόλου διάδραση, ή αν η διάδραση είναι απαραίτητη, αυτή να
γίνεται με φυσικούς τρόπους, όπως είναι η ομιλία. Η περιοχή της Τεχνητής
Νοημοσύνης εστιάζει πάνω σε αυτόν τον στόχο και μετά από πενήντα χρόνια
έχει σημειώσει πρόοδο, αλλά με αρκετούς περιορισμούς, καθώς και με
παραδοχές που δεν είναι πάντα εποικοδομητικές για τις δυνατότητες του
ανθρώπου. <a href="#fn10" id="fnref10" class="footnote-ref"
role="doc-noteref"><sup>10</sup></a> Αντίθετα, η σχολή της επαυξημένης
νοημοσύνης θεωρεί πως η κατασκευή συστημάτων διάδρασης μπορεί να γίνει
με τέτοιο τρόπο ώστε να βελτιώνουν όχι μόνο τις επιδόσεις μας σε μια
διεργασία, αλλά και να αυξάνουν την συλλογική νοημοσύνη. Για αυτόν τον
σκοπό, η διάδραση με έναν επεξεργαστή κειμένου είναι κάτι περισσότερο.
Για παράδειγμα, στο σύστημα NLS η επεξεργασία κειμένου γίνεται με ένα
εξειδικευμένο πληκτρολόγιο ακόρντων που αυξάνει την ταχύτητα και την
εργονομία. Ανάμεσα σε πολλές άλλες πρωτιές, το σύστημα NLS επιτρέπει την
συνεργασία μεταξύ χρηστών που βρίσκονται σε διαφορετικά τερματικά σε
πραγματικό χρόνο.<a href="#fn11" id="fnref11" class="footnote-ref"
role="doc-noteref"><sup>11</sup></a> Επίσης, γίνεται συνεργατικά με μια
δομημένη μορφή κειμένου, που βασίζεται στο υπερκείμενο και στο ιστορικό
των εγγράφων, έτσι ώστε να μην υπάρχουν αμφισημίες και ασάφειες.</p>
<p>Το πιο χαρακτηριστικό παράδειγμα διάδρασης είναι αυτό του
επιτραπέζιου υπολογιστή και της γραφικής επιφάνειας εργασίας, που
ελέγχεται από τον χρήστη με συσκευές εισόδου όπως το πληκτρολόγιο και το
ποντίκι. <a href="#fn12" id="fnref12" class="footnote-ref"
role="doc-noteref"><sup>12</sup></a> Η επιτραπέζια μορφή υπολογιστή και
διάδρασης είναι σημαντική, γιατί ήταν η πρώτη που ξέφυγε από τις μέχρι
τότε πολύ εξειδικευμένες εφαρμογές όπως είναι οι βάσεις δεδομένων. Έτσι,
μπόρεσε να διευκολύνει τις εργασίες και την καθημερινότητα πάρα πολλών
χρηστών με την επεξεργασία κειμένου, την ανάκτηση πληροφορίας από τον
ιστό, και την επικοινωνία μέσω του ηλεκτρονικού ταχυδρομείου. Αν και το
μοντέλο διάδρασης με τον επιτραπέζιο υπολογιστή δεν είναι ούτε τόσο
δημοφιλές, ούτε τόσο εύκολο, όσο αυτό του κινητού υπολογισμού με τα
έξυπνα κινητά και τις ταμπλέτες, έχει ιδιαίτερο ενδιαφέρον, γιατί έχει
μείνει σχετικά ίδιο από τότε που δημιουργήθηκε, πράγμα που επιβεβαιώνει
ότι ανεξάρτητα από τη ραγδαία τεχνολογική εξέλιξη, η ανθρώπινη διάδραση
κινείται σε πιο αργούς ρυθμούς.<a href="#fn13" id="fnref13"
class="footnote-ref" role="doc-noteref"><sup>13</sup></a> Σε αυτό το
πλαίσιο, η ευχρηστία και η εμπειρία του χρήστη αποτελούν τους κεντρικούς
ορισμούς, και έχουν καθορίσει τον τρόπο που επεξεργαζόμαστε έγγραφα. <a
href="#fn14" id="fnref14" class="footnote-ref"
role="doc-noteref"><sup>14</sup></a> <a href="#fn15" id="fnref15"
class="footnote-ref" role="doc-noteref"><sup>15</sup></a></p>
<figure id="fig:xerox-bravo">
<img src="../images/xerox-bravo.png"
alt="Η εφαρμογή Bravo ήταν ο πρώτος επεξεργαστής κειμένου με οπτική απεικόνιση στις αρχές της δεκαετίας του 1970 και λειτουργούσε στον υπολογιστή Xerox Alto που είχε οθόνη σε θέση πορτρέτου. Η είσοδος από την πλευρά του χρήστη ήταν τροπική, κάτι που βελτιώθηκε στον διάδοχο του, το Gypsy." />
<figcaption aria-hidden="true">Η εφαρμογή Bravo ήταν ο πρώτος
επεξεργαστής κειμένου με οπτική απεικόνιση στις αρχές της δεκαετίας του
1970 και λειτουργούσε στον υπολογιστή Xerox Alto που είχε οθόνη σε θέση
πορτρέτου. Η είσοδος από την πλευρά του χρήστη ήταν τροπική, κάτι που
βελτιώθηκε στον διάδοχο του, το Gypsy.</figcaption>
</figure>
<figure id="fig:wordstar-editor">
<img src="../images/wordstar-editor.png"
alt="Οι πρώτοι επεξεργαστές κειμένου για τους μικροϋπολογιστές της δεκαετίας του 1980 εμπνέονται από τον Xerox Bravo και προσπαθούν να αποδώσουν, σε μια οθόνη απλού κειμένου χωρίς πολλαπλές γραμματοσειρές, την τελική εμφάνιση και ροή του κειμένου στην τυπωμένη σελίδα. Το αποτέλεσμα είναι ένας συνδυασμός από τα μειονεκτήματα των δύο κόσμων, χωρίς κανένα πλεονέκτημα τους, αλλά αυτό δεν θα εμποδίσει το WordStar και τους ανταγωνιστές του να κυριαρχίσουν στην αγορά." />
<figcaption aria-hidden="true">Οι πρώτοι επεξεργαστές κειμένου για τους
μικροϋπολογιστές της δεκαετίας του 1980 εμπνέονται από τον Xerox Bravo
και προσπαθούν να αποδώσουν, σε μια οθόνη απλού κειμένου χωρίς πολλαπλές
γραμματοσειρές, την τελική εμφάνιση και ροή του κειμένου στην τυπωμένη
σελίδα. Το αποτέλεσμα είναι ένας συνδυασμός από τα μειονεκτήματα των δύο
κόσμων, χωρίς κανένα πλεονέκτημα τους, αλλά αυτό δεν θα εμποδίσει το
WordStar και τους ανταγωνιστές του να κυριαρχίσουν στην
αγορά.</figcaption>
</figure>
<p>Αν και η ευχρηστία είναι μια από τις βασικές αξίες της διάδρασης, δεν
είναι η μόνη, ενώ η σημασία της μπορεί να είναι πολύ μικρή σε ορισμένες
περιπτώσεις. Αν, για παράδειγμα, το σύστημα διάδρασης έχει εφαρμογή στην
διασκέδαση, τότε θέλουμε η διάδραση να προσφέρει, εκτός από απλή
ευχρηστία, ψυχαγωγία και μάθηση. Στην περίπτωση της βελτίωσης ενός
συστήματος που είτε προϋπάρχει είτε είναι παρόμοιο με υπάρχοντα
συστήματα, τότε ο πιο απλός τρόπος από πλευράς κόστους,
αποτελεσματικότητας, και ταχύτητας είναι να βασιστούμε σε επιτυχημένα
ιστορικά παραδείγματα. Πράγματι, η αντιλαμβανόμενη ευχρηστία σχετίζεται
περισσότερο με την οικειότητα του χρήστη με ένα σύστημα,<a href="#fn16"
id="fnref16" class="footnote-ref" role="doc-noteref"><sup>16</sup></a>
παρά με την αντικειμενική επίδοση του μετά από κάποια μικρή περίοδο
εξάσκησης. Για παράδειγμα, η εκμάθηση του πληκτρολογίου ακόρντων ή μιας
τροπικής διεπαφής, απαιτεί μερικές ώρες εκπαίδευσης, αλλά έχει
διαχρονικό κέρδος τόσο στην απόδοση όσο και στην εργονομία, κατά την
επεξεργασία κειμένου. Παρομοίως, η διακόσμηση της διεπαφής με εικονίδια
και περίτεχνα περιγράμματα που αλληλοκαλύπτονται παρέχει μόνο
υποκειμενική αισθητική οικειότητα, ενώ δεν έχει καμία αντικειμενική
απόδοση, ειδικά για τον συχνό χρήστη.</p>
<p>Το γεγονός αυτό, από μόνο του, αποτελεί την σημαντικότερη γνώση σε
αυτήν την περιοχή και ταυτόχρονα δείχνει ότι με αυτήν την νοοτροπία η
εφικτή καινοτομία μπορεί να παρουσιαστεί μόνο σταδιακά και ποτέ ως
μετάβαση παραδείγματος. Η κατανόηση της καινοτομίας περισσότερο ως
γραμμική βελτίωση παρά ως σημαντική μετατόπιση παραδείγματος αποτελεί
για την περιοχή της διάδρασης μια από τις σημαντικότερες αντιφάσεις, η
οποία θεμελειώθηκε στα τέλη της δεκαετίας του 1970 κατά την μετάβαση από
το Xerox PARC στην Apple. Πράγματι, η Apple με το κίνητρο της διάδοσης
των προσωπικών συστημάτων διάδρασης σε όσο γίνεται μεγαλύτερο πληθυσμό
δημιουργεί με μεγάλη ακρίβεια συστήματα τα οποία είναι πολύ εύκολα για
τον περιστασιακό χρήστη. Στην συνέχεια μοχλεύει την οικειότητα του
χρήστη με μια διεπαφή ώστε να δημιουργήσει την επόμενη έκδοση, όπου το
κίνητρο, παραμένει η οικειότητα και όχι η βέλτιση διεπαφή, ειδικά αν ο
χρήστης είναι συχνός. Φυσικά τα κυρίαρχα συστήματα έχουν σημαντικές
αρετές, εκτός από την υποκειμενική ευχρηστία τους για τον άπειρο και
περιστασιακό χρήστη, μας παρέχουν ένα πλαίσιο κατανόησης της κατασκευής
συστημάτων διάδρασης, έτσι ώστε να μπορέσουμε να φτιάξουμε εναλλακτικά
με τις ίδιες τεχνικές και τεχνολογίες αλλά με διαφορετική φιλοσοφία,
κίνητρα και κατεύθυνση.</p>
<section id="footnotes" class="footnotes footnotes-end-of-section"
role="doc-endnotes">
<hr />
<ol>
<li><div id="fn1">
<p><span class="citation" data-cites="licklider1960man">Licklider
(1960)</span>, <span class="citation"
data-cites="engelbart1962augmenting">Engelbart (1962)</span><a
href="#fnref1" class="footnote-back" role="doc-backlink">↩︎</a></p>
</div></li>
<li><div id="fn2">
<p>fig:augmentation-typewriter<a href="#fnref2" class="footnote-back"
role="doc-backlink">↩︎</a></p>
</div></li>
<li><div id="fn3">
<p>fig:nls-cscw<a href="#fnref3" class="footnote-back"
role="doc-backlink">↩︎</a></p>
</div></li>
<li><div id="fn4">
<p><span class="citation" data-cites="card1983psychology">Card, Newell,
και Moran (1983)</span><a href="#fnref4" class="footnote-back"
role="doc-backlink">↩︎</a></p>
</div></li>
<li><div id="fn5">
<p><span class="citation" data-cites="card1983psychology">Card, Newell,
και Moran (1983)</span><a href="#fnref5" class="footnote-back"
role="doc-backlink">↩︎</a></p>
</div></li>
<li><div id="fn6">
<p><span class="citation" data-cites="engelbart1962augmenting">Engelbart
(1962)</span><a href="#fnref6" class="footnote-back"
role="doc-backlink">↩︎</a></p>
</div></li>
<li><div id="fn7">
<p>fig:human-computers<a href="#fnref7" class="footnote-back"
role="doc-backlink">↩︎</a></p>
</div></li>
<li><div id="fn8">
<p>fig:transistor-radio<a href="#fnref8" class="footnote-back"
role="doc-backlink">↩︎</a></p>
</div></li>
<li><div id="fn9">
<p><span class="citation" data-cites="lanier2014owns">Lanier
(2014)</span><a href="#fnref9" class="footnote-back"
role="doc-backlink">↩︎</a></p>
</div></li>
<li><div id="fn10">
<p><span class="citation" data-cites="engelbart1962augmenting">Engelbart
(1962)</span>, <span class="citation"
data-cites="weizenbaum1976computer">Weizenbaum (1976)</span><a
href="#fnref10" class="footnote-back" role="doc-backlink">↩︎</a></p>
</div></li>
<li><div id="fn11">
<p><span class="citation" data-cites="licklider1960man">Licklider
(1960)</span><a href="#fnref11" class="footnote-back"
role="doc-backlink">↩︎</a></p>
</div></li>
<li><div id="fn12">
<p><span class="citation" data-cites="freiberger1984fire">Freiberger και
Swaine (1984)</span>, <span class="citation"
data-cites="hiltzik1999dealers">Hiltzik (1999)</span>, <span
class="citation" data-cites="hertzfeld2004revolution">Hertzfeld
(2004)</span><a href="#fnref12" class="footnote-back"
role="doc-backlink">↩︎</a></p>
</div></li>
<li><div id="fn13">
<p><span class="citation" data-cites="waldrop2001dream">Waldrop
(2001)</span><a href="#fnref13" class="footnote-back"
role="doc-backlink">↩︎</a></p>
</div></li>
<li><div id="fn14">
<p>fig:xerox-bravo<a href="#fnref14" class="footnote-back"
role="doc-backlink">↩︎</a></p>
</div></li>
<li><div id="fn15">
<p>fig:wordstar-editor<a href="#fnref15" class="footnote-back"
role="doc-backlink">↩︎</a></p>
</div></li>
<li><div id="fn16">
<p><span class="citation" data-cites="raskin2000humane">Raskin
(2000)</span><a href="#fnref16" class="footnote-back"
role="doc-backlink">↩︎</a></p>
</div></li>
</ol>
</section>
<h2 id="κατασκευή-υποδείγματος-και-επανάληψη">Κατασκευή υποδείγματος και
επανάληψη</h2>
<p>Η διαδικασία κατασκευής ενός λειτουργικού υποδείγματος είναι χρήσιμη
ως μηχανισμός κατανόησης της διάδρασης που θέλουμε να υλοποιήσουμε, ενώ
όταν το υπόδειγμα είναι σε μια πρώτη ικανοποιητική μορφή τότε μπορεί να
χρησιμοποιηθεί για δοκιμές με τους τελικούς χρήστες ή ακόμη και να
δημοσιευτεί ως αρχική έκδοση (π.χ., έκδοση άλφα, βήτα, από την ορολογία
της τεχνολογίας λογισμικού). Αυτή η προσέγγιση είναι γνωστή στη
βιβλιογραφία και ως <em>το υπόδειγμα ως προδιαγραφές</em>. Δηλαδή, αντί
να ετοιμάσουμε ένα λεπτομερές συμβόλαιο που θα περιγράφει με λέξεις και
διαγράμματα το αποτέλεσμα, έχουμε το ίδιο το αποτέλεσμα (εν τη γενέσει
του) να δηλώνει τις ίδιες τις προδιαγραφές του. Αυτό είναι μια σχετικά
απλή ιδέα που όμως φέρνει σε μεγάλη αντίθεση την περιοχή της κατασκευής
συστημάτων διάδρασης με τις συγγενείς περιοχές της επιστήμης των
μηχανικών, ακόμη και με τη γονική περιοχή της τεχνολογίας λογισμικού.
Επίσης, αποδεικνύει την κεντρική θέση αυτού του βιβλίου, ότι η κατασκευή
συστημάτων διάδρασης είναι μια νέα περιοχή που, ναι μεν έχει αρκετές
ομοιότητες με άλλες, αλλά τελικά έχει τόσες διαφορές που απαιτεί
ουσιαστικά διαφορετική αντιμετώπιση.</p>
<figure id="fig:sage-lightgun">
<img src="../images/sage-lightgun.jpg"
alt="Ένας από τους μεγαλύτερους σε μέγεθος και πολύ ισχυρός υπολογιστής της δεκαετίας του 1950 ήταν ο SAGE (Semi-Automatic Ground Environment), ο οποίος συγκέντρωνε τα δεδομένα πτήσεων από ένα δίκτυο ραντάρ και τα πρόβαλε στην οθόνη μαζί με απλά γραφικά χάρτη. Ο χρήστης μπορούσε να επιλέξει ένα σημείο στο ραντάρ με την βοήθεια μια αρχικής μορφής πένας, για να ταυτοποιήσει το αντίστοιχο αντικείμενο." />
<figcaption aria-hidden="true">Ένας από τους μεγαλύτερους σε μέγεθος και
πολύ ισχυρός υπολογιστής της δεκαετίας του 1950 ήταν ο SAGE
(Semi-Automatic Ground Environment), ο οποίος συγκέντρωνε τα δεδομένα
πτήσεων από ένα δίκτυο ραντάρ και τα πρόβαλε στην οθόνη μαζί με απλά
γραφικά χάρτη. Ο χρήστης μπορούσε να επιλέξει ένα σημείο στο ραντάρ με
την βοήθεια μια αρχικής μορφής πένας, για να ταυτοποιήσει το αντίστοιχο
αντικείμενο.</figcaption>
</figure>
<figure id="fig:sketchpad-interaction">
<img src="../images/sketchpad-interaction.png"
alt="Το σύστημα Sketchpad θεωρείται το πρώτο σημαντικό σύστημα αλληλεπίδρασης ανθρώπου και υπολογιστή με χρήση γραφικών. Οι κεντρικοί υπολογιστές εκείνής της εποχής συνήθως βασίζονταν σε διάτρητες κάρτες ή σε τερματικά γραμμής. Με αυτόν τον τρόπο, το Sketchpad έδειξε ότι είναι εφικτό να έχουμε έναν υπολογιστή, ο οποίος να μην αλληλεπιδρά με τον χρήστη με τον τρόπο που βολεύει μόνον τον υπολογιστή." />
<figcaption aria-hidden="true">Το σύστημα Sketchpad θεωρείται το πρώτο
σημαντικό σύστημα αλληλεπίδρασης ανθρώπου και υπολογιστή με χρήση
γραφικών. Οι κεντρικοί υπολογιστές εκείνής της εποχής συνήθως βασίζονταν
σε διάτρητες κάρτες ή σε τερματικά γραμμής. Με αυτόν τον τρόπο, το
Sketchpad έδειξε ότι είναι εφικτό να έχουμε έναν υπολογιστή, ο οποίος να
μην αλληλεπιδρά με τον χρήστη με τον τρόπο που βολεύει μόνον τον
υπολογιστή.</figcaption>
</figure>
<p>Αν και υπάρχουν πάρα πολλές τεχνικές και μεθοδολογίες και ακόμη
περισσότερα εργαλεία και δομές για την κατασκευή της διάδρασης, αν
έπρεπε να τα συνοψίσουμε όλα σε μια πρόταση, θα λέγαμε ότι: η κατασκευή
της διάδρασης είναι η επαναληπτική κατασκευή ενός υποδείγματος. Αυτή η
επανατοποθέτηση του προβλήματος της κατασκευής μας επιτρέπει να
στρέψουμε την προσοχή μας στη φύση και στον ρόλο του υποδείγματος ως ένα
είδος ζωντανών και ευμετάβλητων προδιαγραφών ενός νέου συστήματος. Η
κατασκευή ενός νέου συστήματος διάδρασης, όσο νέο και αν είναι, συνήθως
βασίζεται σε κάποια υλικά που υπάρχουν ήδη διαθέσιμα. Για παράδειγμα, ο
μετασχηματισμός της διάδρασης πέρα από τον τηλέτυπο ξεκίνησε με νέες
συσκευές εισόδου, όπως η πένα, καθώς και με την χρήστη της οθόνης από
ραντάρ για την απεικόνηση γραφικών. <a href="#fn17" id="fnref17"
class="footnote-ref" role="doc-noteref"><sup>17</sup></a> Το σύστημα
SAGE δημιουργήθηκε στο MIT και οι συσκευές διάδρασης ήταν οικείες.
Φυσικά απαιτήθηκε πολυετής εργασία και ένας νέος ψηφιακός υπολογιστής
για να μπορέσουν οι ίδιες συσκευές διάδρασης να παίξουν έναν νέο ρόλο
στο σύστημα Sketchpad. <a href="#fn18" id="fnref18" class="footnote-ref"
role="doc-noteref"><sup>18</sup></a> Αρκεί μια οπτική σύγκριση των δύο
συστημάτων για να δούμε ότι τα αρχέτυπα για τις βασικές συσκευές εισόδου
και εξόδου με τον χρήστη είναι οι ίδιες ακριβώς και στα δύο συστήματα.
Φυσικά διαφέρει πολύ ο κεντρικός υπολογιστής και κυρίως διαφέρει η
κατασκευή της διάδρασης, αφού το Sketchpad δεν είναι απλά μια
αναπαράσταση της πραγματικότητας, αλλά ένας συνεργατής που διευκολύνει
την σχεδίαση μηχανολογικών συστημάτων.</p>
<p>Το υπόδειγμα θα πρέπει να είναι διαδραστικό, διαφορετικά είναι
σκόπιμο να το χαρακτηρίσουμε ως ένα αρχικό προσχέδιο. Τα προσχέδια και
τα υποδείγματα κάθε άλλο παρά νέα είναι στην περιοχή των μηχανικών. Οι
αρχιτέκτονες μηχανικοί ξεκινάνε τη σχεδίαση στο χαρτί, γιατί αυτός είναι
παραδοσιακά ο πιο γρήγορος τρόπος αναπαράστασης μια ιδέας και βοηθάει τη
σχεδιαστική σκέψη. Αντίστοιχα, η κατασκευή της διάδρασης είναι σκόπιμο
να ξεκινήσει από ένα σύντομο αφηγηματικό σενάριο, το οποίο θα
συνοδεύεται από μερικές ενδεικτικές οθόνες. Παρά τις ομοιότητες με τους
αρχιτέκτονες μηχανικούς, σημαντικές διαφορές στη μέθοδο προκύπτουν
επειδή το αποτέλεσμα του προγραμματισμού της διάδρασης δεν είναι κάτι
στέρεο και σταθερό, αλλά κάτι πολύ ρευστό, ευμετάβλητο, και φευγαλέο,
που αλλάζει ανάλογα με τη χρήση. Επιπλέον, τόσο τα προσχέδια όσο και τα
πρωτότυπα θα πρέπει να αντικατοπτρίζουν την κίνηση που υπάρχει εκ των
πραγμάτων σε μια διάδραση, κάτι που δύσκολα γίνεται στο χαρτί ή με απλές
εικόνες. Για τον λόγο αυτό, στα προσχέδια του προγραμματισμού της
διάδρασης θέλουμε να δημιουργήσουμε τουλάχιστον ένα λειτουργικό
υπόδειγμα, <a href="#fn19" id="fnref19" class="footnote-ref"
role="doc-noteref"><sup>19</sup></a> <a href="#fn20" id="fnref20"
class="footnote-ref" role="doc-noteref"><sup>20</sup></a> ώστε να μπορεί
ο σχεδιαστής και οι άλλοι συμμετέχοντες της ομάδας όχι μόνο να
φανταστούν το τελικό προϊόν, αλλά να το χρησιμοποιήσουν.</p>
<figure id="fig:pebble-hifi">
<img src="../images/pebble-hifi.png"
alt="Το Arduino στη βασική του μορφή χρησιμοποιείται κατά το στάδιο της ανάπτυξης λειτουργικών υποδειγμάτων υψηλής πιστότητας για νέα συστήματα διάδρασης, όπως το έξυπνο ρολόϊ pebble, αφού επιτρέπει τον γρήγορο έλεγχο, ενώ διευκολύνει και τη μετάβαση στην παραγωγή, καθώς το κύκλωμά του είναι ελεύθερα διαθέσιμο για χρήση και μετατροπή." />
<figcaption aria-hidden="true">Το Arduino στη βασική του μορφή
χρησιμοποιείται κατά το στάδιο της ανάπτυξης λειτουργικών υποδειγμάτων
υψηλής πιστότητας για νέα συστήματα διάδρασης, όπως το έξυπνο ρολόϊ
pebble, αφού επιτρέπει τον γρήγορο έλεγχο, ενώ διευκολύνει και τη
μετάβαση στην παραγωγή, καθώς το κύκλωμά του είναι ελεύθερα διαθέσιμο
για χρήση και μετατροπή.</figcaption>
</figure>
<figure id="fig:handspring-buck">
<img src="../images/handspring-buck.jpg"
alt="Στην φάση της μετάβασης από τα αρχικά προσχέδια σε λειτουργικά πρωτότυπα υπάρχει πολύ μεγάλη ασάφεια αναφορικά με το λογισμικό και υλικό ειδικά στις περιπτώσεις που έχουμε νέες συσκευές, όπως ένα έξυπνο κινητό ή άλλες συσκευές διάχυτου υπολογισμού. Το πρωτότυπο υψηλής πιστότητας τύπου Buck γερυφώνει αυτήν την μετάβαση με την δημιουργική επαναχρησιμοποίηση υλικού και λογισμικού που ήδη υπάρχει, ακόμη και αν αυτά δεν θα είναι ίδια στο τελικό προϊόν, αρκεί να είναι αντιπροσωπευτικά της διάδρασης." />
<figcaption aria-hidden="true">Στην φάση της μετάβασης από τα αρχικά
προσχέδια σε λειτουργικά πρωτότυπα υπάρχει πολύ μεγάλη ασάφεια αναφορικά
με το λογισμικό και υλικό ειδικά στις περιπτώσεις που έχουμε νέες
συσκευές, όπως ένα έξυπνο κινητό ή άλλες συσκευές διάχυτου υπολογισμού.
Το πρωτότυπο υψηλής πιστότητας τύπου Buck γερυφώνει αυτήν την μετάβαση
με την δημιουργική επαναχρησιμοποίηση υλικού και λογισμικού που ήδη
υπάρχει, ακόμη και αν αυτά δεν θα είναι ίδια στο τελικό προϊόν, αρκεί να
είναι αντιπροσωπευτικά της διάδρασης.</figcaption>
</figure>
<p>Οι διαφορές από τους αρχιτέκτονες μηχανικούς στην κατασκευή του
πρωτοτύπου συνεχίζονται στην περίπτωση της μακέτας. Ενώ η μακέτα είναι
για τους αρχιτέκτονες ένα προχωρημένο πρωτότυπο που αναπαριστά υπό
κλίμακα σε τρεις διαστάσεις το μελλοντικό προϊόν, στον προγραμματισμό
της διάδρασης ένα διαδραστικό πρωτότυπο είναι σχεδόν το ίδιο με το
τελικό προϊόν. Η σημαντικότερη όμως διαφορά σε σχέση με τους
αρχιτέκτονες και τις άλλες συγγενείς επιστήμες του μηχανικού είναι ότι
ένα διαδραστικό πρωτότυπο, και φυσικά το τελικό προϊόν, δεν ακολουθούν
καθόλου διακριτά στάδια κατά τις φάσεις της σχεδίασης, της παραγωγής και
της βελτίωσης. Για παράδειγμα, η πρώτη εμπορική έκδοση του δημοφιλούς
Apple iPhone δεν είχε εφαρμογές άλλων κατασκευαστών λογισμικού, παρά
μόνο τις επίσημες εφαρμογές της εταιρείας. Ήταν αυτό το <em>τελικό
προϊόν</em>, ή μήπως ένα πολύ <em>προχωρημένο πρωτότυπο</em>; Μπορεί από
την πλευρά του υλικού η συσκευή να βελτιώθηκε σταδιακά, όμως από την
πλευρά του λογισμικού, η νέα δυνατότητα του συστήματος να δέχεται
πρόσθετες εφαρμογές δημιούργησε ουσιαστικά ένα καινούργιο προϊόν.
Επομένως, θα μπορούσαμε να χαρακτηρίσουμε το πρώτο εμπορικό iPhone ως
ένα προχωρημένο διαδραστικό πρωτότυπο των σύγχρονων iPhone, τα οποία δεν
έχουν πάψει να εξελίσσονται. Σε συνδυασμό με το λογισμικό που διατίθεται
από την ίδια την εταιρεία (στο οποίο συχνά συνεισφέρουν ανεξάρτητοι
προγραμματιστές), νέο, εξωτερικό υλικό προστίθεται και διευκολύνει
σημαντικές ανθρώπινες δραστηριότητες που έχουν να κάνουν με τις
συναλλαγές, την υγεία, τη δημιουργία και τη διασκέδαση, παράγοντας
ουσιαστικά ένα οικοσύστημα διάδρασης.</p>
<p>Οι βασικές τεχνολογίες και ο αντίστοιχος προγραμματισμός της
δικτύωσης, της αποθήκευσης και της επεξεργασίας δεδομένων, και κυρίως
της εισόδου και εξόδου της διεπαφής με τον άνθρωπο, είναι δομικά
στοιχεία του συστήματος. Επομένως, θέλουμε άμεση και εύκολη πρόσβαση σε
όλα αυτά μαζί, χωρίς να πρέπει να ανησυχούμε για τις λεπτομέρειες της
υλοποίησης. Αν και οι λεπτομέρειες της υλοποίησης θα έχουν μεγάλη
σημασία όταν το σύστημά μας θα βρίσκεται στις ζωές πολλών ανθρώπων, σε
αυτήν τη φάση της ανάπτυξης (κατά την οποία δεχόμαστε ότι δεν ξέρουμε τι
ακριβώς ετοιμάζουμε, ούτε το πώς θα επηρεάσει την καθημερινότητα των
ανθρώπων) είναι σκόπιμο να μην ασχοληθούμε με αυτές. Με αυτό το
δεδομένο, η επιλογή των εργαλείων ανάπτυξης (ειδικά της γλώσσας
προγραμματισμού και των βιβλιοθηκών) απλουστεύεται, αλλά σε καμία
περίπτωση δεν μπορεί να χαρακτηριστεί εύκολη, πράγμα που θα δούμε στο
αντίστοιχο κεφάλαιο των εργαλείων του προγραμματισμού της διάδρασης.</p>
<p>Με δεδομένη την ανάγκη ανάπτυξης δεξιοτήτων που θεμελιώνουν τον
ψηφιακό αλφαβητισμό πέρα από την απλή χρήση -προς τη βαθύτερη κατανόηση
λειτουργίας και ιδανικά τη δημιουργία νέων διαδράσεων- ένα ερώτημα που
προκύπτει αφορά στην επιλογή του εργαλείου, την οργάνωση, αλλά και τη
διαδικασία δημιουργίας της διάδρασης. Για να απαντήσουμε σε αυτό το
ερώτημα θα πρέπει να ανατρέξουμε στη φύση του προγραμματισμού της
διάδρασης. Το βασικό στοιχείο αυτής της περιοχής είναι ότι οι τελικές
προδιαγραφές του συστήματος μάς είναι άγνωστες κατά το αρχικό στάδιο,
ενώ είναι σίγουρο ότι ακόμη και αν έχουμε τις πρώτες εκδόσεις σε
λειτουργικό επίπεδο, οι προδιαγραφές θα συνεχίζουν να προσαρμόζονται με
τη χρήση και τη διαδικασία της επαναληπτικής αξιολόγησης (iterative
evaluation process). Επομένως, τα κατάλληλα εργαλεία, οι διαδικασίες και
οι δομές θα πρέπει να μπορούν να αλλάζουν γρήγορα, τόσο τα ίδια όσο και
τα δημιουργήματά τους. Επομένως, τα καταλληλότερα εργαλεία δεν είναι τα
έτοιμα, αλλά είναι αυτά που θα κατασκευάσουμε και ταιριάζουν στο πεδίο
του προβληματος.</p>
<section id="footnotes" class="footnotes footnotes-end-of-section"
role="doc-endnotes">
<hr />
<ol start="17">
<li><div id="fn17">
<p>fig:sage-lightgun<a href="#fnref17" class="footnote-back"
role="doc-backlink">↩︎</a></p>
</div></li>
<li><div id="fn18">
<p>fig:sketchpad-interaction<a href="#fnref18" class="footnote-back"
role="doc-backlink">↩︎</a></p>
</div></li>
<li><div id="fn19">
<p>fig:pebble-hifi<a href="#fnref19" class="footnote-back"
role="doc-backlink">↩︎</a></p>
</div></li>
<li><div id="fn20">
<p>fig:handspring-buck<a href="#fnref20" class="footnote-back"
role="doc-backlink">↩︎</a></p>
</div></li>
</ol>
</section>
<h2 id="η-διάδραση-σε-μεγαλύτερη-κλίμακα">Η διάδραση σε μεγαλύτερη
κλίμακα</h2>
<figure id="fig:logo-robot">
<img src="../images/logo-robot.jpg"
alt="Η πρώτη εφαρμογή των υπολογιστών στην βασική εκπαίδευση εντοπίζεται σχεδόν παράλληλα με τα πρώτα γραφικά περιβάλλοντα διάδρασης. Ο Seymour Papert σχεδίασε ένα σύστημα που επιτρέπει ακόμη και σε παιδιά προσχολικής ηλικίας να εξερευνήσουν σημαντικές έννοιες από τα μαθηματικά, τις φυσικές επιστήμες, και την μηχανική χωρίς να απαιτεί γνώσεις από τα ανώτερα γνωστικά και συμβολικά επίπεδα αυτών των περιοχών. Σταδιακά το ρομπότ συμπληρώθηκε με την οθόνη των γραφικών, η οποία καθώς το κόστος μειώθηκε έδωσε πρόσβαση σε περισσότερα σχολεία και μαθητές." />
<figcaption aria-hidden="true">Η πρώτη εφαρμογή των υπολογιστών στην
βασική εκπαίδευση εντοπίζεται σχεδόν παράλληλα με τα πρώτα γραφικά
περιβάλλοντα διάδρασης. Ο Seymour Papert σχεδίασε ένα σύστημα που
επιτρέπει ακόμη και σε παιδιά προσχολικής ηλικίας να εξερευνήσουν
σημαντικές έννοιες από τα μαθηματικά, τις φυσικές επιστήμες, και την
μηχανική χωρίς να απαιτεί γνώσεις από τα ανώτερα γνωστικά και συμβολικά
επίπεδα αυτών των περιοχών. Σταδιακά το ρομπότ συμπληρώθηκε με την οθόνη
των γραφικών, η οποία καθώς το κόστος μειώθηκε έδωσε πρόσβαση σε
περισσότερα σχολεία και μαθητές.</figcaption>
</figure>
<figure id="fig:children-alto">
<img src="../images/children-alto.png"
alt="To Xerox Alto ήταν ένα ενδιάμεσο πρωτότυπο για το Dynabook, που απευθύνεται σε παιδιά, οπότε οι χρήστες στις πρώτες δοκιμές ήταν πολύ συχνά παιδιά από το δημοτικό. Με αυτόν τον τρόπο, το σύστημα διάδρασης με ποντίκι και με γραφικό περιβάλλον που αναπτύχθηκε εκεί απευθύνεται κυρίως σε χρήστες μικρότερης ηλικίας. Ταυτόχρονα, το σύστημα αυτό δεν περιλαμβάνει λειτουργικό σύστημα ή αρχεία και προτρέπει τους μικρούς χρήστες να αναπτύξουν μαζί με την καθοδήγηση του δασκάλου τις εφαρμογές που τους ενδιαφέρουν." />
<figcaption aria-hidden="true">To Xerox Alto ήταν ένα ενδιάμεσο
πρωτότυπο για το Dynabook, που απευθύνεται σε παιδιά, οπότε οι χρήστες
στις πρώτες δοκιμές ήταν πολύ συχνά παιδιά από το δημοτικό. Με αυτόν τον
τρόπο, το σύστημα διάδρασης με ποντίκι και με γραφικό περιβάλλον που
αναπτύχθηκε εκεί απευθύνεται κυρίως σε χρήστες μικρότερης ηλικίας.
Ταυτόχρονα, το σύστημα αυτό δεν περιλαμβάνει λειτουργικό σύστημα ή
αρχεία και προτρέπει τους μικρούς χρήστες να αναπτύξουν μαζί με την
καθοδήγηση του δασκάλου τις εφαρμογές που τους ενδιαφέρουν.</figcaption>
</figure>
<p>Η κατασκευή της διάδρασης έχει παραμείνει μια φευγαλέα περιοχή,
επειδή σε κάθε χρονική περίοδο έχουμε διαφορετικές μορφές υπολογιστών
(π.χ., επιτραπέζιος, κινητός, φορετός, διάχυτος) και διεπαφών με τους
χρήστες (π.χ., γραμμή εντολών, γραφικό περιβάλλον, χειρονομίες, φυσική
γλώσσα). Για παράδειγμα, ένας χρήστης υπολογιστών που έλαβε τη βασική,
δευτεροβάθμια, και τριτοβάθμια εκπαίδευση τη δεκαετία του 1970, ή το
πολύ μέχρι τα μισά της δεκαετίας του 1980, είναι πολύ πιθανό να έχει
μεγάλη εξοικείωση με τη γραμμή εντολών και τους επιτραπέζιους
υπολογιστές, αφού αυτή ήταν η βασική μορφή στα χρόνια της εκπαίδευσής
του. Αντίστοιχα, ένας χρήστης που έλαβε την εκπαίδευσή του μετά το 2000
και κατά τη δεκαετία του 2010, είναι πολύ πιθανό να μην έχει καθόλου
προσωπικό επιτραπέζιο υπολογιστή, αφού οι βασικές διεργασίες του χρήστη
αυτήν τη χρονική περίοδο (π.χ., αναζήτηση στον παγκόσμιο ιστό, κοινωνική
δικτύωση, ψηφιακό περιεχόμενο, κτλ.) μπορούν να γίνουν εξίσου καλά, αν
όχι καλύτερα, με έναν κινητό υπολογιστή. Βλέπουμε, λοιπόν, ότι στην
πράξη, ο ψηφιακός αλφαβητισμός ως βασική δεξιότητα πρόσβασης στην
πληροφορίας είναι μια έννοια περισσότερο σχετική με τη δημογραφία και
την ημερομηνία γέννησης, παρά μια διαχρονική αξία.</p>
<p>Ο διαδραστικός τρόπος σκέψης είναι στενά συνδεδεμένος με το εκάστοτε
νόημα που αποδίδουμε στον ψηφιακό αλφαβητισμό. Η αρχική κατασκευή και
θεώρηση των συστημάτων διάδρασης στόχευε σε έναν προχωρημένο και συχνό
χρήστη, όπου η ευχρηστία ταυτίζεται κυρίως με την βελτίωση της εργασίας,
αλλά και με την εργονομία, αφού θα πρέπει να εργάζεται για πολλές ώρες.
Λίγο αργότερα, οι ερευνητές προσπάθησαν να διευκολύνουν την εξέλιξη των
δυνατοτήτων του ανθρώπου με διαδραστικά συστήματα μάθησης, <a
href="#fn21" id="fnref21" class="footnote-ref"
role="doc-noteref"><sup>21</sup></a> τα οποία δεν εξασκούν απλά τις
γνώσεις και τις δεξιότητες, αλλά καλλιεργούν τον τρόπο σκέψης. <a
href="#fn22" id="fnref22" class="footnote-ref"
role="doc-noteref"><sup>22</sup></a> Από την άλλη πλευρά, η τεχνολογία
της διάδρασης μπορεί να θεωρηθεί σαν μια νέα τεχνολογία γραφής.
Πράγματι, οι άνθρωποι μαθαίνουν σχετικά εύκολα να μιλάνε, αλλά η
δεξιότητα της ανάγνωσης απαιτεί πολλά χρόνια εκπαίδευσης. Επομένως, μια
γόνιμη αναλογία είναι να θεωρήσουμε την διάδραση σαν ένα νέο σύστημα
γραφής, το οποίο απαιτεί πολλά χρόνια εκπαίδευσης <a href="#fn23"
id="fnref23" class="footnote-ref" role="doc-noteref"><sup>23</sup></a>
ειδικά για όσους θέλουν να βελτιωθούν, ενώ ταυτόχρονα δεν φαίνεται να
έχει κάποιο τερματικό σημείο. <a href="#fn24" id="fnref24"
class="footnote-ref" role="doc-noteref"><sup>24</sup></a></p>
<figure id="fig:kidsim">
<img src="../images/kidsim.png"
alt="Η έκθεση στον προγραμματισμό της διάδρασης από μικρές ηλικίες έχει αναγνωριστεί ως μια σημαντική αξία του ψηφιακού αλφαβητισμού και έχει γίνει μια διαχρονική προσπάθεια να φτιαχτούν οπτικές γλώσσες προγραμματισμού ώστε η διάδραση με τους υπολογιστές να είναι κάτι περισσότερο από απλή κατανάλωση έτοιμων εμπειριών. Το KidSim βασίζεται στην οπτική διάδραση με παραδείγματα, όπου ο κώδικας παράγεται αυτόματα χωρίς κείμενο ή τουβλάκια." />
<figcaption aria-hidden="true">Η έκθεση στον προγραμματισμό της
διάδρασης από μικρές ηλικίες έχει αναγνωριστεί ως μια σημαντική αξία του
ψηφιακού αλφαβητισμού και έχει γίνει μια διαχρονική προσπάθεια να
φτιαχτούν οπτικές γλώσσες προγραμματισμού ώστε η διάδραση με τους
υπολογιστές να είναι κάτι περισσότερο από απλή κατανάλωση έτοιμων
εμπειριών. Το KidSim βασίζεται στην οπτική διάδραση με παραδείγματα,
όπου ο κώδικας παράγεται αυτόματα χωρίς κείμενο ή
τουβλάκια.</figcaption>
</figure>
<figure id="fig:mit-scratch">
<img src="../images/mit-scratch.png"
alt="Το περιβάλλον προγραμματισμού MIT Scratch έδωσε τη δυνατότητα σε πολλές ομάδες χρηστών, ακόμη και μικρών ηλικιών, να δημιουργήσουν εύκολα και χωρίς τυπική εκπαίδευση το δικό τους λογισμικό, το οποίο συνήθως έχει την μορφή μιας διαδραστικής ιστορίας. Η ευχρηστία του βασίζεται στην οπτικοποίηση απλών εντολών με την μορφή δομικών στοιχείων που συνδέονται μεταξύ τους, αλλά αυτός ο τρόπος προγραμματισμού είναι μονοθεματικός και δεν επιτρέπει την δημιουργία κλίμακας και μεγαλύτερων συστημάτων." />
<figcaption aria-hidden="true">Το περιβάλλον προγραμματισμού MIT Scratch
έδωσε τη δυνατότητα σε πολλές ομάδες χρηστών, ακόμη και μικρών ηλικιών,
να δημιουργήσουν εύκολα και χωρίς τυπική εκπαίδευση το δικό τους
λογισμικό, το οποίο συνήθως έχει την μορφή μιας διαδραστικής ιστορίας. Η
ευχρηστία του βασίζεται στην οπτικοποίηση απλών εντολών με την μορφή
δομικών στοιχείων που συνδέονται μεταξύ τους, αλλά αυτός ο τρόπος
προγραμματισμού είναι μονοθεματικός και δεν επιτρέπει την δημιουργία
κλίμακας και μεγαλύτερων συστημάτων.</figcaption>
</figure>
<p>Η θέση του ψηφιακού αλφαβητισμού ως κάτι περισσότερο από εκπαίδευση
στην απλή χρήση των τεχνολογιών πληροφόρησης και επικοινωνίας έχει
διαπιστωθεί από τα μισά της δεκαετίας του 1990, όταν τα γραφικά
περιβάλλοντα διεπαφής με τον χρήστη είχαν κλείσει μια δεκαετία εμπορικής
ζωής. Οι ερευνητές διαπίστωσαν, ότι τα παιδιά που μεγάλωσαν με τη
γραφική επιφάνεια εργασίας είχαν μεν μεγαλύτερη εξοικείωση με την
παρουσία του υπολογιστή στη ζωή τους, αλλά είχαν πολύ μικρότερες
δεξιότητες στη δημιουργική χρήση του. Η διαπίστωση αυτή οδήγησε σε μια
σειρά από προσπάθειες τόσο στο λογισμικό όσο και στο υλικό υπολογιστών,
έτσι ώστε να κρατήσουμε την προσβασιμότητα των σύγχρονων υπολογιστών,
χωρίς όμως να χάσουμε τις δεξιότητες που προσφέρει η κατασκευή της
διάδρασης. Για παράδειγμα, οι ερευνητές δημιούργησαν λογισμικό όπως τα
KidSim, Etoys, και Scratch τα οποία βασίζονται στον οπτικό
προγραμματισμό (visual programming) και στον προγραμματισμό με βάση
παραδείγματα χρήσης (programming by example). Αντίστοιχα, για την
περίπτωση του υλικού υπολογιστή δημιουργήθηκε το RaspberryPi, το οποίο
είναι πολύ οικονομικό και συνδέεται με την τηλεόραση, έτσι ώστε να έχει
όσο γίνεται μεγαλύτερη διάχυση στους νέους χρήστες υπολογιστών που
διαφορετικά θα μεγάλωναν μόνο με οθόνες αφής. Τέλος, δημιουργήθηκαν
πολλά απτικά προϊόντα προγραμματισμού, τα οποία δεν έχουν καθόλου οθόνη,
και τα οποία βασίζονται στην οργάνωση απτών αντικειμένων, ενώ και το
αποτέλεσμά τους μπορεί να είναι η φυσική κίνηση και διάδραση με ένα
ρομπότ.</p>
<p>Σε πρώτη ανάγνωση, ο προγραμματισμός της διάδρασης φαίνεται το
άθροισμα (ή ίσως η τομή) των επιμέρους περιοχών του προγραμματισμού
υπολογιστή και της διάδρασης ανθρώπου και υπολογιστή. Στην πράξη όμως, η
πρόσθεση των γνώσεων προγραμματισμού σε εκείνες της διάδρασης ανθρώπου
και υπολογιστή δεν είναι ικανή συνθήκη για τη δημιουργία νέων επινοήσεων
ικανών να επαναπροσδιορίσουν ανθρώπινες και κοινωνικές δραστηριότητες.
Αν και είναι σίγουρα αναγκαία συνθήκη να υπάρχουν οι βασικές επιμέρους
γνώσεις, είτε στον ίδιο τον κατασκευαστή είτε στα μέλη μιας ομάδας
συνεργασίας, υπάρχει επιπλέον η ανάγκη για γνώσεις σε ένα υψηλότερο
επίπεδο - στο επίπεδο του προγραμματισμού της διάδρασης. Σε αυτό το
υψηλότερο επίπεδο αφαίρεσης των επιμέρους λεπτομερειών εστιάζουμε στα
εργαλεία, στις δομές και στις διαδικασίες που θα δώσουν δημιουργικές
λύσεις σε υπάρχοντα προβλήματα, και θα επαυξήσουν τις δυνατότητές
μας.</p>
<figure id="fig:linux">
<img src="../images/linux.png"
alt="Οι δύο βασικές προσεγγίσεις στην διάθεση του λογισμικού είναι αυτή του ανοικτού (π.χ., Linux) και του κλειστού κώδικα (π.χ., Microsoft Windows), οι οποίες εμφανίζονται ως αντίπαλες, αλλά σε κάποιες περιπτώσεις μπορούν να λειτουργούν και συμπληρωματικά όπως στην περίπτωση του λογισμικού ανοιχτού κώδικα Red Hat Enterprise Linux, που παρέχεται ως εμπορική υπηρεσία. Το πιο ενδιαφέρον όμως είναι ότι μια συλλογική προσπάθεια όπως το Linux που δεν έχει στόχο το κέρδος, μπορεί και παράγει ένα αποτέλεσμα εφάμιλλο των εμπορικών." />
<figcaption aria-hidden="true">Οι δύο βασικές προσεγγίσεις στην διάθεση
του λογισμικού είναι αυτή του ανοικτού (π.χ., Linux) και του κλειστού
κώδικα (π.χ., Microsoft Windows), οι οποίες εμφανίζονται ως αντίπαλες,
αλλά σε κάποιες περιπτώσεις μπορούν να λειτουργούν και συμπληρωματικά
όπως στην περίπτωση του λογισμικού ανοιχτού κώδικα Red Hat Enterprise
Linux, που παρέχεται ως εμπορική υπηρεσία. Το πιο ενδιαφέρον όμως είναι
ότι μια συλλογική προσπάθεια όπως το Linux που δεν έχει στόχο το κέρδος,
μπορεί και παράγει ένα αποτέλεσμα εφάμιλλο των εμπορικών.</figcaption>
</figure>
<figure id="fig:napster">
<img src="../images/napster.jpg"
alt="Στα τέλη της δεκαετίας του 1990, η συμπίεση των αρχείων μουσικής σε σχετικά μικρά αρχεία και ο εύκολος συνεργατικός διαμοιρασμός τους στο δίκτυο με το λογισμικό Napster άλλαξε μέσα σε πολύ λίγα χρόνια το οικονομικό μοντέλο της διανομής της μουσικής και συνεχίζει να επηρεάζει τον τρόπο που διανέμονται όλα τα ψηφιακά αγαθά. Επομένως, η κατασκευή του λογισμικού διάδρασης δεν είναι απλά ένας ψηφιακός μετασχηματισμός των φυσικών διαδικασιών, αλλά ενδέχεται να επηρεάσει την ίδια την φύση των παραδοσιακών οργανισμών." />
<figcaption aria-hidden="true">Στα τέλη της δεκαετίας του 1990, η
συμπίεση των αρχείων μουσικής σε σχετικά μικρά αρχεία και ο εύκολος
συνεργατικός διαμοιρασμός τους στο δίκτυο με το λογισμικό Napster άλλαξε
μέσα σε πολύ λίγα χρόνια το οικονομικό μοντέλο της διανομής της μουσικής
και συνεχίζει να επηρεάζει τον τρόπο που διανέμονται όλα τα ψηφιακά
αγαθά. Επομένως, η κατασκευή του λογισμικού διάδρασης δεν είναι απλά
ένας ψηφιακός μετασχηματισμός των φυσικών διαδικασιών, αλλά ενδέχεται να
επηρεάσει την ίδια την φύση των παραδοσιακών οργανισμών.</figcaption>
</figure>
<p>Όπως οι οπτικές γλώσσες προγραμματισμού υψηλού επιπέδου (π.χ.,
Scratch) έχουν μικρή μόνο σχέση με τις αντίστοιχες γλώσσες
προγραμματισμού που είναι κοντά στη μηχανή (π.χ., Assembly, C), έτσι και
ο προγραμματισμός της διάδρασης έχει μικρή μόνο σχέση με τις βασικές
επιμέρους περιοχές του, όπως εκείνη του προγραμματισμού ΗΥ. Στην πράξη,
ο προγραμματιστής της διάδρασης είναι χρήσιμο να ξέρει τις βασικές
έννοιες του προγραμματισμού, όπως είναι η μεταβλητή και οι συνθήκες,
αλλά από εκεί και πέρα η δεξιότητά του θα αυξηθεί περισσότερο αν μάθει
να χρησιμοποιεί και να κατασκευάζει νέες βιβλιοθήκες και εργαλεία, παρά
αν μάθει όλες τις αλγοριθμικές λεπτομέρειες που κάνουν ένα πρόγραμμα
υπολογιστή αποδοτικό (π.χ., ταχύτητα, μνήμη). Επομένως, αν και μιλάμε
για προγραμματισμό της διάδρασης, στην πράξη ο προγραμματισμός αυτός,
όπου υπάρχει, αφορά περισσότερο τη δημιουργική σύνθεση και χρήση έτοιμων
και νέων βιβλιοθηκών και εργαλείων με απλές δομές ελέγχου, με τελικό
σκοπό την επαύξηση των ανθρώπινων και κοινωνικών δραστηριοτήτων. Από
αυτήν την πλευρά, ένα από τα πιο φιλικά και εύχρηστα συστήματα διάδρασης
είναι η γραμμή εντολών των συστημάτων τύπου UNIX, όπου απλές εντολές
μπορούν να συνθέσουν νέες εφαρμογές.</p>
<p>Πέρα από την ανάγκη κατανόησης του σύγχρονου ψηφιακού κόσμου, οι
γνώσεις και οι δεξιότητες της κατασκευής της διάδρασης δημιουργούν νέα
προϊόντα και υπηρεσίες που επηρεάζουν τις προσωπικές αντιλήψεις, τις
συνήθειες, τους θεσμούς και τις μορφές κοινωνικής οργάνωσης. Στην εποχή
μας, που η χρήση του υπολογιστή έχει κατηγορηθεί για την αύξηση της
ανεργίας μέσω του αυτοματισμού και της αύξησης της παραγωγικότητας,
μπορούμε να δούμε με αισιοδοξία μια αχαρτογράφητη πτυχή του υπολογιστή
ως μέσου και εργαλείου δημιουργίας ενός νέου επιπέδου ανθρώπινης
δραστηριότητας.</p>
<p>Το λειτουργικό σύστημα των επιτραπέζιων υπολογιστών αρχικά ήταν προς
πώληση ως προϊόν, συσκευασμένο σε κουτί. Στη συνέχεια, έγινε αντιληπτό
ότι το περιεχόμενο του κουτιού ποτέ δεν ήταν το τελικό, αφού λίγες μέρες
μετά τη συσκευασία και διανομή του, γίνονταν ήδη βελτιώσεις στον πηγαίο
κώδικα. Η ανάπτυξη του διαδικτύου ως καναλιού διανομής επέτρεψε στο
λογισμικό να βρει τον χαρακτήρα που του ταιριάζει περισσότερο, ως
υπηρεσία (αν και υπάρχει μια υβριδική ισορροπία ανάμεσα στα δύο όταν το
λογισμικό συνοδεύει κάποια συσκευή). Διαπιστώνουμε ότι το λογισμικό
είναι αρκετά διαφορετικό από άλλα προϊόντα και υπηρεσίες αναφορικά με
τις παρακάτω ιδιότητες: α) την πνευματική ιδιοκτησία, β) την
εμπορευσιμότητα, ιδιότητες τις οποίες οποίες μελετάμε στα επόμενα. <a
href="#fn25" id="fnref25" class="footnote-ref"
role="doc-noteref"><sup>25</sup></a> <a href="#fn26" id="fnref26"
class="footnote-ref" role="doc-noteref"><sup>26</sup></a></p>
<p>Υπάρχουν πολλά είδη δικαιωμάτων πνευματικής ιδιοκτησίας, όπως το
εμπορικό σήμα (trademark), η πατέντα (patent), η πνευματική ιδιοκτησία
(copyright). Τα περισσότερα έργα λογισμικού αντιμετωπίζονται όπως τα
λογοτεχνικά βιβλία και έχουν πνευματική ιδιοκτησία, αν και υπάρχουν
περιπτώσεις στο λογισμικό της διεπαφής ανθρώπου και υπολογιστή όπου έχει
γίνει προσπάθεια για πατέντα. Για παράδειγμα, στα τέλη της δεκαετίας του
1980 η Apple προσπάθησε να προστατεύσει το Γραφικό Περιβάλλον Εργασίας
(Graphical User Interface - GUI) απέναντι στον ανταγωνισμό της
Microsoft. Επειδή το λογισμικό δεν είναι ούτε βιβλίο αλλά ούτε και
βιομηχανικό αντικείμενο, τα υπάρχοντα είδη πνευματικής ιδιοκτησίας ίσως
να μην του ταιριάζουν. Άλλωστε, αυξάνονται οι περιπτώσεις όπου το
λογισμικό δίνεται με άδεια ανοικτού κώδικα (open source license) ή
παρέχει κάποια Διεπαφή Προγραμματισμού Εφαρμογών (API, από το
Application Programming Interface) και στη συνέχεια ο δημιουργός
αναζητεί αμοιβή μέσα από την πώληση της τεχνογνωσίας του. Όσο
χαρακτηριστική είναι η περίπτωση αυτοδημιούργητων τύπου <em>κλειστού
κώδικα</em> όπως ο Bill Gates της Microsoft, άλλο τόσο ενδιαφέρουσα
είναι η περίπτωση του Linus Torvalds, με τα ανοικτού κώδικα Linux, ο
οποίος επέλεξε να δώσει δωρεάν τον καρπό της προσπάθειάς του. Και στις
δύο περιπτώσεις είχαμε τη δημιουργία μιας πολύ μεγάλης βιομηχανίας και
πολλών θέσεων εργασίας, παρόλο που η προσέγγιση του καθενός ήταν
διαμετρικά αντίθετη.</p>
<p>Η εμπορευσιμότητα ενός αγαθού ή υπηρεσίας εξαρτάται από πολλούς
παράγοντες, αλλά ο σημαντικότερος είναι η δυνατότητα που υπάρχει για
εύκολη γεωγραφική διανομή. Το λογισμικό, που ξεκίνησε ως μέρος του
υλικού και στη συνέχεια έγινε δίσκος που αγοραζόταν από τα ράφια του
λιανεμπορίου, τον τελευταίο καιρό έχει μετατραπεί σε υπηρεσία διαθέσιμη
στο διαδίκτυο. Στην ίδια συζήτηση έχει ενδιαφέρον να αναφερθούμε και στη
δουλειά του προγραμματιστή λογισμικού, στις δυνατότητες καθώς και στους
κινδύνους από την εμπορευσιμότητα αυτής της εργασίας. Για παράδειγμα,
μια υπηρεσία στο Web είναι διαθέσιμη παντού, πράγμα που σημαίνει ότι
τελικά θα πρέπει να ανταγωνιστεί αντίστοιχες προσπάθειες από όπου και αν
προέρχονται, είτε από τις τεχνολογικά ανεπτυγμένες χώρες είτε από τις
χώρες με το εξειδικευμένο εργατικό δυναμικού χαμηλού κόστους. Πέρα από
τις ευκαιρίες για μια διευρυμένη αγορά, μέσα σε αυτό το
παγκοσμιοποιημένο πλαίσιο επαγγελματικής δραστηριότητας είναι μάλλον
αφελές να κρατάμε κλειστή τη διεπαφή με ένα λογισμικό, αφού μέσα σε
μικρό σχετικά χρονικό διάστημα κάποιος μπορεί να φτιάξει κάτι παρόμοιο ή
κάτι καλύτερο. Μια περισσότερο αποτελεσματική στρατηγική είναι να
κάνουμε διαθέσιμο τον πηγαίο κώδικα (ελπίζοντας σε συνεισφορές για τη
βελτίωσή του) και ταυτόχρονα να μαθαίνουμε από τις διαδράσεις που κάνουν
οι χρήστες. Έτσι, θα βελτιώνουμε την υπηρεσία, και κυρίως θα αυξάνουμε
τη γνώση που έχουμε για το τι συνιστά ανά πάσα στιγμή μια χρήσιμη και
επιθυμητή υπηρεσία, που είναι και το ζητούμενο για ένα σχετικά βιώσιμο
ανταγωνιστικό πλεονέκτημα.</p>
<p>Από την άλλη πλευρά, το λογισμικό λειτουργεί παρόμοια με τη μηχανή
εσωτερικής καύσης και τη βιομηχανική ρομποτική αναφορικά με την
αυτοματοποίηση της ανθρώπινης δραστηριότητας. Η αυτοματοποίηση συνήθως
θεωρείται αρετή, αφού επιτρέπει στον άνθρωπο να ασχοληθεί με κάτι άλλο
από τις μηχανικές, επίπονες και επαναλαμβανόμενες διεργασίες. Στην πράξη
επέτρεψε τη μετάβαση από την αγροτική στη βιομηχανική εποχή και έπειτα
στην εποχή των υπηρεσιών. Η άλλη όψη του νομίσματος, όμως, περιγράφει
μια επίπονη περίοδο μετάβασης από τη μια εποχή στην επόμενη. Όπως οι
μηχανές εσωτερικής καύσης διευκόλυναν την εργασία και αύξησαν την
παραγωγικότητα κατά τη μετάβαση από την αγροτική στη βιομηχανική εποχή,
όπως η ρομποτική και ο αυτοματισμός μείωσαν στη συνέχεια την ανάγκη για
ανθρώπινη εργασία στα εργοστάσια, με τον ίδιο τρόπο το λογισμικό
διάδρασης έρχεται να αυτοματοποιήσει πάρα πολλές εργασίες που γίνονταν
με τη μεσολάβηση ανθρώπων στη βιομηχανία των υπηρεσιών (π.χ., τράπεζες,
ασφάλειες, ταξίδια, κτλ.). Αν η ιστορία είναι σωστός οδηγός, τότε θα
πρέπει να αναζητήσουμε την επόμενη βιομηχανική επανάσταση ανάμεσα στις
δυνατότητες που μας προσφέρει ο προγραμματισμός της διάδρασης για νέες
υπηρεσίες και αγαθά, τα οποία με τη σειρά τους θα ορίσουν μια νέα
αγορά.</p>
<p>Στη βιομηχανική εποχή (19ος αιώνας), όταν οι μηχανές αντικατέστησαν
το μεγαλύτερο μέρος της ανθρώπινης χειρωνακτικής εργασίας, σε πρώτη φάση
δημιούργησαν στρατιές ανέργων, σε δεύτερη φάση όμως, τα προϊόντα
ορισμένων δημιουργικών ανθρώπων που βασίστηκαν στις μηχανές (π.χ.,
αεροπλάνο, αυτοκίνητο κ.ά.) δημιούργησαν νέους κλάδους εργασίας και
ανθρώπινης δραστηριότητας αθροιστικά πολύ μεγαλύτερους από αυτούς που
αρχικά κατέστρεψαν. Για παράδειγμα, τόσο η βιομηχανία του τουρισμού, όσο
και η αύξηση της οικονομικής δραστηριότητας με τη συγκέντρωση των
ανθρώπων στις πόλεις, ήταν παράπλευρες ωφέλειες του αεροπλάνου και του
αυτοκινήτου, αντίστοιχα.</p>
<p>Είναι αλήθεια ότι το πρώτο κύμα διάχυσης του ΗΥ, με πρωταγωνιστή τον
επιτραπέζιο ΗΥ, κατάφερε να αυτοματοποιήσει πολύ μεγάλο μέρος της
εργασίας γραφείου, με αποτέλεσμα την απώλεια θέσεων εργασίας στον πυρήνα
της οικονομίας των υπηρεσιών. Σε αναλογία με τη βιομηχανική εποχή, η
ενσωμάτωση και η διάχυση του ΗΥ στην καθημερινότητα με νέα προϊόντα και
υπηρεσίες ενδέχεται να δημιουργήσει αθροιστικά περισσότερες θέσεις
εργασίας από εκείνες που χάθηκαν, αρκεί να βρεθούν οι δημιουργικοί και
καταρτισμένοι προγραμματιστές της διάδρασης που θα φανταστούν και θα
υλοποιήσουν αυτούς τους νέους κλάδους ανθρώπινης δραστηριότητας.</p>
<p>Ο προγραμματισμός της διάδρασης δεν είναι πανάκεια και σίγουρα δεν
είναι λύση σε σημαντικά προβλήματα που έχουν να κάνουν με τη φτώχεια,
την υγεία, και την εκπαίδευση. Από την άλλη πλευρά, ο προγραμματισμός
της διάδρασης είναι σίγουρα μια λύση συμβατή με την πολύ σημαντική
ανάγκη που αφορά στη δυνατότητά μας να φανταστούμε και να δημιουργήσουμε
ένα διαφορετικό και νέο επίπεδο ανθρώπινης δραστηριότητας σε σημαντικούς
τομείς όπως η εργασία, η ψυχαγωγία, η ευζωία ή η εκπαίδευση. Τέλος,
είναι σίγουρα μία από τις λίγες λύσεις που έχουμε για να θέσουμε σε
λειτουργία τον εκδημοκρατισμό των ψηφιακών μέσων σχεδίασης και
παραγωγής, τα οποία έχουν τη δυνατότητα να περάσουν την οικονομία στο
επόμενο στάδιο μετά τη βιομηχανία των υπηρεσιών γραφείου, στην εποχή της
δημιουργίας φαντασιακών μηχανών πέρα από την προσομοίωση του φυσικού και
βιολογικού κόσμου.</p>
<section id="footnotes" class="footnotes footnotes-end-of-section"
role="doc-endnotes">
<hr />
<ol start="21">
<li><div id="fn21">
<p>fig:logo-robot<a href="#fnref21" class="footnote-back"
role="doc-backlink">↩︎</a></p>
</div></li>
<li><div id="fn22">
<p><span class="citation" data-cites="papert1980mindstorms">Papert
(1980)</span>, <span class="citation" data-cites="kay1993early">Kay
(1993)</span><a href="#fnref22" class="footnote-back"
role="doc-backlink">↩︎</a></p>
</div></li>
<li><div id="fn23">
<p>fig:children-alto<a href="#fnref23" class="footnote-back"
role="doc-backlink">↩︎</a></p>
</div></li>
<li><div id="fn24">
<p><span class="citation" data-cites="kay1993early">Kay (1993)</span><a
href="#fnref24" class="footnote-back" role="doc-backlink">↩︎</a></p>
</div></li>
<li><div id="fn25">
<p>fig:linux<a href="#fnref25" class="footnote-back"
role="doc-backlink">↩︎</a></p>
</div></li>
<li><div id="fn26">
<p>fig:napster<a href="#fnref26" class="footnote-back"
role="doc-backlink">↩︎</a></p>
</div></li>
</ol>
</section>
<h2 id="η-περίπτωση-του-minecraft">Η περίπτωση του Minecraft</h2>
<p>Πριν ο προγραμματισμός της διάδρασης αποκτήσει πρωταγωνιστικό ρόλο
στην έρευνα και στη βιομηχανία, η επιτυχία ενός προϊόντος μπορούσε να
μετρηθεί από τις πωλήσεις που έκανε ή από τις καλές κριτικές που
έπαιρνε. Η άνοδος του προγραμματισμού της διάδρασης προσθέτει νέες
μετρικές, όπως τη συμμετοχή των χρηστών στην επέκταση του αρχικού
προϊόντος. Στον χώρο της ψυχαγωγίας μέσω υπολογιστή, μία από τις πιο
επιτυχημένες περιπτώσεις είναι αυτή του Minecraft, στο οποίο οι
χρήστες-παίκτες είναι εκείνοι που κατασκευάζουν από κοινού το περιβάλλον
του παιχνιδιού.<a href="#fn27" id="fnref27" class="footnote-ref"
role="doc-noteref"><sup>27</sup></a></p>
<figure id="fig:minecraft-end-user">
<img src="../images/minecraft-end-user.png"
alt="Η ιδέα να δημιουργούνται πίστες από τους τελικούς χρήστες δεν είναι καινούρια και έχει δοκιμαστεί με επιτυχία σε αρκετά παιχνίδια ως πρόσθετη λειτουργία. Το Minecraft είναι από την αρχή σχεδιασμένο με σκοπό οι τελικοί χρήστες να σχεδιάζουν τον εικονικό κόσμο." />
<figcaption aria-hidden="true">Η ιδέα να δημιουργούνται πίστες από τους
τελικούς χρήστες δεν είναι καινούρια και έχει δοκιμαστεί με επιτυχία σε
αρκετά παιχνίδια ως πρόσθετη λειτουργία. Το Minecraft είναι από την αρχή
σχεδιασμένο με σκοπό οι τελικοί χρήστες να σχεδιάζουν τον εικονικό
κόσμο.</figcaption>
</figure>
<figure id="fig:learntomod">
<img src="../images/learntomod.jpg"
alt="Η ευελιξία και η επεκτασιμότητα του Minecraft δεν σταματούν στη δυνατότητα κατασκευής του σκηνικού της δράσης, αλλά επεκτείνονται στη δυνατότητα προγραμματισμού της συμπεριφοράς και στη δημιουργίας νεών αντικειμένων." />
<figcaption aria-hidden="true">Η ευελιξία και η επεκτασιμότητα του
Minecraft δεν σταματούν στη δυνατότητα κατασκευής του σκηνικού της
δράσης, αλλά επεκτείνονται στη δυνατότητα προγραμματισμού της
συμπεριφοράς και στη δημιουργίας νεών αντικειμένων.</figcaption>
</figure>
<p>Η έμφαση στην κατασκευή του εικονικού κόσμου του παιχνιδιού από τους
τελικούς χρήστες βασίζεται σε μια συμμετοχική φιλοσοφία που είναι
εντελώς διαφορετική από την παροχή μιας προκατασκευασμένης εμπειρίας,
όπως είναι το σύνηθες στα περισσότερα βιντεο-παιχνίδια. Οι δημιουργοί
του Minecraft ανάγνωσαν έγκαιρα την ανάγκη των χρηστών για μεγαλύτερη
δυνατότητα προσωπικής έκφρασης μέσα από τις ψηφιακές δραστηριότητές
τους. Εκτός από τη συμμετοχή των χρηστών στην κατασκευή του εικονικού
κόσμου του παιχνιδιού, οι κατασκευαστές του Minecraft έχουν προχωρήσει
ένα βήμα παρακάτω, στη διευκόλυνση της ανάπτυξης επεκτάσεων
(Modifications ή Mods)<a href="#fn28" id="fnref28" class="footnote-ref"
role="doc-noteref"><sup>28</sup></a> που αλλάζουν τη συμπεριφορά του
παιχνιδιού ή προσθέτουν λειτουργίες. Μία από τις πιο ενδιαφέρουσες
λειτουργίες προσθέτει τη δυνατότητα της εκμάθησης προγραμματισμού για
τον υπολογιστή. Με δεδομένη την εμβύθιση (immersion) των χρηστών στο
σύστημα διάδρασης του Minecraft, η ελπίδα είναι ότι η εκμάθηση του
προγραμματισμού υπολογιστών μπορεί να κινητοποιηθεί από το ίδιο το μέσο,
με σκοπό την κατασκευή νέων συμπεριφορών για τον κόσμο του
Minecraft.</p>
<p>Η ενεργή συμμετοχή των χρηστών στην κατασκευή παιχνιδιών δεν είναι
κάτι νέο, ούτε ήταν το Minecraft η πρώτη ανάλογη περίπτωση. Στις αρχές
της δεκαετίας του 1990 η δημοφιλής σειρά βιντεο-παιχνιδιών Doom έδινε τη
δυνατότητα στους χρήστες να κατασκευάσουν τις δικές τους πίστες, πράγμα
που διατηρούσε το ενδιαφέρον τους για περισσότερο καιρό. Στη δυνατότητα
mods του Minecraft, και ειδικά στην ευελιξία που δίνει για να
εξυπηρετήσει διαφορετικούς σκοπούς, βλέπουμε τη διαφορετική φιλοσοφία
απέναντι στην ιδιοκτησία που έχουν οι εταιρείες του διαδικτύου σε σχέση
με τις παλιότερες εταιρείες κατασκευής παιχνιδιών, οι οποίες ήθελαν να
έχουν όσο γίνεται μεγαλύτερο έλεγχο τόσο στους χαρακτήρες όσο και στο
εικονικό περιβάλλον του παιχνιδιού, ενώ πολλές φορές είχαν κάνει την
πρόσβαση στα βιντεο-παιχνίδια τους δύσκολη σε μια προσπάθεια να
αποτρέψουν την παράνομη αντιγραφή.</p>
<p>Η ίδια η ιστορία της ανάπτυξης του Minecraft έχει ιδιαίτερο
ενδιαφέρον και πέρα από τη φύση της διάδρασης, η οποία όπως είδαμε
παραπάνω βασίζεται στη συμμετοχή των χρηστών τόσο στο περιεχόμενο του
παιχνιδιού όσο και στην επέκταση της ίδιας της συμπεριφοράς του με
τροποποιήσεις (modifications ή mods). Η αρχική ανάπτυξη του παιχνιδιού
έγινε από έναν μόνο έμπειρο κατασκευαστή, ο οποίος άφησε τη θέση
υπαλλήλου που είχε σε εταιρεία ανάπτυξης βιντεο-παιχνιδιών για να
υλοποιήσει τις δικές του ιδέες. Η έμπνευση ήρθε από την ενασχόλησή του
με βιντεο-παιχνίδια από μικρούς ανεξάρτητους παραγωγούς, οπότε
δημιουργήθηκε η πρώτη έκδοση ενός παιχνιδιού όπου ο χρήστης μπορούσε να
τοποθετήσει αντικείμενα σε χώρο τριών διαστάσεων. Στη συνέχεια πρόσθεσε
τη δυνατότητα κατασκευής από πολλούς χρήστες καθώς και από ‘εχθρούς’
τους. Από εκεί και πέρα, η δημοσιότητα ήρθε από μόνη της, όταν οι
χρήστες του παιχνιδιού άρχισαν να δημιουργούν όμορφες κατασκευές.
Βλέπουμε, λοιπόν, ότι η προσωπική έκφραση μέσω του υπολογιστή στην
περίπτωση του Minecraft δεν είναι μόνο ένα προνόμιο του δημιουργού του
αλλά και όλων των τελικών χρηστών, που έτσι νιώθουν το παιχνίδι δικό
τους.</p>
<section id="footnotes" class="footnotes footnotes-end-of-section"
role="doc-endnotes">
<hr />
<ol start="27">
<li><div id="fn27">
<p>fig:minecraft-end-user<a href="#fnref27" class="footnote-back"
role="doc-backlink">↩︎</a></p>
</div></li>
<li><div id="fn28">
<p>fig:learntomod<a href="#fnref28" class="footnote-back"
role="doc-backlink">↩︎</a></p>
</div></li>
</ol>
</section>
<h2 id="η-περίπτωση-του-xerox-star">Η περίπτωση του Xerox Star</h2>
<figure id="fig:xerox-star-pc">
<img src="../images/xerox-star-pc.jpg"
alt="Ο επιτραπέζιος υπολογιστής με πληκτρολόγιο, ποντίκι, και γραφική επιφάνεια εργασίας (παράθυρα, εικονίδια, φάκελοι) που δημιουργήθηκε από τη Xerox στα τέλη της δεκαετίας του 1970 λίγο διαφέρει από τον μοντέρνο επιτραπέζιο υπολογιστή." />
<figcaption aria-hidden="true">Ο επιτραπέζιος υπολογιστής με
πληκτρολόγιο, ποντίκι, και γραφική επιφάνεια εργασίας (παράθυρα,
εικονίδια, φάκελοι) που δημιουργήθηκε από τη Xerox στα τέλη της
δεκαετίας του 1970 λίγο διαφέρει από τον μοντέρνο επιτραπέζιο
υπολογιστή.</figcaption>
</figure>
<figure id="fig:xerox-star-genealogy">
<img src="../images/xerox-star-genealogy.png"
alt="Το γενεαλογικό δέντρο του Xerox Star περιέχει σημαντικούς προγόνους (π.χ., Memex, NLS, Sketchpad, κ.ά.) καθώς και εξίσου σημαντικούς απογόνους (π.χ. Macintosh), με τα περισσότερα στοιχεία της διάδρασης (π.χ., γραφική επιφάνεια εργασίας, απευθείας χειρισμός, κτλ.) να παραμένουν τα ίδια για δεκαετίες." />
<figcaption aria-hidden="true">Το γενεαλογικό δέντρο του Xerox Star
περιέχει σημαντικούς προγόνους (π.χ., Memex, NLS, Sketchpad, κ.ά.) καθώς
και εξίσου σημαντικούς απογόνους (π.χ. Macintosh), με τα περισσότερα
στοιχεία της διάδρασης (π.χ., γραφική επιφάνεια εργασίας, απευθείας
χειρισμός, κτλ.) να παραμένουν τα ίδια για δεκαετίες.</figcaption>
</figure>
<p>Η γραφική επιφάνεια εργασίας όπως είναι διαθέσιμη σε πολλούς
εμπορικούς επιτραπέζιους υπολογιστές λίγο διαφέρει από εκείνη που είχε ο
υπολογιστής Xerox Star<a href="#fn29" id="fnref29" class="footnote-ref"
role="doc-noteref"><sup>29</sup></a> που δημιουργήθηκε στο ερευνητικό
κέντρο PARC.<a href="#fn30" id="fnref30" class="footnote-ref"
role="doc-noteref"><sup>30</sup></a> Η γραφική επιφάνεια εργασίας σε
συνδυασμό με το ποντίκι και το πληκτρολόγιο αποτελεί έναν ιδιαίτερα
αποδοτικό τρόπο εργασίας με επεξεργαστές κειμένου και προγράμματα
επεξεργασίας εικόνας και γραφικών. Η βασική διαφορά που έχει σε σχέση με
το εμπορικά επιτυχημένο Apple Macintosh είναι ότι δεν έχει εφαρμογές,
γιατί η βασική μεταφορά διάδρασης είναι ένα έγγραφο, όπου ανάλογα με το
αντικείμενο που επεξεργάζεται ο χρήστης έχει στην διάθεση του τα
αντίστοιχα εργαλεία. Δεν είναι τυχαίο ότι η δημιουργία της γραφικής
επιφάνειας εργασίας έγινε από το ερευνητικό κέντρο PARC της εταιρείας
XEROX κατά τη διάρκεια μελέτης και αυτοματοποίησης της εργασίας σε
εκδοτικούς οργανισμούς. Πράγματι, ο στόχος αυτού του προϊόντος είναι η
προσομοίωση του φυσικού χαρτιού στην οθόνη του υπολογιστή, έτσι ώστε να
διευκολύνει τις εκδοτικές δραστηριότητες. Αξίζει να δούμε λίγο πιο
προσεκτικά τα χαρακτηριστικά του Star γιατί θα καταλάβουμε καλύτερα τους
λόγους που η γραφική επιφάνεια εργασίας πήρε αυτήν τη μορφή και όχι
κάποια άλλη η οποία θα ήταν αποδεκτή, αν το πλαίσιο ανάπτυξης και οι
ανάγκες των χρηστών ήταν διαφορετικές.</p>
<p>Τα βασικά συστατικά της γραφικής επιφάνειας εργασίας υπήρχαν από
προηγούμενες ερευνητικές και εμπορικές προσπάθειες (π.χ., ποντίκι,
ηλεκτρονική επεξεργασία κειμένου σε οθόνη), αλλά ήταν το Xerox Star ο
πρώτος υπολογιστής που ολοκλήρωνε τις κατακερματισμένες προσπάθειες σε
μια χρήσιμη και εύχρηστη συσκευή. Η κινητήριος δύναμη αυτής της
δημιουργικής και ολοκληρωμένης σύνθεσης ήταν η ανθρωποκεντρική σχεδίαση
και ανάπτυξη του συστήματος Star με έμφαση στις ανάγκες ενός πελάτη,
ενός εκδοτικού οίκου που έκανε επεξεργασία κειμένου και σελιδοποίηση
εγγράφων και βιβλίων. Για τον σκοπό αυτό, οι ερευνητές έκαναν παρατήρηση
(observation) του τρόπου εργασίας σε ένα γραφείο της εποχής που
διαχειριζόταν έγγραφα. Με αυτόν τον τρόπο διαπίστωσαν ότι υπήρχε ανάγκη
για εύκολη επεξεργασία και αποθήκευση ενός εγγράφου που περιείχε
πολυμεσικά στοιχεία, καθώς και για τον διαμοιρασμό του. Οι παραπάνω
προδιαγραφές που προέκυψαν από τις ανάγκες των χρηστών σε συνδυασμό με
το πλαίσιο χρήσης (γραφείο εκδοτικού οργανισμού) οδήγησαν στη δημιουργία
της γραφικής επιφάνειας εργασίας.</p>
<p>Η γραφική επιφάνεια εργασίας είναι μια συμπαγής και συνεπής σύνθεση
από επιμέρους στοιχεία διάδρασης. Συνήθως αναφέρεται και ως μοντέλο
‘Windows Icons Menus Pointer’ (WIMP), καθώς τα βασικά της στοιχεία είναι
τα παράθυρα, τα εικονίδια, τα μενού και ο δείκτης. Τα παράθυρα
αντιπροσωπεύουν έγγραφα της ίδιας ή άλλων εφαρμογών, τα εικονίδια
αντιπροσωπεύουν εφαρμογές, φακέλους και αρχεία, ενώ τα μενού επιτρέπουν
ενέργειες πάνω σε αντικείμενα ή αλλαγή της κατάστασης μιας εφαρμογής. Ο
δείκτης επιτρέπει την πλοήγηση (navigation) ανάμεσα σε παράθυρα,
εικονίδια και μενού, καθώς και την επιλογή αντικειμένων. Ο δείκτης
συνήθως ελέγχεται από ένα ποντίκι, αλλά αυτό δεν είναι η μόνη πιθανή
συσκευή εισόδου, αφού ένας δείκτης μπορεί επίσης να ελέγχεται από
διαφορετικές συσκευές εισόδου όπως είναι η πένα ή ακόμη και απευθείας με
την αφή. Σε κάθε περίπτωση, αυτό που είναι σημαντικό στη γραφική
επιφάνεια εργασίας είναι να έχουμε απευθείας χειρισμό των στοιχείων της
από τον δείκτη. Τα παραπάνω χαρακτηριστικά τα συναντάμε με διαφορετική
αισθητική και μικρές παραλλαγές σε εναλλακτικά λειτουργικά συστήματα με
γραφική επιφάνεια εργασίας.</p>
<p>Συνοπτικά, αυτό που ονομάζουμε γραφική επιφάνεια εργασίας είναι το
αποτέλεσμα της δημιουργικής ολοκλήρωσης ενός συνόλου από προηγούμενες
τεχνολογίες, για την εξυπηρέτηση των αναγκών μιας δεδομένης ομάδας
χρηστών. Έχοντας αναλύσει παραπάνω τη γραφική επιφάνεια εργασίας από την
πλευρά των χρηστών, οι οποίοι ήταν εργαζόμενοι γραφείου (κυρίως
εκδοτικών οίκων ή συναφών οργανισμών), θα αναλύσουμε επίσης την πλευρά
της τεχνολογίας, η οποία είχε βασιστεί σε προηγούμενα έργα. Ανάμεσα στις
πολλές επιρροές του Xerox Star, η σημαντικότερη ήταν η υιοθέτηση της
συσκευής εισόδου ποντίκι, και κυρίως ο τρόπος με τον οποίο ο δείκτης του
ποντικιού επέτρεπε τη διάδραση με μια αφαιρετική αναπαράσταση της
πληροφορίας σε μια οθόνη. Η σημασία αυτής της τεχνολογικής καινοτομίας
μπορεί να γίνει κατανοητή αν αναλογιστούμε ότι μέχρι τότε η χρήση του
υπολογιστή βασιζόταν στη στενή σύνδεση της εισόδου με την έξοδο για τον
χρήστη, αφού για παράδειγμα είχαμε κείμενο σε οθόνη κειμένου, τα οποία
διαχειριζόμασταν μόνο με το πληκτρολόγιο, χωρίς να υπάρχουν ενδιάμεσα
επίπεδα αφαιρετικότητας του είδους της πληροφορίας. Τελικά, η συνεισφορά
του υπολογιστή Star ήταν πολύ μεγαλύτερη από την αλλαγή του τρόπου που
κάνουμε αυτό που λέμε “δουλειά γραφείου”, αφού η ιστορία ανάπτυξής του<a
href="#fn31" id="fnref31" class="footnote-ref"
role="doc-noteref"><sup>31</sup></a> δείχνει τη μέθοδο, τα εργαλεία και
τους κανόνες, για να σχεδιάσουμε και να κατασκευάσουμε νέους τρόπους
διάδρασης με τον υπολογιστή για άλλες ομάδες χρηστών και διαφορετικό
πλαίσιο δραστηριότητας.</p>
<section id="footnotes" class="footnotes footnotes-end-of-section"
role="doc-endnotes">
<hr />
<ol start="29">
<li><div id="fn29">
<p>fig:xerox-star-pc<a href="#fnref29" class="footnote-back"
role="doc-backlink">↩︎</a></p>
</div></li>
<li><div id="fn30">
<p><span class="citation" data-cites="johnson1989xerox">Johnson κ.ά.
(1989)</span><a href="#fnref30" class="footnote-back"
role="doc-backlink">↩︎</a></p>
</div></li>
<li><div id="fn31">
<p>fig:xerox-star-genealogy<a href="#fnref31" class="footnote-back"
role="doc-backlink">↩︎</a></p>
</div></li>
</ol>
</section>
<h2 id="σύντομη-βιογραφία-του-ivan-sutherland">Σύντομη βιογραφία του
Ivan Sutherland</h2>
<p>Ο Ivan Sutherland μεγάλωσε παίζοντας μια γερμανική εκδοχή των Lego,
όπου ένα μικρό σετ από γεωμετρικά σχήματα μπορεί να δώσει μορφή σε
πολύπλοκες κατασκευές όπως είναι μια γέφυρα. Το 1963 κατασκεύασε το
διαδραστικό σύστημα σχεδίασης γραφικών Sketchpad,<a href="#fn32"
id="fnref32" class="footnote-ref" role="doc-noteref"><sup>32</sup></a>
το οποίο μπορούσε να χρησιμοποιηθεί για την μοντελοποίηση πολύπλοκων
συστημάτων όπως μια γέφυρα.<a href="#fn33" id="fnref33"
class="footnote-ref" role="doc-noteref"><sup>33</sup></a> Αν και έγινε
γνωστός για αυτό το σύστημα, η συνεισφορά του είναι πολύ ευρύτερη καθώς
δημιούργησε μια μεγάλη κοινότητα με ανθρώπους και εταιρείες.</p>
<figure id="fig:sutherland-profile">
<img src="../images/sutherland-profile.jpg"
alt="Στο σύστημα Sketchpad εκτός από την υποστήριξη δημιουργίας προσχεδίων, υπήρχε η δυνατότητα επίλυσης εξισώσεων, όπως αυτές ορίζονται από τα γραφικά που αναπαριστούν μια γέφυρα. O Ivan Sutherland ξεκίνησε από την περιοχή των διαδραστικών γραφικών και συνέχισε ως μέντορας ερευνητών και στέλεχος πολλών οργανισμών που άφησαν το αποτύπωμα τους στην ευρύτερη περιοχή των υπολογιστών." />
<figcaption aria-hidden="true">Στο σύστημα Sketchpad εκτός από την
υποστήριξη δημιουργίας προσχεδίων, υπήρχε η δυνατότητα επίλυσης
εξισώσεων, όπως αυτές ορίζονται από τα γραφικά που αναπαριστούν μια
γέφυρα. O Ivan Sutherland ξεκίνησε από την περιοχή των διαδραστικών
γραφικών και συνέχισε ως μέντορας ερευνητών και στέλεχος πολλών
οργανισμών που άφησαν το αποτύπωμα τους στην ευρύτερη περιοχή των
υπολογιστών.</figcaption>
</figure>
<figure id="fig:sketchpad-drafting">
<img src="../images/sketchpad-drafting.jpg"
alt="Η βασική λειτουργία του Sketchpad είναι η υποστήριξη της διαδικασίας δημιουργίας προσχεδίων για τον κλάδο της μηχανολογίας. Το Sketchpad εκτός απο την διάδραση με την πένα παρέχει μια σειρά εντολών που ορίζουν περιορισμούς πάνω στα αρχικά σχεδιαγράμματα, έτσι ώστε να είναι εύκολος ο μετασχηματισμός τους με βάση κάποιους κανόνες, όπως οι παράλληλες γραμμές και η ορθές γωνίες." />
<figcaption aria-hidden="true">Η βασική λειτουργία του Sketchpad είναι η
υποστήριξη της διαδικασίας δημιουργίας προσχεδίων για τον κλάδο της
μηχανολογίας. Το Sketchpad εκτός απο την διάδραση με την πένα παρέχει
μια σειρά εντολών που ορίζουν περιορισμούς πάνω στα αρχικά
σχεδιαγράμματα, έτσι ώστε να είναι εύκολος ο μετασχηματισμός τους με
βάση κάποιους κανόνες, όπως οι παράλληλες γραμμές και η ορθές
γωνίες.</figcaption>
</figure>
<p>Αμέσως μετά την δημιουργία του Sketchpad στο MIT, συνέχισε με την
δημιουργία του Sword of Damocles στο Harvard, όπου τα γραφικά ακολουθούν
την κίνηση του κεφαλιού του χρήστη. Το σύστημα αυτό αρχικά δημιουργήθηκε
για την διευκόλυνση της προσγείωσης ενός ελικοπτέρου με κάμερες στην
βάση του και προβολή του βίντεο σε δύο οθόνες που βρίσκονται πάνω σε ένα
κράνος. Για να το πετύχει αυτό έβαλε στην θέση του βίντεο από τις
κάμερες, έναν υπολογιστή που παράγει δυναμικά γραφικά. Το σύστημα αυτό
είναι θεμελιώδες για τα συστήματα εικονικής πραγματικότητας των επόμενων
δεκαετιών.</p>
<p>Εκτός από την συνεισφορά του στην επιστήμη των διαδραστικών γραφικών,
στην συνέχεια της καριέρας του δημιούργησε μια από τις σημαντικότερες
εταιρείες, η οποία κατασκεύασε προσομοιωτές πτήσης για τα αεροσκάφη της
Boing, έτσι ώστε να γίνει καλύτερη η εκπαίδευση των πιλότων, αλλά και η
σχεδίαση της πολύπλοκης διεπαφής πτήσης. Η βελτίωση της εκπαίδευσης και
της διεπαφής στα αεροπλάνα θεωρείται ότι βελτίωσε με την σειρά της την
ασφάλεια των πτήσεων. Στον χώρο της ψηφιακής ψυχαγωγίας ο μαθητής του
Edwin Catmull εμπνεύστηκε από τις δυνατότητες των γραφικών στον
υπολογιστή και προσπάθησε να εκπληρώσει το παιδικό του όνειρο να γίνει
σχεδιαστής κινούμενων γραφικών με την κατασκευή νέων τεχνολογιών και
εργαζόμενος σε εταιρείες μέχρι την δημιουργία της Pixar.</p>
<p>Παράλληλα με την εταιρεία συμβούλευε διδακτορικούς φοιτητές στο
πανεπιστήμιο της Utah, ανάμεσα τους τον Alan Kay, καθώς και τους
δημιουργούς άλλων σημαντικών εταιρειών, όπως η Pixar και η Adobe.
Επίσης, ήταν υπεύθυνος για την συνέχιση της χρηματοδότησης του
προγράμματος DARPA αμέσως μετά την αποχώρηση του Licklider, και με αυτόν
τον τρόπο συνέχισε να στηρίζει την βασική έρευνα στις περιοχές των
γραφικών και της διάδρασης που γινόταν στα MIT, Stanford, Xerox PARC,
RAND. Συνολικά, ο Ivan Sutherland φαίνεται να έχει επηρεάσει ένα πολύ
μεγάλο μέρος των σύγχρονων τεχνολογιών, είτε με τις δικές του
καινοτομίες, είτε με αυτές των ανθρώπων που επηρέασε με την δουλειά
του.</p>
<section id="footnotes" class="footnotes footnotes-end-of-section"
role="doc-endnotes">
<hr />
<ol start="32">
<li><div id="fn32">
<p>fig:sutherland-profile<a href="#fnref32" class="footnote-back"
role="doc-backlink">↩︎</a></p>
</div></li>
<li><div id="fn33">
<p>fig:sketchpad-drafting<a href="#fnref33" class="footnote-back"
role="doc-backlink">↩︎</a></p>
</div></li>
</ol>
</section>
<h2 class="unnumbered" id="βιβλιογραφία">Βιβλιογραφία</h2>
<div id="refs" class="references csl-bib-body hanging-indent"
role="list">
<div id="ref-card1983psychology" class="csl-entry" role="listitem">
Card, Stuart K, Allen Newell, και Thomas P Moran. 1983. <em>The
Psychology of Human-Computer Interaction</em>. L. Erlbaum Associates
Inc.
</div>
<div id="ref-carlston1985software" class="csl-entry" role="listitem">
Carlston, DG. 1985. <span>‘Software People: inside the computer
business’</span>. New York: Prentice Hall.
</div>
<div id="ref-engelbart1962augmenting" class="csl-entry" role="listitem">
Engelbart, Douglas C. 1962. <em>Augmenting human intellect: A conceptual
framework</em>. SRI, Menlo Park, CA.
</div>
<div id="ref-freiberger1984fire" class="csl-entry" role="listitem">
Freiberger, Paul, και Michael Swaine. 1984. <em>Fire in the Valley: the
making of the personal computer</em>. McGraw-Hill, Inc.
</div>
<div id="ref-hertzfeld2004revolution" class="csl-entry" role="listitem">
Hertzfeld, Andy. 2004. <em>Revolution in The Valley: The Insanely Great
Story of How the Mac Was Made</em>. " O’Reilly Media, Inc.".
</div>
<div id="ref-hiltzik1999dealers" class="csl-entry" role="listitem">
Hiltzik, Michael. 1999. <span>‘Dealers of Lightning: Xerox PARC and the
Dawning of the Computer Age’</span>.
</div>
<div id="ref-johnson1989xerox" class="csl-entry" role="listitem">
Johnson, Jeff, Teresa L. Roberts, William Verplank, David Canfield
Smith, Charles H. Irby, Marian Beard, και Kevin Mackey. 1989. <span>‘The
xerox star: A retrospective’</span>. <em>Computer</em> 22 (9): 11–26.
</div>
<div id="ref-kay1993early" class="csl-entry" role="listitem">
Kay, Alan C. 1993. <span>‘The early history of Smalltalk’</span>.
<em>ACM SIGPLAN Notices</em> 28 (3): 69–95.
</div>
<div id="ref-lanier2014owns" class="csl-entry" role="listitem">
Lanier, Jaron. 2014. <em>Who owns the future?</em> Simon; Schuster.
</div>
<div id="ref-licklider1960man" class="csl-entry" role="listitem">
Licklider, Joseph Carl Robnett. 1960. <span>‘Man-computer
symbiosis’</span>. <em>IRE transactions on human factors in
electronics</em>, τχ. 1: 4–11.
</div>
<div id="ref-papert1980mindstorms" class="csl-entry" role="listitem">
Papert, Seymour. 1980. <em>Mindstorms: children, computers, and powerful
ideas</em>. Basic Books, Inc.
</div>
<div id="ref-raskin2000humane" class="csl-entry" role="listitem">
Raskin, Jef. 2000. <em>The humane interface: new directions for
designing interactive systems</em>. Addison-Wesley Professional.
</div>
<div id="ref-rheingold2000tools" class="csl-entry" role="listitem">
Rheingold, Howard. 2000. <em>Tools for thought: The history and future
of mind-expanding technology</em>. MIT Press.
</div>
<div id="ref-smith1999fumbling" class="csl-entry" role="listitem">
Smith, Douglas K, και Robert C Alexander. 1999. <em>Fumbling the future:
How Xerox invented, then ignored, the first personal computer</em>.
iUniverse.
</div>
<div id="ref-waldrop2001dream" class="csl-entry" role="listitem">
Waldrop, M Mitchell. 2001. <em>The dream machine: JCR Licklider and the
revolution that made computing personal</em>. Viking Penguin.
</div>
<div id="ref-weizenbaum1976computer" class="csl-entry" role="listitem">
Weizenbaum, Joseph. 1976. <em>Computer power and human reason: From
judgment to calculation.</em> WH Freeman &amp; Co.
</div>
</div>
<h1 id="μέθοδος">Μέθοδος</h1>
<blockquote>
<p>Κάνοντας σωστά τη σωστή σχεδίαση. Bill Buxton</p>
</blockquote>
<h3 id="περίληψη">Περίληψη</h3>
<p>Η ανθρωποκεντρική σχεδίαση έχει στόχο τη σχεδίαση και τη βελτίωση των
συστημάτων διάδρασης ανθρώπου και υπολογιστή. Οι περισσότερες τεχνικές,
κυρίως στην πρακτική εφαρμογή τους, δίνουν έμφαση στη βελτίωση
συστημάτων που υπάρχουν ή συστημάτων που βρίσκονται στο στάδιο της
σχεδίασης. Η βελτιστοποίηση ενός συστήματος είναι ένα σημαντικό θέμα,
αλλά ακόμη σημαντικότερο είναι το να αποκτήσουμε την αυτοπεποίθηση της
καταλληλότητας των προδιαγραφών του. Για αυτόν τον σκοπό, τόσο αυτό το
κεφάλαιο όσο και τα υπόλοιπα κεφάλαια του βιβλίου εστιάζουν περισσότερο
στην επανάληψη των βημάτων, παρά σε αυτά καθαυτά τα βήματα που συνιστούν
τον κύκλο της ανθρωποκεντρικής σχεδίασης. Στην προηγούμενη ενότητα
είδαμε <em>τι</em> είναι η διάδραση με συσκευές χρήστη και ποιες βασικές
μορφές πήρε τις πρώτες δεκαετίες. Εδώ θα μελετήσουμε το <em>πώς</em> θα
σχεδιάσουμε τη διάδραση.</p>
<h2 id="βελτιώνοντας-τις-ανθρώπινες-δυνατότητες">Βελτιώνοντας τις
ανθρώπινες δυνατότητες</h2>
<p>Αν και μας ενδιαφέρει η κατασκευή συστημάτων διάδρασης, εδώ θα
εστιάσουμε περισσότερο στη σχεδίαση της διάδρασης μεταξύ ανθρώπου και
συσκευής, γιατί η διάδραση εξαρτάται εξίσου από την αντίληψη που έχει ο
άνθρωπος για τη συσκευή, όσο και από την λειτουργία της αντίστοιχης
συσκευής. Υπάρχει η αντίληψη ότι η λεπτομερής σχεδίαση της διάδρασης
πριν την υλοποίηση των αντίστοιχων λειτουργιών του συστήματος μπορεί να
προσφέρει αποτελεσματικότερη διάδραση και επιπλέον μειωμένο κόστος και
χρόνο ανάπτυξης. Πράγματι, η επαναληπτική σχεδίαση, η κατασκευή, και η
αξιολόγηση πρωτοτύπων επιτρέπει την οικονομική και γρήγορη απόρριψη
ιδεών που δεν είναι αποτελεσματικές. Μια συμπληρωματική θεώρηση
τοποθετεί την κατασκευή ενός ελάχιστου εφικτού προϊόντος στο κέντρο της
σχεδίασης, το οποίο χρησιμοποιείται από την ομάδα ανάπτυξης, για να
φτιαχτούν νέα συστήματα με την τεχνική της αναδρομής. Σε αυτήν την
περίπτωση, το πρωτότυπο χρησιμοποιείται ενεργά και σταδιακά
μετασχηματίζεται μαζί με την ομάδα ανάπτυξης. Η ανάπτυξη αυτής της
δεξιότητας, της σχεδίασης της διάδρασης, αν και φαίνεται κοινή λογική
δεν είναι καθόλου εύκολη στην πράξη. Μαθαίνεται μόνο με την εμπειρία,
όπως για παράδειγμα μαθαίνει κάποιος να γράφει ή να ζωγραφίζει καλύτερα.
Η κατανόηση των αναγκών του χρήστη και η τεκμηρίωση ενός αξιακού
συστήματος για την κατασκευή και την αξιολόγηση της διάδρασης είναι οι
βασικοί πυλώνες που θα μελετήσουμε στις επόμενες ενότητες.</p>
<figure id="fig:apple-lisa">
<img src="../images/apple-lisa.jpg"
alt="Το σύστημα Apple Lisa κατασκευάστηκε με στόχο την αγορά γραφείου και ήταν το πρώτο σύστημα της εταιρίας με γραφικό περιβάλλον εργασίας. Αν και απέτυχε εμπορικά, οι τεχνολογίες διάδρασης ενσωματώθηκαν στον Apple Macintosh." />
<figcaption aria-hidden="true">Το σύστημα Apple Lisa κατασκευάστηκε με
στόχο την αγορά γραφείου και ήταν το πρώτο σύστημα της εταιρίας με
γραφικό περιβάλλον εργασίας. Αν και απέτυχε εμπορικά, οι τεχνολογίες
διάδρασης ενσωματώθηκαν στον Apple Macintosh.</figcaption>
</figure>
<figure id="fig:apple-macintosh">
<img src="../images/apple-macintosh-1984.jpg"
alt="Η πρώτη εμπορική επιτυχία για την γραφική επιφάνεια εργασίας ήρθε με τον υπολογιστή Apple Macintosh, ο οποίος θεωρείται εγγονός του Xerox Star, γιος του Apple Lisa, και ο βασικός πρόγονος για όλες τις σύγχρονες γραφικές επιφάνειες εργασίας, όπως τα Microsoft Windows 95. O Macintosh κατάφερε να συνθέσει και να βελτιώσει πολλές πτυχές της διεπαφής με τον χρήστη και να τα προσφέρει σε μια μορφή και λειτουργία που θα είναι σημείο αναφοράς για τις επόμενες δεκαετίες." />
<figcaption aria-hidden="true">Η πρώτη εμπορική επιτυχία για την γραφική
επιφάνεια εργασίας ήρθε με τον υπολογιστή Apple Macintosh, ο οποίος
θεωρείται εγγονός του Xerox Star, γιος του Apple Lisa, και ο βασικός
πρόγονος για όλες τις σύγχρονες γραφικές επιφάνειες εργασίας, όπως τα
Microsoft Windows 95. O Macintosh κατάφερε να συνθέσει και να βελτιώσει
πολλές πτυχές της διεπαφής με τον χρήστη και να τα προσφέρει σε μια
μορφή και λειτουργία που θα είναι σημείο αναφοράς για τις επόμενες
δεκαετίες.</figcaption>
</figure>
<p>Για αρκετές δεκαετίες, η βασική αξία στην κατασκευή της διάδρασης
είναι η ευχρηστία ενός συστήματος, η οποία συνήθως ορίζεται ως η ευκολία
χρήσης του συστήματος από κάποιον χρήση με την ελάχιστη δυνατή
εκπαίδευση. Αν και αυτός ο στόχος έχει οδηγήσει στην δημιουργία πολύ
εύχρηστων συστημάτων διάδρασης, τα οποία είναι προσβάσιμα ακόμη και από
νήπια, έχει και κάποια σημαντικά μειονεκτήματα. Το σημαντικότερο
πρόβλημα είναι πως θεωρεί τον ανθρώπινο παράγοντα ως μια στατική
οντότητα που δεν αλλάζει και δεν βελτιώνεται, κάτι που μετατρέπεται σε
αυτοεκπληρούμενη προφητεία κατά την διάθεση των αντίστοιχων εύχρηστων
συστημάτων.Πράγματι, οι χρήστες αυτών των συστημάτων δεν χρειάζεται να
γνωρίζουν πολλά και τελικά γνωρίζουν όλο και λιγότερα, ενώ ταυτόχρονα
ακονίζουν όλο και λιγότερο τις δεξιότητες τους. Επιπλέον, η προσήλωση
στην ευχρηστία έχει οδηγήσει στην κατασκευή νέων συστημάτων διάδρασης
που μοιάζουν μόνο με τα προηγούμενα τους, γεγονός που έχει καθυστερήσει
την αναζήτηση εναλλακτικών προς άλλες κατευθύνσεις. <a href="#fn1"
id="fnref1" class="footnote-ref" role="doc-noteref"><sup>1</sup></a> <a
href="#fn2" id="fnref2" class="footnote-ref"
role="doc-noteref"><sup>2</sup></a></p>
<p>Ίσως έχετε συναντήσει ξανά τον όρο της ανθρωποκεντρικής σχεδίασης της
διάδρασης ανθρώπου και υπολογιστή με έμφαση στη μοντελοποίηση του χρήστη
και με σκοπό την αυτοματοποίηση των διεργασιών του. Σε αυτό το βιβλίο η
έμφαση δε δίνεται στη μοντελοποίηση των δεξιοτήτων και της συμπεριφοράς
του χρήστη, ούτε στην αυτοματοποίηση των δραστηριοτήτων του (έμμεση
διάδραση). Η έμφαση της ανθρωποκεντρικής σχεδίασης στην παρούσα ενότητα
δίνεται στη σχεδίαση και υλοποίηση της διάδρασης με συσκευές χρήστη για
τις περιπτώσεις όπου απαιτείται η ενεργή συμβολή του χρήστη (άμεση
διάδραση).</p>
<p>Για να μπορέσουμε να κατανοήσουμε τη διάδραση ανθρώπου και υπολογιστή
θα πρέπει να καταλάβουμε πρώτα τις ιδιότητες του ανθρώπου καθώς και
εκείνες του υπολογιστή. Η κατασκευή ενός διαδραστικού συστήματος
υπολογισμού βασίζεται σε προδιαγραφές που εκφράζουν τις ανάγκες που αυτό
θα εξυπηρετεί.<a href="#fn3" id="fnref3" class="footnote-ref"
role="doc-noteref"><sup>3</sup></a> Με τη σειρά τους αυτές οι ανάγκες
καταγράφονται αναφορικά με τις δεξιότητες του ανθρώπου, του υπολογιστή,
καθώς και με τις ιδιότητες της μεταξύ τους διάδρασης.<a href="#fn4"
id="fnref4" class="footnote-ref" role="doc-noteref"><sup>4</sup></a></p>
<p>Η σχεδίαση της διάδρασης δεν είναι μόνο η σχεδίαση της εμφάνισης και
των λειτουργιών μιας συσκευής ή ενός συστήματος συσκευών και υπηρεσιών
αλλά κάτι συνολικότερο, το οποίο λαμβάνει υπόψη του τον τρόπο που οι
άνθρωποι σκέφτονται και επιτελούν τις εργασίες τους. Επίσης, οι συσκευές
που χρησιμοποιούν οι άνθρωποι είναι κάτι περισσότερο από τα συστήματα
εισόδου και εξόδου, οπότε η σχεδίαση πρέπει να εξετάσει ένα ολόκληρο
οικοσύστημα το οποίο αποτελείται από τεκμηρίωση, υποστήριξη, εκπαίδευση,
και διαδικασίες. <a href="#fn5" id="fnref5" class="footnote-ref"
role="doc-noteref"><sup>5</sup></a> <a href="#fn6" id="fnref6"
class="footnote-ref" role="doc-noteref"><sup>6</sup></a></p>
<p>Επομένως, υπάρχουν περιπτώσεις όπου η μελέτη της συνολικής υπάρχουσας
κατάστασης μπορεί να δείξει ότι δεν απαιτείται κάποιο νέο τεχνολογικό
σύστημα, αλλά απλώς μια αναδιάταξη ή βελτίωση των επιμέρους τμημάτων
αυτού του οικοσυστήματος. Για αυτόν τον λόγο, κρίνεται σκόπιμο να
θεωρήσουμε ότι δε σχεδιάζουμε απλά τη διάδραση με μια συσκευή ή με ένα
σύστημα, αλλά κάτι ευρύτερο· μια παρέμβαση στον τρόπο που ένας ή
περισσότεροι άνθρωποι εκτελούν διαδικασίες, είτε αυτές είναι εργασιακές,
είτε ψυχαγωγικές. Σε αυτό το πλαίσιο, η ερώτηση που θα μας απασχολήσει
στο παρόν κεφάλαιο είναι: τι είναι η σχεδίαση της διάδρασης ως
διαδικασία;</p>
<figure id="fig:nls-radar-keypad">
<img src="../images/nls-radar-keypad.jpg"
alt="Το σύστημα NLS που παρουσιάστηκε τελικά είχε ποντίκι με τρία κουμπιά, ακόρντα πέντε πλήκτρων και ορθογώνια οθόνη. Μερικά χρόνια νωρίτερα η ερευνητική ομάδα ξεκίνησε με το διαθέσιμο υλικό εκείνης της εποχής, όπως ήταν η στρογγυλή οθόνη του ραντάρ και ένα χειροποίητο ποντίκι με ένα πλήκτρο, έτσι ώστε να κατασκευάσει μια πρώτη έκδοση για το λογισμικό διάδρασης και να διαπιστώσει στην πράξη ποιες αλλαγές απαιτούνται για την επόμενη έκδοση των συσκευών διάδρασης σε μια επαναλληπτική διαδικασία σχεδίασης." />
<figcaption aria-hidden="true">Το σύστημα NLS που παρουσιάστηκε τελικά
είχε ποντίκι με τρία κουμπιά, ακόρντα πέντε πλήκτρων και ορθογώνια
οθόνη. Μερικά χρόνια νωρίτερα η ερευνητική ομάδα ξεκίνησε με το
διαθέσιμο υλικό εκείνης της εποχής, όπως ήταν η στρογγυλή οθόνη του
ραντάρ και ένα χειροποίητο ποντίκι με ένα πλήκτρο, έτσι ώστε να
κατασκευάσει μια πρώτη έκδοση για το λογισμικό διάδρασης και να
διαπιστώσει στην πράξη ποιες αλλαγές απαιτούνται για την επόμενη έκδοση
των συσκευών διάδρασης σε μια επαναλληπτική διαδικασία
σχεδίασης.</figcaption>
</figure>
<figure id="fig:nls-input">
<img src="../images/nls-input.jpg"
alt="Η εφεύρεση και η τελική επιλογή της συσκευής εισόδου ποντίκι για το σύστημα NLS δεν ήταν τυχαία, αλλά βασιζόταν σε μια συγκριτική αξιολόγηση εναλλακτικών συσκευών εισόδου. Για τον σκοπό αυτό, δοκίμασαν τις επιδόσεις των χρηστών με πολλές διαφορετικές συσκευές εισόδου, όπως ηταν η πένα, ο τροχός κύλισης, ο κατευθυντικός μοχλός, καθώς και διεπαφές για τα πόδια και το κεφάλι, αλλά το ποντίκι ήταν καλύτερο σε ακρίβεια και ταχύτητα." />
<figcaption aria-hidden="true">Η εφεύρεση και η τελική επιλογή της
συσκευής εισόδου ποντίκι για το σύστημα NLS δεν ήταν τυχαία, αλλά
βασιζόταν σε μια συγκριτική αξιολόγηση εναλλακτικών συσκευών εισόδου.
Για τον σκοπό αυτό, δοκίμασαν τις επιδόσεις των χρηστών με πολλές
διαφορετικές συσκευές εισόδου, όπως ηταν η πένα, ο τροχός κύλισης, ο
κατευθυντικός μοχλός, καθώς και διεπαφές για τα πόδια και το κεφάλι,
αλλά το ποντίκι ήταν καλύτερο σε ακρίβεια και ταχύτητα.</figcaption>
</figure>
<p>Τα τρία βασικά στάδια της ανθρωποκεντρικής σχεδίασης (κατανόηση των
αναγκών του χρήστη, εναλλακτικά σχέδια και κατασκευή πρωτοτύπου,
αξιολόγηση πρωτοτύπων με χρήστες) εκτελούνται κυκλικά και άρα η
επανάληψη βρίσκεται στον πυρήνα της ανθρωποκεντρικής σχεδίασης της
διάδρασης.</p>
<p>Η ανθρωποκεντρική σχεδίαση της διάδρασης ανθρώπου και υπολογιστή δεν
είναι κάτι νέο. Αν μάλιστα θεωρήσουμε και τις δράσεις που έχουν συμβεί
έξω από την επιστημονική κοινότητα, μπορούμε να δούμε ότι είναι τόσο
παλιά όσο η προσπάθεια κάποιων κατασκευαστών να φτιάξουν μηχανές και
εργαλεία που βασίζονται στις δυνατότητες και τις δεξιότητες του
ανθρώπου. Ίσως το πιο ενδιαφέρον παράδειγμα από το μακρινό παρελθόν
είναι το σφυρί, ένα ξύλο δεμένο σε μια πέτρα, το οποίο βελτίωσε πάρα
πολύ την ευχρηστία της πέτρας, που μέχρι τότε έπρεπε οι άνθρωποι να την
χρησιμοποιήσουν κρατώντας την. Αντίστοιχα, μπορούμε να θεωρήσουμε ότι
και η διαδικασία της ανθρωποκεντρικής σχεδίασης δεν είναι κάτι καινούριο
αφού η δοκιμή και το σφάλμα είναι μια σχεδόν διαισθητική δραστηριότητα
που συμβαίνει σε κάθε διαδικασία ανάπτυξης προϊόντος. Η διαφορά είναι
ότι η περιοχή της διάδρασης ανθρώπου και υπολογιστή έχει καταγράψει μια
περισσότερο συστηματική μεθοδολογία για την παραπάνω διαδικασία, που
μέχρι τότε συνέβαινε πιο πολύ ως αυτοσχεδιασμός παρά συστηματικά.</p>
<p>Στο πρόσφατο παρελθόν, η αρχή της ανθρωποκεντρικής σχεδίασης
εντοπίζεται στην περιοχή της Εργονομίας (Ergonomics and Human factors),
η οποία μελετά τις σωματικές δυνατότητες του ανθρώπου για κίνηση. Στην
περίπτωση της εργονομίας η ανθρωποκεντρική σχεδίαση έχει σημαντικό
σύμμαχο τη σχετικά καλώς ορισμένη διακύμανση των μετρικών που
περιγράφουν το ανθρώπινο σώμα και τις κινήσεις του. Στην πορεία ήρθε να
προστεθεί και η περιοχή της γνωστικής επιστήμης (Cognitive Science) που
δίνει έμφαση στις γνωστικές δυνατότητες του ανθρώπου για αντίληψη και
επεξεργασία πληροφορίας. Στην περίπτωση της γνωστικής επιστήμης, αν και
γίνονται επαναληπτικά πειράματα επιβεβαίωσης, είναι σίγουρα πιο δύσκολο
να θεμελιωθεί μια θεωρία με βεβαιότητα, αφού τις λειτουργίες της σκέψης
τις αντιλαμβανόμαστε έμμεσα και όχι άμεσα. Στους παραπάνω βασικούς
πυλώνες (γνωστική επιστήμη και εργονομία) ήρθε να προστεθεί προσφάτως η
συναισθηματική και η αισθητική διάσταση της σχεδίασης για τον άνθρωπο, η
οποία έχει τις ρίζες της στις περιοχές της γραφιστικής και των
εφαρμοσμένων τεχνών. Επίσης, η καλύτερη κατανόηση της διάδρασης του
χρήστη με συσκευές επεκτείνεται και στην ανθρώπινη ψυχολογία, αφού στην
πράξη είναι αδύνατο να διαχωρίσουμε τη λογική από το συναίσθημα.
Φαίνεται ότι οι χρήστες θεωρούμε μια όμορφη διάδραση πιο εύχρηστη, αν
και μετρώντας την εν λόγω ευχρηστία με αντικειμενικά κριτήρια (π.χ.
χρόνος ολοκλήρωσης μιας λειτουργίας), μπορεί να αποδειχθεί πως δεν
είναι.</p>
<p>Ο στόχος της ανθρωποκεντρικής σχεδίασης δεν είναι απλά η
βελτιστοποίηση μιας σχεδίασης, αλλά πρωτίστως, η εύρεση των ιδιοτήτων
της. Αρχικά, οι περισσότερες μελέτες έδιναν έμφαση στην ακρίβεια χρήσης
ποσοτικών μεθόδων έρευνας και αξιολόγησης (π.χ. χρονομέτρηση ολοκλήρωσης
μιας λειτουργίας) με στόχο τη βελτιστοποίηση μιας μεμονωμένης
λειτουργίας ή ολόκληρης της σχεδίασης. Τη δεκαετία του 1990, οι δοκιμές
ευχρηστίας και οι ποσοτικές μέθοδοι ήταν πολύ δημοφιλείς και είχαν στόχο
να βελτιστοποιήσουν τον τρόπο που λειτουργούσαν οι προδιαγραφές
σχεδίασης. Σε πολλές περιπτώσεις, οι κατασκευαστές -αν και όντως
βελτίωναν μια σχεδίαση- δε δούλευαν πάνω σε εκείνη που θα γινόταν
αποδεκτή από τους χρήστες. Τη δεκαετία του 2000, σταδιακά οι
κατασκευαστές της διάδρασης άρχισαν να διερευνούν με ποιoν τρόπο θα
σχεδιάσουν προϊόντα με μεγαλύτερη αποδοχή από το κοινό τους και έτσι
άρχισαν να πειραματίζονται με ποιοτικές μεθόδους έρευνας, κάνοντάς τες
πιο δημοφιλείς και πιο αποδεκτές από την επιχειρηματική κοινότητα. Στην
πράξη, για την κατασκευή της διάδρασης χρησιμοποιούνται διερευνητικές
τεχνικές με πρωτότυπα χαμηλής πιστότητας κατά το πρώτο στάδιο της
κατανόησης των αναγκών, και σταδιακά με την κατασκευή του πρωτοτύπου
υψηλής πιστότητας εφαρμόζονται περισσότερο ποσοτικές μέθοδοι, κατά τη
φάση της αξιολόγησης με χρήστες.</p>
<p>Ανάμεσα στις πιο δημοφιλείς τεχνικές κατανόησης του χρήστη μπορούμε
να ξεχωρίσουμε την εθνογραφία, η οποία ξεκίνησε από τις μελέτες των
ανθρωπολόγων και προσαρμόστηκε στη σχεδίαση της διάδρασης. Εν συντομία,
όπως οι ανθρωπολόγοι ενσωματώνουν τους εαυτούς τους στην καθημερινότητα
πολύ διαφορετικών πολιτισμών, έτσι και οι σχεδιαστές των νέων διάχυτων
ΗΥ, θα πρέπει είτε οι ίδιοι είτε μέσω άλλων ειδικευμένων για αυτόν τον
σκοπό ερευνητών, να μπουν στη ρευστή καθημερινότητα των ανθρώπων για
τους οποίους καλούνται να σχεδιάσουν νέα συστήματα διάδρασης, τα οποία
μπορεί απλά να διευκολύνουν, να επαυξάνουν ακόμη και να αλλάζουν ριζικά
τον τρόπο που ένας χρήστης ή ακόμη δυσκολότερα μια ομάδα ανθρώπων,
σκέφτονται, αποφασίζουν και δρουν σε έναν κόσμο που γίνεται αντιληπτός
αλλά και επηρεάζεται από διάχυτους υπολογιστές. Αν και η εθνογραφική
μέθοδος είναι μια δημοφιλής επιλογή στη σχεδίαση νέων συστημάτων,
μοιράζεται αρκετές τεχνικές (π.χ. παρατήρηση) με άλλες μεθόδους, οπότε η
βέλτιστη κατανόηση και χρήση της προϋποθέτει και τη γνώση των
συμπληρωματικών και πολλές φορές επικαλυπτόμενων μεθόδων (π.χ.,
συνεντεύξεις, ομάδες εστίασης, πολιτισμική διερεύνηση, κτλ.).</p>
<p>Η πολιτισμική διερεύνηση (cultural probes) είναι από τις πιο απλές
και δημοφιλείς τεχνικές για την καταγραφή της συμπεριφοράς που έχουν οι
χρήστες και την έμμεση αποκάλυψη των αναγκών τους. Η πολιτισμική
διερεύνηση βασίζεται στην αποστολή ενός φακέλου με αντικείμενα
καθημερινής χρήσης, τα οποία έχουν απλές οδηγίες για τους χρήστες. Για
παράδειγμα, ένας φάκελος πολιτισμικής διερεύνησης στα τέλη της δεκαετίας
του 1990 συνήθως περιείχε μια φωτογραφική μηχανή μιας χρήσης, καθώς και
την παρότρυνση να βγάλουν φωτογραφία κάποιο αγαπημένο αντικείμενο ή
δραστηριότητα. Εκτός από τη φωτογραφική μηχανή, ένα ακόμη δημοφιλές
αντικείμενο είναι το ημερολόγιο, το οποίο ο χρήστης συμπληρώνει
αναφορικά με τις δραστηριότητές του, όπως εκπομπές στην τηλεόραση και
συναντήσεις με φίλους. Στο τέλος της χρονικής περιόδου, ο φάκελος της
πολιτισμικής διερεύνησης αποστέλλεται στους ερευνητές, οι οποίοι
χρησιμοποιούν τα περιεχόμενα του φακέλου (φωτογραφίες, αυτοκόλλητα
post-it, κτλ.) στον χώρο σχεδίασης ώστε να μπουν καλύτερα στο κόσμο του
χρήστη. Αν και τα περιεχόμενα του συμπληρωμένου φακέλου πολιτισμικής
διερεύνησης δε δείχνουν μονοσήμαντα τις προδιαγραφές, το νόημα βρίσκεται
περισσότερο στην καλύτερη εμβύθιση της ομάδας σχεδίασης στο περιβάλλον
του χρήστη, έτσι ώστε τελικά οι προδιαγραφές που θα καθοριστούν να είναι
συμβατές με το αντίστοιχο πλαίσιο χρήσης του προϊόντος.</p>
<p>Εκτός από την τεχνική της πολιτισμικής διερεύνησης (cultural probes)
που μελετήσαμε παραπάνω, άλλη μια τεχνική που είναι απλή,
αποτελεσματική, και δημοφιλής για την κατανόηση των ανθρώπινων αναγκών
είναι ο καθορισμός αντιπροσωπευτικών χρηστών (personas). Η τεχνική αυτή
βασίζεται στην περιγραφή των ιδιοτήτων ενός χρήστη, όπως είναι τα
δημογραφικά, οι προτιμήσεις, και οι συνήθειές του. Οι αντιπροσωπευτικοί
χρήστες που παρουσιάζονται στις personas μπορεί να είναι υπαρκτά
πρόσωπα, αλλά μπορεί να είναι και φανταστικά πρόσωπα, τα οποία ομοίως
ανταποκρίνονται σε κάποιες κατηγορίες χρήστη της εφαρμογής που
αναπτύσσουμε. Οι personas κατασκευάζονται σε συνεργασία με τους τελικούς
χρήστες της εφαρμογής και με δεδομένα που μαζεύονται από ερωτηματολόγια
και συνεντεύξεις. Οι personas χρησιμοποιούνται από την ομάδα ανάπτυξης
σε συνδυασμό με την τεχνική του αφηγηματικού σεναρίου, το οποίο θα δούμε
στην επόμενη ενότητα της κατασκευής πρωτοτύπου χαμηλής πιστότητας. Για
την ακρίβεια, οι personas είναι συνήθως οι πρωταγωνιστές ή σημαντικοί
ρόλοι στα σενάρια που περιγράφουν τη διάδραση ανάμεσα στους χρήστες και
στους υπολογιστές.</p>
<p>Πέρα από τις παραπάνω συστηματικές προσεγγίσεις για την κατανόηση των
αναγκών του χρήστη, υπάρχουν και περισσότερο δημιουργικές απόψεις, οι
οποίες βασίζονται στον αυτοσχεδιασμό και στην έμπνευση. Για παράδειγμα,
για αρκετές από της συσκευές διάδρασης της Apple δεν έχει γίνει
συστηματική έρευνα των αναγκών του χρήστη, αλλά έχει χρησιμοποιηθεί η
έμπνευση, η διαίσθηση, και η δημιουργικότητα της ομάδας σχεδίασης και
της διοίκησης. Τόσο ο σχεδιασμός του iPod, όσο και ο σχεδιασμός του
iPhone, έχουν στοιχεία διάδρασης που μέχρι τότε δεν είχαν εμφανιστεί σε
κάποιο άλλο εμπορικό προϊόν, αλλά μπήκαν σε αυτά τα προϊόντα γιατί ο
κατασκευαστής πίστευε ότι αυτό είναι που έχουν ανάγκη οι χρήστες. Είναι
φανερό ότι μια τέτοια προσέγγιση έχει πολύ μεγάλο ρίσκο αποτυχίας, ενώ
απαιτεί και μεγάλα αποθέματα αυτοπεποίθησης, αλλά αν πετύχει, τότε το
αποτέλεσμα είναι ο νικητής να βρίσκεται πολύ μπροστά από τους
ανταγωνιστές, οι οποίοι είναι αναγκασμένοι να επαναπροσδιορίσουν τις
κατηγορίες προϊόντων που προσφέρουν, αφού οι ανάγκες των χρηστών δεν θα
είναι πλέον ίδιες. Είναι χαρακτηριστικό ότι ο αρχικός σχεδιαστής
γραφικών στην εταιρεία Google, ανέφερε ότι ένας από τους λόγους της
παραίτησής του ήταν ότι η κυρίαρχη κουλτούρα τεχνοκρατικής αντίληψης της
εταιρείας είχε φτάσει στο σημείο να κάνουν δοκιμές για το αν το πάχος
γραμμής θα έπρεπε να είναι δύο ή τέσσερα εικονοστοιχεία. Επομένως, εκτός
από την μελέτη των χρηστών, μια ακόμη τεχνική κατανόησης των αναγκών
είναι η διαίσθηση ενός έμπειρου και ταλαντούχου σχεδιαστή.</p>
<section id="footnotes" class="footnotes footnotes-end-of-section"
role="doc-endnotes">
<hr />
<ol>
<li><div id="fn1">
<p>fig:apple-lisa<a href="#fnref1" class="footnote-back"
role="doc-backlink">↩︎</a></p>
</div></li>
<li><div id="fn2">
<p>fig:apple-macintosh<a href="#fnref2" class="footnote-back"
role="doc-backlink">↩︎</a></p>
</div></li>
<li><div id="fn3">
<p><span class="citation" data-cites="papanek1972design">Papanek και
Fuller (1972)</span>, <span class="citation"
data-cites="thackara2006bubble">Thackara (2006)</span><a href="#fnref3"
class="footnote-back" role="doc-backlink">↩︎</a></p>
</div></li>
<li><div id="fn4">
<p><span class="citation" data-cites="norman2013design">Norman
(2013)</span><a href="#fnref4" class="footnote-back"
role="doc-backlink">↩︎</a></p>
</div></li>
<li><div id="fn5">
<p>fig:nls-radar-keypad<a href="#fnref5" class="footnote-back"
role="doc-backlink">↩︎</a></p>
</div></li>
<li><div id="fn6">
<p>fig:nls-input<a href="#fnref6" class="footnote-back"
role="doc-backlink">↩︎</a></p>
</div></li>
</ol>
</section>
<h2 id="ελάχιστο-εφικτό-προϊόν">Ελάχιστο εφικτό προϊόν</h2>
<figure id="fig:engelbart-mouse">
<img src="../images/engelbart-mouse.jpg"
alt="Το αρχικό πρωτότυπο για το ποντίκι είναι ακριβώς το ίδιο μορφολογικά με τις αντίστοιχες συσκευές που παράγονται με μεγάλη επιτυχία πενήντα χρόνια μετά, αν και φυσικά έχουν βελτιωθεί πολλές επιμέρους λειτουργικές ιδιότητές του. Οι δύο τροχοί κύλισης δεν επιτρέπουν την διαγώνια κίνηση, αλλά αυτό δεν είναι μεγάλο πρόβλημα αφού η χρήση του εστιάζεται κυρίως στην επεξεργασία κειμένου. Η συσκευή αυτή είναι σημαντική καινοτομία γιατί διαφέρει σημαντικά από παρόμοιες και επέτρεψε την διεξαγωγή πειραμάτων που απέδειξαν την υπεροχή του έναντι των εναλλακτικών." />
<figcaption aria-hidden="true">Το αρχικό πρωτότυπο για το ποντίκι είναι
ακριβώς το ίδιο μορφολογικά με τις αντίστοιχες συσκευές που παράγονται
με μεγάλη επιτυχία πενήντα χρόνια μετά, αν και φυσικά έχουν βελτιωθεί
πολλές επιμέρους λειτουργικές ιδιότητές του. Οι δύο τροχοί κύλισης δεν
επιτρέπουν την διαγώνια κίνηση, αλλά αυτό δεν είναι μεγάλο πρόβλημα αφού
η χρήση του εστιάζεται κυρίως στην επεξεργασία κειμένου. Η συσκευή αυτή
είναι σημαντική καινοτομία γιατί διαφέρει σημαντικά από παρόμοιες και
επέτρεψε την διεξαγωγή πειραμάτων που απέδειξαν την υπεροχή του έναντι
των εναλλακτικών.</figcaption>
</figure>
<figure id="fig:nls-mouse">
<img src="../images/nls-mouse.jpg"
alt="Οι χειριστές του NLS μετά από μερικές ώρες εκπαίδευσης μπορούν να χρησιμοποιήσουν το πληκτρολόγιο ακόρντων σε συνδυασμό με το ποντίκι τριών πλήκτρων για να κάνουν επεξεργασία κειμένου και πληκτρολόγηση νέων λέξεων, χωρίς να μετακινήσουν τα χέρια τους στο κεντρικό πληκτρολόγιο. Με αυτόν τον τρόπο, εκτός από την ταχύτητα εκτέλεσης της διεργασίας μειώνεται και η επιβάρυνση των χεριών που είναι σημαντική για όποιον χρησιμοποιεί τέτοια συστήματα μερικές ώρες κάθε μέρα." />
<figcaption aria-hidden="true">Οι χειριστές του NLS μετά από μερικές
ώρες εκπαίδευσης μπορούν να χρησιμοποιήσουν το πληκτρολόγιο ακόρντων σε
συνδυασμό με το ποντίκι τριών πλήκτρων για να κάνουν επεξεργασία
κειμένου και πληκτρολόγηση νέων λέξεων, χωρίς να μετακινήσουν τα χέρια
τους στο κεντρικό πληκτρολόγιο. Με αυτόν τον τρόπο, εκτός από την
ταχύτητα εκτέλεσης της διεργασίας μειώνεται και η επιβάρυνση των χεριών
που είναι σημαντική για όποιον χρησιμοποιεί τέτοια συστήματα μερικές
ώρες κάθε μέρα.</figcaption>
</figure>
<p>Η ασαφής φύση της διάδρασης, όπως την περιγράψαμε στην προηγούμενη
ενότητα, δεν επιτρέπει σε πολλές περιπτώσεις την διατύπωση προδιαγραφών,
οι οποίες θα υλοποιηθούν σε ένα επόμενο βήμα της κατασκευής, όπως
συνηθίζεται στις επιστήμες των μηχανικών. Αντίθετα, η κατασκευή της
διάδρασης συνήθως βασίζεται σε ένα λειτουργικό υπόδειγμα, το οποίο
παίζει των ρόλο των ρευστών προδιαγραφών. <a href="#fn7" id="fnref7"
class="footnote-ref" role="doc-noteref"><sup>7</sup></a> <a href="#fn8"
id="fnref8" class="footnote-ref" role="doc-noteref"><sup>8</sup></a></p>
<p>Σε αυτήν την ενότητα περιγράφουμε με περισσότερη λεπτομέρεια τη
διαδικασία, τις τεχνικές και τα εργαλεία για την κατασκευή πρωτοτύπων
διάδρασης με συσκευές χρήστη. Κάθε τεχνική παράγει ένα πρωτότυπο
διαφορετικής πιστότητας και όσο μεγαλύτερη είναι η απαιτούμενη
λειτουργικότητα του πρωτοτύπου τόσο περισσότερο χρόνο θέλουμε για να το
φτιάξουμε ή για να το αλλάξουμε. Επομένως, η επιλογή του αναγκαίου
βαθμού πιστότητας του πρωτοτύπου και ο καθορισμός της κατάλληλης
τεχνικής κατασκευής του είναι πολύ σημαντικές παράμετροι και
περιγράφονται σε αυτήν την ενότητα.</p>
<p>Η διαδικασία της κατασκευής της διάδρασης είναι ένας κύκλος
επανάληψης στον οποίο δύσκολα θα προσδιορίσουμε πού αρχίζει και πού
τελειώνει. Ειδικά για τα προϊόντα ευρείας χρήσης, είναι η ίδια η χρήση
τους που επαναπροσδιορίζει τη φύση τους σε έναν αέναο κύκλο. Κάποιος θα
μπορούσε να υποστηρίξει ότι όλα αυτά δεν είναι καθόλου νέα, και ότι όλες
οι παραδοσιακές βιομηχανίες (κτήρια, αυτοκίνητα) σταδιακά μεταλλάσσονται
για να εξυπηρετήσουν τους χρήστες τους. Αυτό είναι αλήθεια, αλλά οι
αλλαγές που συνήθως συμβαίνουν σε όλες τις παραπάνω βιομηχανίες είναι
τόσο σταδιακές χρονικά και τόσο προσθετικές δομικά, που και πάλι
αναδεικνύεται αυτή η ιδιαιτερότητα του προγραμματισμού της διάδρασης ως
προς τη διαδικασία κατασκευής, σε σχέση με τις πολύ συγγενείς του
περιοχές.</p>
<p>Συνοπτικά, η κεντρική διαφορά κατασκευής της διάδρασης από άλλες
επιστήμες του μηχανικού είναι ότι τόσο η διαδικασία ανάπτυξης όσο και η
τελική κατασκευή αποτελούν στάδια ενός συνεχώς ανατροφοδοτούμενου
κύκλου. Για παράδειγμα, η δημοφιλής υπηρεσία Google Mail για πολλά
χρόνια είχε την ετικέτα βήτα (beta) ενώ ήταν πλήρως λειτουργική.
Βλέπουμε λοιπόν, ότι στην περίπτωση του λογισμικού, οι <em>επίσημες
τελικές εκδόσεις</em> είναι απλώς προφορικές ή γραπτές δηλώσεις και
συμβάσεις του κατασκευαστή Σε αντίθεση με ένα σπίτι, το οποίο μετά την
παράδοσή του στον χρήστη δέχεται ελάχιστες μετατροπές, ακόμη κι έπειτα
από πολλά χρόνια.</p>
<figure id="fig:office-schematic">
<img src="../images/office-schematic.png"
alt="Ίσως το πιο διάσημο πρωτότυπο χαμηλής πιστότητας να είναι το σχεδιάγραμμα της γραφικής επιφάνειας εργασίας που έγινε σε μια χαρτοπετσέτα από τους ερευνητές του Xerox PARC και χρησιμοποιούσε τη μεταφορά του γραφείου για την απεικόνιση των διεπαφών." />
<figcaption aria-hidden="true">Ίσως το πιο διάσημο πρωτότυπο χαμηλής
πιστότητας να είναι το σχεδιάγραμμα της γραφικής επιφάνειας εργασίας που
έγινε σε μια χαρτοπετσέτα από τους ερευνητές του Xerox PARC και
χρησιμοποιούσε τη μεταφορά του γραφείου για την απεικόνιση των
διεπαφών.</figcaption>
</figure>
<figure id="fig:dynabook-spacewar">
<img src="../images/dynabook-spacewar.jpg"
alt="Η βασική εφαρμογή που οδήγησε τον σχεδιασμό του Dynabook ήταν το βιντεοπαιχνίδι Spacewar που εκείνη την εποχή ήταν σημείο αναφοράς για όλους τους ερευνητές που είχαν πρόσβαση σε έναν κεντρικό υπολογιστή. Όπως ακριβώς οι ερευνητές υλοποιούσαν, έπαιζαν και έκαναν μετατροπές στον πηγαίο κώδικα του Spacewar, έτσι και οι χρήστες του Dynabook θα μπορούσαν να έχουν πρόσβαση σε ένα νέο μέσο επικοινωνίας και έκφρασης." />
<figcaption aria-hidden="true">Η βασική εφαρμογή που οδήγησε τον
σχεδιασμό του Dynabook ήταν το βιντεοπαιχνίδι Spacewar που εκείνη την
εποχή ήταν σημείο αναφοράς για όλους τους ερευνητές που είχαν πρόσβαση
σε έναν κεντρικό υπολογιστή. Όπως ακριβώς οι ερευνητές υλοποιούσαν,
έπαιζαν και έκαναν μετατροπές στον πηγαίο κώδικα του Spacewar, έτσι και
οι χρήστες του Dynabook θα μπορούσαν να έχουν πρόσβαση σε ένα νέο μέσο
επικοινωνίας και έκφρασης.</figcaption>
</figure>
<p>Τα αρχικά προσχέδια είναι και αυτά πολύ χρήσιμα,<a href="#fn9"
id="fnref9" class="footnote-ref" role="doc-noteref"><sup>9</sup></a> για
την καλύτερη κατανόηση της διάδρασης, και κυρίως για την επικοινωνία
μεταξύ των μελών της ομάδας ανάπτυξης. <a href="#fn10" id="fnref10"
class="footnote-ref" role="doc-noteref"><sup>10</sup></a> <a
href="#fn11" id="fnref11" class="footnote-ref"
role="doc-noteref"><sup>11</sup></a> Τα αρχικά προσχέδια συνήθως έχουν
τη μορφή του αφηγηματικού σεναρίου<a href="#fn12" id="fnref12"
class="footnote-ref" role="doc-noteref"><sup>12</sup></a> και των
ενδεικτικών οθονών, αλλά υπάρχουν και άλλες επιλογές, όπως η
ιστοριογραφία, το βίντεο, οι διαδραστικές διαφάνειες, και πολλά άλλα
εξειδικευμένα εργαλεία κατασκευής προσχεδίου για το υπόδειγμα. <a
href="#fn13" id="fnref13" class="footnote-ref"
role="doc-noteref"><sup>13</sup></a> <a href="#fn14" id="fnref14"
class="footnote-ref" role="doc-noteref"><sup>14</sup></a></p>
<p>Υπάρχουν διάφορες τεχνικές κατασκευής πρωτοτύπου ανάλογα με το στάδιο
ανάπτυξης και το είδος ενός νέου προϊόντος. Τα τμήματα έρευνας και
ανάπτυξης μιας εταιρείας εντοπίζουν νέες ανάγκες, κατασκευάζουν
πρωτότυπα, και κάνουν δοκιμές με χρήστες πριν καταλήξουν στο τελικό
προϊόν. Η κατασκευή πρωτοτύπου είναι μια διαδικασία που κάνουν όλες οι
εταιρείες αλλά διαφέρει ανάλογα με το είδος του προϊόντος και την
οργάνωση της εταιρείας. Για παράδειγμα, μια μεγάλη εταιρεία συνήθως έχει
σαφώς ορισμένες διαδικασίες κατασκευής πρωτοτύπων που καθορίζουν τον
αριθμό των πρωτοτύπων που φτιάχνονται για κάθε έκδοση του προϊόντος
καθώς και τις προδιαγραφές του. Αντίθετα, οι μικρές καινοτομικές
εταιρείες χρησιμοποιούν το ίδιο το πρωτότυπο ως προδιαγραφές. Ακόμη,
μπορεί να υπάρχουν διαφορές στα εργαλεία και τα υλικά που
χρησιμοποιούνται για την κατασκευή του πρωτοτύπου ανάλογα με το είδος
του προϊόντος. Για παράδειγμα, στην αυτοκινητοβιομηχανία ξεκινούν με
σχεδιαγράμματα, συνεχίζουν με μοντέλα 3Δ στον υπολογιστή και καταλήγουν
στην κατασκευή απτών πρωτοτύπων. Στην κατασκευή έξυπνων κινητών
τηλεφώνων χρησιμοποιούνται όλες αυτές οι τεχνικές ανάλογα με το στάδιο
ανάπτυξης του προϊόντος. Ειδικά στην περίπτωση της κατασκευής λογισμικού
διάδρασης,<a href="#fn15" id="fnref15" class="footnote-ref"
role="doc-noteref"><sup>15</sup></a> η διάκριση ανάμεσα στο πρωτότυπο
και στο τελικό προϊόν είναι πολλές φορές δυσδιάκριτη, αφού πολλά από τα
πρωτότυπα γίνονται προϊόντα, ενώ τα προϊόντα με τη σειρά τους αποτελούν
πρωτότυπα για την επόμενη έκδοση του προϊόντος.</p>
<figure id="fig:knowledge-navigator">
<img src="../images/knowledge-navigator.jpg"
alt="Στα τέλη της δεκαετίας του 1980 η Apple παρουσίασε ένα βίντεο με μια μεγάλη επιτραπέζια συσκευή αφής, η οποία είχε δυνατότητα πολυμέσων, υπερμέσων, καθώς και τηλεδιάσκεψης με βίντεο, τα οποία όμως δεν ήταν τεχνολογικά εφικτά τότε, όμως αυτό δεν εμπόδισε τους σχεδιαστές της διεπαφής να τα φανταστούν, αφού όλη η παρουσίαση ήταν ένα ψηφιακά επεξεργασμένο βίντεο και όχι ένα πραγματικό πρωτότυπο." />
<figcaption aria-hidden="true">Στα τέλη της δεκαετίας του 1980 η Apple
παρουσίασε ένα βίντεο με μια μεγάλη επιτραπέζια συσκευή αφής, η οποία
είχε δυνατότητα πολυμέσων, υπερμέσων, καθώς και τηλεδιάσκεψης με βίντεο,
τα οποία όμως δεν ήταν τεχνολογικά εφικτά τότε, όμως αυτό δεν εμπόδισε
τους σχεδιαστές της διεπαφής να τα φανταστούν, αφού όλη η παρουσίαση
ήταν ένα ψηφιακά επεξεργασμένο βίντεο και όχι ένα πραγματικό
πρωτότυπο.</figcaption>
</figure>
<figure id="fig:starfire-video">
<img src="../images/starfire-video.jpg"
alt="Στις αρχές της δεκαετίας του 1990 η Sun παρουσίασε ένα βίντεο με μια μεγάλη επιτραπέζια συσκευή χειρονομίας, η οποία βασίζεται στην συνεργασία μέσω τηλεδιάσκεψης με βίντεο, όπου η πρωταγωνίστρια εργάζεται από το σπίτι της γιατί έχει κρυολόγημα. Το βίντεο υπόδειγμα χρησιμοποιεί την τεχνική της μπλε οθόνης για να εισάγει τις πρόσθετες ροές βίντεο πάνω στο αρχικό σκηνοθετημένο βίντεο." />
<figcaption aria-hidden="true">Στις αρχές της δεκαετίας του 1990 η Sun
παρουσίασε ένα βίντεο με μια μεγάλη επιτραπέζια συσκευή χειρονομίας, η
οποία βασίζεται στην συνεργασία μέσω τηλεδιάσκεψης με βίντεο, όπου η
πρωταγωνίστρια εργάζεται από το σπίτι της γιατί έχει κρυολόγημα. Το
βίντεο υπόδειγμα χρησιμοποιεί την τεχνική της μπλε οθόνης για να εισάγει
τις πρόσθετες ροές βίντεο πάνω στο αρχικό σκηνοθετημένο
βίντεο.</figcaption>
</figure>
<p>Στόχος της σχεδίασης διαδραστικών συστημάτων είναι η μεγιστοποίηση
της ευχρηστίας τους. Υπάρχει μια σειρά κανόνων σχεδίασης που βασίζονται
σε προηγούμενη θεωρία ή/και εμπειρία και οι οποίοι μπορούν να μας
βοηθήσουν στον καθορισμό εύχρηστων διαδραστικών συστημάτων,
συμπεριλαμβανομένων αφηρημένων βασικών αρχών, οδηγιών και άλλων
ζητημάτων σχεδίασης. Οι σχεδιαστικές οδηγίες είναι συλλογές συμβουλών
για τους σχεδιαστές διεπαφών χρήστη οι οποίες είναι απαραίτητες,
προκειμένου να εξασφαλιστεί ότι το τελικό προϊόν θα είναι φιλικό προς
τον χρήστη. Αρκετά βιβλία και τεχνικές αναφορές περιέχουν μεγάλους
καταλόγους από σχεδιαστικές οδηγίες. Αυτές διαιρούνται σε υποκατηγορίες
με πιο εξειδικευμένες οδηγίες σχεδίασης. Οι περισσότερες έρευνες και
προτάσεις που έχουν γίνει πάνω στις σχεδιαστικές οδηγίες αφορούν τα
‘κλασικά’ συστήματα υπολογιστών (επιτραπέζιος, κινητός υπολογιστής) που
χρησιμοποιούνται σε ευρεία κλίμακα. Όμως, η ραγδαία ανάπτυξη του κινητού
υπολογισμού τα τελευταία χρόνια, προκάλεσε μια έκρηξη στη ζήτηση
αντίστοιχων συσκευών.</p>
<p>Η κατασκευή πρωτοτύπων για τον προγραμματισμό της διάδρασης σε
συσκευές πέρα από τον επιτραπέζιο υπολογιστή είναι μια πρόκληση, η οποία
είναι περισσότερο πολύπλοκη από την κατασκευή πρωτοτύπου για άλλες
περιπτώσεις. Για παράδειγμα, η κατασκευή του πρωτοτύπου για μια εφαρμογή
που θα εκτελεστεί σε έναν επιτραπέζιο ΗΥ δεν απαιτεί τίποτα περισσότερο
από τον ίδιο τον επιτραπέζιο ΗΥ ανάπτυξης, γιατί και ο τελικός
προορισμός της εφαρμογής θα είναι σε ένα παρόμοιο υλικό, και η διάδραση
με τον χρήστη θα γίνεται με τις ίδιες συσκευές εισόδου, δηλαδή το
πληκτρολόγιο και το ποντίκι. Το ίδιο ισχύει και για την κατασκευή ενός
πρωτοτύπου για ένα νέο ποντίκι για τον επιτραπέζιο ΗΥ. Με δεδομένη την
εργονομία του χεριού και το πλαίσιο χρήσης του ποντικιού, που είναι η
μετακίνηση του δείκτη στην οθόνη και η επιλογή με ένα κουμπί, ο
σχεδιαστής έχει αρκετά σημεία αναφοράς στα οποία μπορεί να βασιστεί.</p>
<p>Αντίθετα, η κατασκευή του πρωτοτύπου για μια συσκευή διάδρασης χρήστη
με κινητό ή διάχυτο ΗΥ είναι μια πρόκληση, γιατί απαιτεί τη συνεργασία
λογισμικού με την κατασκευή ειδικού υλικού διάδρασης με τον χρήστη.
Καθώς ο διάχυτος υπολογισμός θα φέρνει περισσότερες συσκευές χρήστη σε
περισσότερες πτυχές της ζωής μας, αυξάνεται η ανάγκη για κατασκευή (και
αξιολόγηση από τους χρήστες) πρωτοτύπων υψηλής πιστότητας που συνδυάζουν
υλικό με λογισμικό. Για αυτόν τον σκοπό οι σχεδιαστές της διάδρασης
έχουν αναπτύξει μια τεχνική που συνδυάζει ειδικά φτιαγμένο υλικό
διάδρασης με τον χρήστη, με λογισμικό που εκτελείται σε επιτραπέζιο ή
κινητό ΗΥ, για τους οποίους οι προγραμματιστές μπορούν να
χρησιμοποιήσουν τα διαθέσιμα εργαλεία ανάπτυξης. Η τεχνική αυτή δεν
έρχεται να αντικαταστήσει τις τεχνικές κατασκευής πρωτοτύπου χαμηλής
πιστότητας που μελετήσαμε προηγουμένως, αλλά έρχεται να προστεθεί, ως
ένα ακόμη βήμα, στον επαναληπτικό κύκλο του προγραμματισμού της
διάδρασης.</p>
<p>Ο σκοπός της κατασκευής πρωτοτύπου υψηλής πιστότητας είναι να το
αξιολογήσουμε με χρήστες σε εργαστηριακό περιβάλλον ή ακόμη και σε
μελέτη στο πεδίο (field research). Τα πρωτότυπα χαμηλής πιστότητας
(π.χ., σενάριο, σχεδιάγραμμα, ενδεικτικές οθόνες) είναι κατάλληλα
περισσότερο για την οπτικοποίηση και επεξεργασία αρχικών ιδεών από τους
σχεδιαστές και τους συνεργάτες τους. Πράγματι, τα πρωτότυπα χαμηλής
πιστότητας είναι χρήσιμα για τη γρήγορη και ανεπίσημη επικοινωνία μεταξύ
των μελών μιας ομάδας σχεδίασης και ανάπτυξης, αφού οι λέξεις δεν είναι
σχεδόν ποτέ αρκετές για να περιγράψουν το φαινόμενο της διάδρασης. Όταν,
όμως, ο σκοπός είναι να κατανοήσουμε καλύτερα και κυρίως να
αξιολογήσουμε ένα πρωτότυπο διάδρασης με χρήστες, τότε θα πρέπει να
έχουμε μεγαλύτερη πιστότητα στη λειτουργία, ώστε να έχουν νόημα και οι
αντιδράσεις των χρηστών που θα καταγραφούν και θα αναλυθούν. Για αυτόν
τον σκοπό, γίνεται η κατασκευή του Buck,<a href="#fn16" id="fnref16"
class="footnote-ref" role="doc-noteref"><sup>16</sup></a> το οποίο
αποτελείται από δύο βασικά τμήματα: 1) το λογισμικό που εκτελείται σε
έναν επιτραπέζιο ΗΥ και 2) το υλικό διάδρασης της συσκευής με τον
χρήστη, το οποίο είναι συνδεδεμένο ενσύρματα με τον επιτραπέζιο
υπολογιστή, ώστε να μεταφέρει σε αυτόν για επεξεργασία την είσοδο από
τον χρήστη.</p>
<figure id="fig:buck">
<img src="../images/buck.png"
alt="Στην φάση της μετάβασης από τα αρχικά προσχέδια σε λειτουργικά πρωτότυπα υπάρχει πολύ μεγάλη ασάφεια αναφορικά με το λογισμικό και υλικό ειδικά στις περιπτώσεις που έχουμε νέες συσκευές, όπως ένα έξυπνο κινητό ή άλλες συσκευές διάχυτου υπολογισμού. Το πρωτότυπο υψηλής πιστότητας τύπου Buck γερυφώνει αυτήν την μετάβαση με την δημιουργική επαναχρησιμοποίηση υλικού και λογισμικού που ήδη υπάρχει, ακόμη και αν αυτά δεν θα είναι ίδια στο τελικό προϊόν, αρκεί να είναι αντιπροσωπευτικά της διάδρασης." />
<figcaption aria-hidden="true">Στην φάση της μετάβασης από τα αρχικά
προσχέδια σε λειτουργικά πρωτότυπα υπάρχει πολύ μεγάλη ασάφεια αναφορικά
με το λογισμικό και υλικό ειδικά στις περιπτώσεις που έχουμε νέες
συσκευές, όπως ένα έξυπνο κινητό ή άλλες συσκευές διάχυτου υπολογισμού.
Το πρωτότυπο υψηλής πιστότητας τύπου Buck γερυφώνει αυτήν την μετάβαση
με την δημιουργική επαναχρησιμοποίηση υλικού και λογισμικού που ήδη
υπάρχει, ακόμη και αν αυτά δεν θα είναι ίδια στο τελικό προϊόν, αρκεί να
είναι αντιπροσωπευτικά της διάδρασης.</figcaption>
</figure>
<figure id="fig:kodak-hifi">
<img src="../images/kodak-hifi.png"
alt="Το πρωτότυπο υψηλής πιστότητας για μια ψηφιακή φωτογραφική μηχανή της Kodak." />
<figcaption aria-hidden="true">Το πρωτότυπο υψηλής πιστότητας για μια
ψηφιακή φωτογραφική μηχανή της Kodak.</figcaption>
</figure>
<p>Η κατασκευή πρωτοτύπου υψηλής πιστότητας τύπου Buck έχει επίσης
χρησιμοποιηθεί και από άλλες εταιρείες για προϊόντα που συνδυάζουν το
υλικό με το λογισμικό. Για παράδειγμα, η Kodak το χρησιμοποίησε για να
φτιάξει το πρωτότυπο για ψηφιακές κάμερες. Σε αυτήν την περίπτωση εκτός
από την κατασκευή του υλικού διάδρασης με τον χρήστη είχαμε και την
ενσωμάτωση μιας μικρής οθόνης μέσα στο υλικό. Πάντως, το λογισμικό δεν
εκτελείται στην ίδια τη συσκευή, αλλά στον επιτραπέζιο ΗΥ, με τον οποίο
επικοινωνεί μέσω καλωδίου και διεπαφής που φροντίζει για τη μετατροπή
των ενεργειών στη συσκευή του χρήστη σε μορφή κατανοητή από το λογισμικό
του επιτραπέζιου ΗΥ. Και στις δύο περιπτώσεις έχουμε ένα πρωτότυπο
διάδρασης που λίγο μοιάζει με το τελικό προϊόν, όμως εξυπηρετεί τον
σκοπό της αξιολόγησης βασικών λειτουργιών από τους χρήστες. Τέλος,
αξίζει να παρατηρήσουμε ότι ακόμη και στην κατηγορία των πρωτοτύπων
υψηλής πιστότητας υπάρχει μια επιμέρους κλίμακα πιστότητας με κάποια
πρωτότυπα να είναι περισσότερο κοντά στο τελικό προϊόν από κάποια άλλα.
<a href="#fn17" id="fnref17" class="footnote-ref"
role="doc-noteref"><sup>17</sup></a> <a href="#fn18" id="fnref18"
class="footnote-ref" role="doc-noteref"><sup>18</sup></a></p>
<p>Ο βασικός στόχος της κατασκευής της διάδρασης είναι να αναπτύξει
συστήματα και συσκευές που να ανταποκρίνονται στις ανάγκες των χρηστών
κατά τη διαδικασία επίτευξης των στόχων τους σε ένα δεδομένο πλαίσιο
χρήσης. Για αυτόν τον σκοπό, οι σχεδιαστές συνήθως εξετάσουν παράγοντες
όπως η ευχρηστία και η μέτρησή της.</p>
<section id="footnotes" class="footnotes footnotes-end-of-section"
role="doc-endnotes">
<hr />
<ol start="7">
<li><div id="fn7">
<p>fig:engelbart-mouse<a href="#fnref7" class="footnote-back"
role="doc-backlink">↩︎</a></p>
</div></li>
<li><div id="fn8">
<p>fig:nls-mouse<a href="#fnref8" class="footnote-back"
role="doc-backlink">↩︎</a></p>
</div></li>
<li><div id="fn9">
<p><span class="citation" data-cites="buxton2010sketching">Buxton
(2010)</span><a href="#fnref9" class="footnote-back"
role="doc-backlink">↩︎</a></p>
</div></li>
<li><div id="fn10">
<p>fig:office-schematic<a href="#fnref10" class="footnote-back"
role="doc-backlink">↩︎</a></p>
</div></li>
<li><div id="fn11">
<p>fig:dynabook-spacewar<a href="#fnref11" class="footnote-back"
role="doc-backlink">↩︎</a></p>
</div></li>
<li><div id="fn12">
<p><span class="citation" data-cites="carroll2000making">Carroll
(2000)</span><a href="#fnref12" class="footnote-back"
role="doc-backlink">↩︎</a></p>
</div></li>
<li><div id="fn13">
<p>fig:knowledge-navigator<a href="#fnref13" class="footnote-back"
role="doc-backlink">↩︎</a></p>
</div></li>
<li><div id="fn14">
<p>fig:starfire-video<a href="#fnref14" class="footnote-back"
role="doc-backlink">↩︎</a></p>
</div></li>
<li><div id="fn15">
<p><span class="citation" data-cites="winograd1996bringing">Winograd
κ.ά. (1996)</span>, <span class="citation"
data-cites="moggridge2007designing">Moggridge (2007)</span><a
href="#fnref15" class="footnote-back" role="doc-backlink">↩︎</a></p>
</div></li>
<li><div id="fn16">
<p><span class="citation" data-cites="pering2002interaction">Pering
(2002)</span><a href="#fnref16" class="footnote-back"
role="doc-backlink">↩︎</a></p>
</div></li>
<li><div id="fn17">
<p>fig:buck<a href="#fnref17" class="footnote-back"
role="doc-backlink">↩︎</a></p>
</div></li>
<li><div id="fn18">
<p>fig:kodak-hifi<a href="#fnref18" class="footnote-back"
role="doc-backlink">↩︎</a></p>
</div></li>
</ol>
</section>
<h2 id="επαναλληπτική-αξιολόγηση-με-χρήστες">Επαναλληπτική αξιολόγηση με
χρήστες</h2>
<p>Σε αυτό το μέρος θα εξετάσουμε το κρισιμότερο χαρακτηριστικό ενός
διαδραστικού συστήματος, τη χρήση του από την πλευρά του ανθρώπου. Η
κατασκευή της διάδρασης αφορά στη δημιουργία επεμβάσεων σε συχνά
πολύπλοκες καταστάσεις, όπου εμπλέκονται τόσο άνθρωποι όσο και
ετερόκλητες τεχνολογίες, συμπεριλαμβανομένου του λογισμικού για
επιτραπέζιο ΗΥ, του Web, των κινητών, και των διάχυτων συσκευών. Η
πολυπλοκότητα συνήθως σημαίνει ότι κάτι μπορεί να μη γίνει σωστά στην
πρώτη προσπάθεια, αφού η εισαγωγή μιας νέας διάδρασης θα δημιουργήσει
αλλαγές σε ένα ευρύτερο τεχνολογικό και κοινωνικό σύστημα. Συνεπώς,
χρειαζόμαστε επαναληπτικές διαδικασίες και πρωτότυπα για δοκιμή και
αξιολόγηση. Η θεωρία (π.χ., οι δυνατότητες του ανθρώπου και οι ιδιότητες
των συσκευών) και τα μοντέλα από τη βιβλιογραφία (π.χ., κανόνες και
πρότυπα σχεδίασης) μπορούν να βοηθήσουν παρέχοντας ένα καλό σημείο
εκκίνησης, αλλά η σχεδίαση δε θα είναι ολοκληρωμένη αν δε γίνει και
αξιολόγηση, η οποία είναι το αντικείμενο αυτής της ενότητας.</p>
<figure id="fig:nls-floor">
<img src="../images/nls-floor.jpg"
alt="Μετά την εφεύρεση του λογισμικού και του υλικού διάδρασης η ομάδα του NLS ασχολήθηκε με την οργάνωση της εργονομίας και του χώρου εργασίας, έτσι ώστε να διευκολύνεται η επαύξηση της συλογικής νοημοσύνης. Για αυτόν τον σκοπό δοκίμασαν διάφορα είδη θέσης εργασίας όπως το κάθισμα στο πάτωμα, καθώς και ανοιχτούς χώρους εργασίας, όπου οι άνθρωποι συνεργάζονται μεταξύ τους και μέσω της επαύξησης των υπολογιστών." />
<figcaption aria-hidden="true">Μετά την εφεύρεση του λογισμικού και του
υλικού διάδρασης η ομάδα του NLS ασχολήθηκε με την οργάνωση της
εργονομίας και του χώρου εργασίας, έτσι ώστε να διευκολύνεται η επαύξηση
της συλογικής νοημοσύνης. Για αυτόν τον σκοπό δοκίμασαν διάφορα είδη
θέσης εργασίας όπως το κάθισμα στο πάτωμα, καθώς και ανοιχτούς χώρους
εργασίας, όπου οι άνθρωποι συνεργάζονται μεταξύ τους και μέσω της
επαύξησης των υπολογιστών.</figcaption>
</figure>
<figure id="fig:nls-desk">
<img src="../images/nls-desk.jpg"
alt="Η πολύωρη παραμονή σε έναν σταθμό εργασίας έχει αρνητικές επιπτώσεις στον άνθρωπο, που μπορούν να αμβλυνθούν με έναν πιο εργονομικό σχεδιασμό των συσκευών αλλά και του λογισμικού. Το σύστημα NLS βασίζεται σε ειδικά ολοκληρωμένο με τον σταθμό εργασίας κάθισμα, καθώς και σε αποδοτική διάδραση για εκπαιδευμένο χρήστη, οπότε όλες αυτές οι παράμετροι θα πρέπει να αξιολογηθούν συνδυαστικά μαζί με την κατασκευή του λογισμικού διάδρασης." />
<figcaption aria-hidden="true">Η πολύωρη παραμονή σε έναν σταθμό
εργασίας έχει αρνητικές επιπτώσεις στον άνθρωπο, που μπορούν να
αμβλυνθούν με έναν πιο εργονομικό σχεδιασμό των συσκευών αλλά και του
λογισμικού. Το σύστημα NLS βασίζεται σε ειδικά ολοκληρωμένο με τον
σταθμό εργασίας κάθισμα, καθώς και σε αποδοτική διάδραση για
εκπαιδευμένο χρήστη, οπότε όλες αυτές οι παράμετροι θα πρέπει να
αξιολογηθούν συνδυαστικά μαζί με την κατασκευή του λογισμικού
διάδρασης.</figcaption>
</figure>
<p>Το τμήμα αυτό είναι ένα από τα σημαντικότερα από πρακτικής άποψης,
καθώς δίνει συγκεκριμένες κατευθύνσεις για το πώς τελικά αξιολογείται
συστηματικά ένα προϊόν προγραμματισμού της διάδρασης που απευθύνεται σε
ανθρώπους. Το πρώτο και σημαντικότερο βήμα στην αξιολόγηση με χρήστες
-με την προϋπόθεση ότι έχουμε ήδη ένα λειτουργικό πρωτότυπο υψηλής
πιστότητας- είναι η πιλοτική δοκιμή. Επίσης, οι κανόνες σχεδίασης
μπορούν να χρησιμοποιηθούν από ειδικούς, εκτός από τη δημιουργία
πρωτοτύπου, στην αξιολόγηση ενός συστήματος διάδρασης και στη βελτίωσή
του. Ακόμη, υπάρχουν οι πειραματικές και εργαστηριακές μεθοδολογίες
αξιολόγησης διαδραστικών εφαρμογών. Ιδιαίτερο ενδιαφέρον παρουσιάζουν οι
μέθοδοι αξιολόγησης στο πεδίο, καθώς χρησιμοποιούνται ευρύτατα από
ερευνητές και επαγγελματίες του χώρου. Τέλος, σε κάθε περίπτωση
αξιολόγησης, το πιο σημαντικό είναι να συλλέγουμε δεδομένα διαφορετικού
είδους (π.χ., φυσιομετρικά, συμπεριφοράς, απόψεις), καθώς και να
γίνονται επαναληπτικές πιλοτικές αξιολογήσεις με λίγους χρήστες, πριν
προχωρήσουμε στην τελική αξιολόγηση με περισσότερους χρήστες. <a
href="#fn19" id="fnref19" class="footnote-ref"
role="doc-noteref"><sup>19</sup></a> <a href="#fn20" id="fnref20"
class="footnote-ref" role="doc-noteref"><sup>20</sup></a>.</p>
<p>Η αξιολόγηση της διάδρασης με μια μικρή ομάδα χρηστών είναι η πιο
δημοφιλής τεχνική αξιολόγησης. Κατά τη φάση της ανάπτυξης, ακόμη και
πέντε χρήστες είναι αρκετοί για να γίνει μια αξιολόγηση της διάδρασης.
Ειδικά στα πρώτα στάδια της ανάπτυξης, όταν η ομάδα κατασκευής προσπαθεί
να κατανοήσει τις ανάγκες των χρηστών και τους τρόπους που μια νέα
διάδραση επηρεάζει τις δραστηριότητές τους, η έμφαση της αξιολόγησης
βρίσκεται περισσότερο στις ποιοτικές διαστάσεις της, παρά στις
ποσοτικές. Σε αυτές τις περιπτώσεις, ο μικρός αριθμός χρηστών
συνοδεύεται και από περισσότερα ερωτήματα που έχουμε και θέλουμε να
εξερευνήσουμε με τη συμμετοχή τους. Έτσι, η συλλογή των δεδομένων
βασίζεται περισσότερο στην παρατήρηση και τις ημιδομημένες συνεντεύξεις
με τους χρήστες.</p>
<p>Όταν βρισκόμαστε στα τελικά στάδια της ανάπτυξης, ή όταν κάνουμε μόνο
μικρές μετατροπές σε ένα σύστημα διάδρασης που υπάρχει ήδη, τότε είναι
περισσότερο σκόπιμο να χρησιμοποιήσουμε ένα εργαστηριακό πείραμα ή ακόμη
και μια μελέτη στο πεδίο με περισσότερους χρήστες. Σε αυτές τις
περιπτώσεις, εκτός από περισσότερους χρήστες (τουλάχιστον είκοσι), θα
έχουμε και περισσότερο συγκεκριμένα ζητήματα και εναλλακτικές σχεδιάσεις
για τις οποίες θα θέλουμε να εντοπίσουμε με μεγάλη ακρίβεια τις
διαφορές. Αντίστοιχα, για τη συλλογή δεδομένων στην αξιολόγηση με μεγάλο
αριθμό χρηστών ή με μεγάλο αριθμό διαδράσεων, είναι σκόπιμο να έχουμε
περισσότερα είδη δεδομένων. Εκτός από τη βασική παρατήρηση των χρηστών
που εκτελούν διεργασίες με ένα σύστημα διάδρασης μπορούμε να συλλέξουμε
δεδομένα αυτόματα, καταγράφοντας τις λεπτομέρειες των διαδράσεων ή των
βιομετρικών στοιχείων (π.χ., παρακολούθηση της ίριδας του ματιού,
καταγραφή του σφυγμού) σε αρχεία στον υπολογιστή, καθώς και να έχουμε
δομημένα ερωτηματολόγια. <a href="#fn21" id="fnref21"
class="footnote-ref" role="doc-noteref"><sup>21</sup></a> <a
href="#fn22" id="fnref22" class="footnote-ref"
role="doc-noteref"><sup>22</sup></a>.</p>
<figure id="fig:usability-observation">
<img src="../images/usability-observation.png"
alt="Η παρατήρηση της δραστηριότητας του χρήστη κατά τη διάδραση με τον υπολογιστή είναι η πιο δημοφιλής και απλή τεχνική αξιολόγησης μιας νέας εφαρμογής ή συσκευής. Για μια νέα συσκευή εισόδου ο χρήστης εκτελεί τυπικές διεργασίες σε διαθέσιμο λογισμικό ή ακόμη καλύτερα σε ειδικό λογισμικό, το οποίο καταγράφει με λεπτομέρεια τις συμπεριφορές." />
<figcaption aria-hidden="true">Η παρατήρηση της δραστηριότητας του
χρήστη κατά τη διάδραση με τον υπολογιστή είναι η πιο δημοφιλής και απλή
τεχνική αξιολόγησης μιας νέας εφαρμογής ή συσκευής. Για μια νέα συσκευή
εισόδου ο χρήστης εκτελεί τυπικές διεργασίες σε διαθέσιμο λογισμικό ή
ακόμη καλύτερα σε ειδικό λογισμικό, το οποίο καταγράφει με λεπτομέρεια
τις συμπεριφορές.</figcaption>
</figure>
<figure id="fig:mouse-test-software">
<img src="../images/mouse-test-software.png"
alt="Οι σχεδιαστές νέων συσκευών διάδρασης αναπτύσσουν ειδικό λογισμικό προσομοίωσης των βασικών διεργασιών που θέλουν να επιτελεί η νέα συσκευή και το χρησιμοποιούν για να αξιολογήσουν με τη συμμετοχή των χρηστών εναλλακτικές λύσεις. Για το ποντίκι οι δοκιμές με χρήστες αξιολογούν την επιτυχία και τον χρόνο εντοπισμού στόχων και μετακίνησης αντικειμένων και συγκρίνουν διαφορετικές σχεδιάσεις του υλικού και ρυθμίσεις του λογισμικού." />
<figcaption aria-hidden="true">Οι σχεδιαστές νέων συσκευών διάδρασης
αναπτύσσουν ειδικό λογισμικό προσομοίωσης των βασικών διεργασιών που
θέλουν να επιτελεί η νέα συσκευή και το χρησιμοποιούν για να
αξιολογήσουν με τη συμμετοχή των χρηστών εναλλακτικές λύσεις. Για το
ποντίκι οι δοκιμές με χρήστες αξιολογούν την επιτυχία και τον χρόνο
εντοπισμού στόχων και μετακίνησης αντικειμένων και συγκρίνουν
διαφορετικές σχεδιάσεις του υλικού και ρυθμίσεις του
λογισμικού.</figcaption>
</figure>
<p>Υπάρχουν κάποιες περιπτώσεις στην αξιολόγηση της διάδρασης, όπου ο
αριθμός των χρηστών δεν είναι η σημαντικότερη παράμετρος. Για
παράδειγμα, στην αρχική αξιολόγηση της συσκευής εισόδου ‘ποντίκι’ οι
ερευνητές είχαν μόνο πέντε χρήστες και παρά τον μικρό (σχετικά) αριθμό
τους κατέληξαν σε ισχυρά συμπεράσματα αναφορικά με τη συγκριτική απόδοση
των συσκευών εισόδου, που δεν έχουν αλλάξει πολλές δεκαετίες μετά. Αντί
για τον αριθμό των χρηστών, αυτό που έχει σημασία είναι ο αριθμός των
διαδράσεων που θα αναλύσουμε για να καταλήξουμε σε συμπεράσματα. Στην
περίπτωση της αξιολόγησης της συσκευής εισόδου ‘ποντίκι’, οι ερευνητές
έκαναν πολλές προκαταρκτικές δοκιμές με τους χρήστες μέχρι να
διαπιστώσουν ότι η απόδοση τους δεν αλλάζει, και τότε μόνο έκαναν
συλλογή ακόμη περισσότερων διαδράσεων, αρκετών για οδηγηθούν σε ασφαλή
συμπεράσματα. Το συμπέρασμα είναι ότι για τον καθορισμό του αριθμού των
χρηστών θα πρέπει πρώτα να κάνουμε έναν διαχωρισμό: αν μας ενδιαφέρει η
άποψή τους ή μόνο η απόδοσή τους.</p>
<p>Σε αυτήν την ενότητα μελετήσαμε τις μεθόδους της σχεδίασης της
διάδρασης ανθρώπου και υπολογιστή, οι οποίες από μόνες τους δεν μπορούν
να εγγυηθούν την ποιότητα του αποτελέσματος. Ένα σημαντικό συμπέρασμα
που προκύπτει από τα πολλά ιστορικά παραδείγματα είναι ότι μόνο εκ του
αποτελέσματος γίνεται κατανοητό γιατί κάποιες σχεδιάσεις είναι καλύτερες
από άλλες. Ταυτόχρονα, παραμένει πάντα δύσκολο να προβλέψουμε και να
σχεδιάσουμε με σιγουριά εκείνες τις μελλοντικές διαδράσεις ανθρώπων και
υπολογιστών που είναι περισσότερο αποτελεσματικές. Αν και ο στόχος θα
είναι πάντα φευγαλέος, υπάρχουν θεωρίες, τεχνικές, μοτίβα, τεχνολογίες
και μέθοδοι που αργά ή γρήγορα μας δίνουν σταδιακά καλύτερες λύσεις. Σε
κάθε περίπτωση, είναι σκόπιμο να ξέρουμε τι έχουν δοκιμάσει οι
σχεδιαστές της διάδρασης στο παρελθόν και γιατί (α)πέτυχε.</p>
<section id="footnotes" class="footnotes footnotes-end-of-section"
role="doc-endnotes">
<hr />
<ol start="19">
<li><div id="fn19">
<p>fig:nls-floor<a href="#fnref19" class="footnote-back"
role="doc-backlink">↩︎</a></p>
</div></li>
<li><div id="fn20">
<p>fig:nls-desk<a href="#fnref20" class="footnote-back"
role="doc-backlink">↩︎</a></p>
</div></li>
<li><div id="fn21">
<p>fig:usability-observation<a href="#fnref21" class="footnote-back"
role="doc-backlink">↩︎</a></p>
</div></li>
<li><div id="fn22">
<p>fig:mouse-test-software<a href="#fnref22" class="footnote-back"
role="doc-backlink">↩︎</a></p>
</div></li>
</ol>
</section>
<h2 id="η-περίπτωση-της-συσκευής-εισόδου-ποντίκι">Η περίπτωση της
συσκευής εισόδου ποντίκι</h2>
<p>Αν και σήμερα η χρήση της συσκευής εισόδου ‘ποντίκι’ σε συνδυασμό με
τη γραφική επιφάνεια εργασίας και τις αντίστοιχες εφαρμογές γραφείου και
παραγωγικότητας φαίνεται προφανής επιλογή χωρίς εναλλακτικές, αυτό δεν
ήταν αυτονόητο μερικές δεκαετίες πριν. Στις αρχές της δεκαετίας του
1970, οι ερευνητές είχαν στη διάθεσή τους πολλές διαφορετικές συσκευές
εισόδου για τον ίδιο σκοπό, δηλαδή την εργασία με εφαρμογές επεξεργασίας
κειμένου σε έναν επιτραπέζιο υπολογιστή. Αν και η γραφική επιφάνεια
εργασίας δεν ήταν ακόμη διαθέσιμη με την πλήρη μορφή της, η
λειτουργικότητα των εφαρμογών επέτρεπε πολλές από τις διεργασίες που
υποστηρίζει ένας σύγχρονος επιτραπέζιος υπολογιστής, όπως είναι η
επιλογή μιας λέξης ή πρότασης και η αλλαγή ή η μετακίνησή της. Ο αριθμός
των κουμπιών σε ένα ποντίκι δεν είναι από μόνος του ικανός να καθορίσει
την αποτελεσματικότητά του, αν δεν γνωρίζουμε τις ανάγκες και τις
διεργασίες του χρήστη. Έτσι, το ποντίκι με ένα κουμπί είναι ιδιαιτέρως
κατάλληλο για αρχάριους χρήστες, καθώς δεν επιτρέπει το λάθος, αφού
υπάρχει μόνο μία λειτουργία.<a href="#fn23" id="fnref23"
class="footnote-ref" role="doc-noteref"><sup>23</sup></a></p>
<p>Το πρώτο πράγμα που πρέπει να οριστεί με μεγάλη ακρίβεια σε ένα
πείραμα συγκριτικής αξιολόγησης εναλλακτικών συσκευών εισόδου, είναι ο
στόχος και οι αντίστοιχες μετρικές και διεργασίες χρήστη που θα
μπορούσαν να επιβεβαιώσουν τον βαθμό επιτυχίας του στόχου. Στην
περίπτωση των συσκευών εισόδου, για τη διευκόλυνση της επεξεργασίας
κειμένου, βλέπουμε ότι ανάμεσα στις πολλές λειτουργίες που εκτελεί ένας
χρήστης υπάρχουν κάποιες που ξεχωρίζουν, γιατί είναι πολύ συχνές και
πολύ απλές, και αυτές είναι η επιλογή αντικειμένων (target acquisition)
στην οθόνη καθώς και η μετακίνησή τους σε μια άλλη θέση (object
docking). Με δεδομένο ότι η εφαρμογή επεξεργασίας κειμένου εκτελείται σε
ένα περιβάλλον γραφείου με σκοπό την αύξηση της παραγωγικότητας,
μπορούμε να ορίσουμε ως αντιπροσωπευτικές μετρικές τον χρόνο που
χρειάζεται ο χρήστης για να πραγματοποιήσει τις παραπάνω βασικές
διεργασίες, καθώς και τα λάθη που κάνει. Στη συνέχεια, οι ερευνητές
δοκιμάζουν τις εναλλακτικές λύσεις με τους χρήστες, συλλέγουν τα
δεδομένα μέσω παρατήρησης, και κυρίως μέσω των αρχείων διάδρασης του
λογισμικού προσομοίωσης, και δημιουργούν γραφήματα για να τα
συγκρίνουν.</p>
<figure id="fig:apple-mouse">
<img src="../images/apple-mouse.jpg"
alt="Η Apple σκόπιμα έβαλε μόνο ένα κουμπί στο ποντίκι που συνόδευε τον πρώτο δικό της εμπορικά επιτυχημένο επιτραπέζιο υπολογιστή με γραφική επιφάνεια εργασίας. Με αυτόν τον τρόπο, αν και μείωνε τις δυνατότητες της συσκευής εισόδου, την έκανε πιο απλή και μηδένιζε την πιθανότητα να πατήσει λάθος κουμπί ο αρχάριος σε γραφικά περιβάλλοντα χρήστης." />
<figcaption aria-hidden="true">Η Apple σκόπιμα έβαλε μόνο ένα κουμπί στο
ποντίκι που συνόδευε τον πρώτο δικό της εμπορικά επιτυχημένο επιτραπέζιο
υπολογιστή με γραφική επιφάνεια εργασίας. Με αυτόν τον τρόπο, αν και
μείωνε τις δυνατότητες της συσκευής εισόδου, την έκανε πιο απλή και
μηδένιζε την πιθανότητα να πατήσει λάθος κουμπί ο αρχάριος σε γραφικά
περιβάλλοντα χρήστης.</figcaption>
</figure>
<figure id="fig:input-comparison">
<img src="../images/input-comparison.png"
alt="Η συσκευή εισόδου ‘ποντίκι’ αρχικά δεν είχε κάποιο προφανές πλεονέκτημα σε σχέση με παρόμοιες συσκευές εισόδου όπως ο μοχλός και τα πλήκτρα κατεύθυνσης που ήταν ήδη διαθέσιμα στην αγορά και οικεία στους χρήστες. Έπρεπε να γίνουν συγκριτικές δοκιμές απόδοσης για να διαπιστωθεί ποια ήταν τελικά περισσότερο κατάλληλη για την επιλογή κειμένου στην οθόνη, που ήταν η βασική ανάγκη τότε." />
<figcaption aria-hidden="true">Η συσκευή εισόδου ‘ποντίκι’ αρχικά δεν
είχε κάποιο προφανές πλεονέκτημα σε σχέση με παρόμοιες συσκευές εισόδου
όπως ο μοχλός και τα πλήκτρα κατεύθυνσης που ήταν ήδη διαθέσιμα στην
αγορά και οικεία στους χρήστες. Έπρεπε να γίνουν συγκριτικές δοκιμές
απόδοσης για να διαπιστωθεί ποια ήταν τελικά περισσότερο κατάλληλη για
την επιλογή κειμένου στην οθόνη, που ήταν η βασική ανάγκη
τότε.</figcaption>
</figure>
<p>Από την πλευρά της πειραματικής μεθοδολογίας, αυτό που κάνει τη
μελέτη των συσκευών εισόδου ιδιαίτερα ενδιαφέρουσα είναι η επιλογή των
χρηστών και ειδικά ο αριθμός τους. Οι ερευνητές διάλεξαν ως χρήστες τις
γραμματείς που εργάζονταν στο εργαστήριό τους και δικαιολόγησαν την
επιλογή τους με δεδομένο ότι οι διεργασίες που τους έδωσαν, όπως η
επεξεργασία κειμένου, είχαν να κάνουν με δουλειά γραφείου, επομένως ήταν
εντός του πλαισίου εργασίας τους. Η εύκολη πρόσβαση στους χρήστες είναι
σίγουρα μια σημαντική παράμετρος, ειδικά όταν έχουμε να κατασκευάσουμε
επαναληπτικά μια νέα διάδραση, αλλά αυτό που έχει τη μεγαλύτερη σημασία
είναι ο καθορισμός του πλήθους των χρηστών. Για αυτήν την παράμετρο, οι
ερευνητές της συσκευής εισόδου ‘ποντίκι’ διάλεξαν μόνο πέντε χρήστες. Αν
και σε πρώτη ανάγνωση ο αριθμός φαίνεται μικρός για οποιαδήποτε
στατιστική ανάλυση, με μια προσεκτικότερη ματιά διαπιστώνουμε ότι το
αντικείμενο ανάλυσης δεν ήταν οι πέντε χρήστες, αλλά οι διεργασίες που
έκαναν με τις εναλλακτικές συσκευές εισόδου. Οι διεργασίες που έπρεπε να
εκτελεστούν από τους πέντε χρήστες του πειράματος ήταν εκατοντάδες και
πάνω σε αυτά τα δεδομένα οι ερευνητές αιτιολόγησαν τα συμπεράσματά
τους.</p>
<p>Τα αποτελέσματα της συγκριτικής μελέτης των εναλλακτικών συσκευών
εισόδου (έμμεσης διάδρασης) για τη μετακίνηση του δείκτη στην οθόνη<a
href="#fn24" id="fnref24" class="footnote-ref"
role="doc-noteref"><sup>24</sup></a> έδειξαν πολλά περισσότερα από το
γεγονός ότι το ποντίκι ήταν η πιο γρήγορη, ακριβής και εργονομική
συσκευή για πολύωρη χρήση.<a href="#fn25" id="fnref25"
class="footnote-ref" role="doc-noteref"><sup>25</sup></a> Ανάλογα με τον
κάθε χρήστη, οι ερευνητές διαπίστωσαν ότι από τη στιγμή που μπορεί να
θεωρηθεί έμπειρος -πράγμα που πετύχαιναν με τις πολλές επαναλήψεις των
τυπικών διεργασιών- η απόδοση της συσκευής εισόδου ‘ποντίκι’ σχετιζόταν
με τις δυνατότητες του χρήστη να συντονίζει το χέρι με την όρασή του.
Αυτή η διαπίστωση είναι πολύ σημαντική, καθώς καθορίζει ότι υπάρχει ένα
άνω φράγμα στις επιδόσεις που μπορούμε να πετύχουμε με τη συσκευή
εισόδου ‘ποντίκι’, το οποίο δεν εξαρτάται τόσο από τις επιμέρους
ιδιότητες της συσκευής εισόδου, αλλά από τις ιδιότητες του ανθρώπινου
καναλιού επικοινωνίας που συνδέει το χέρι με τον εγκέφαλο και τα μάτια.
Η πληροφορία αυτή είναι πολύ σημαντική, επειδή όταν γνωρίζουμε τα
ανθρώπινα όρια και τις ιδιότητες μιας νέας συσκευής εισόδου μπορούμε να
αξιολογήσουμε νέες συσκευές εισόδου με στρατηγικό τρόπο.<a href="#fn26"
id="fnref26" class="footnote-ref" role="doc-noteref"><sup>26</sup></a>
Στην πράξη βέβαια, οι παραπάνω γνώσεις έχουν φανεί περισσότερο χρήσιμες
όταν έχουμε ήδη έτοιμες κάποιες συσκευές εισόδου, παρά όταν προσπαθούμε
να σχεδιάσουμε κάποια εντελώς νέα, όπως στην περίπτωση του iPod click
wheel.</p>
<section id="footnotes" class="footnotes footnotes-end-of-section"
role="doc-endnotes">
<hr />
<ol start="23">
<li><div id="fn23">
<p>fig:apple-mouse<a href="#fnref23" class="footnote-back"
role="doc-backlink">↩︎</a></p>
</div></li>
<li><div id="fn24">
<p><span class="citation" data-cites="card1978evaluation">Card, English,
και Burr (1978)</span><a href="#fnref24" class="footnote-back"
role="doc-backlink">↩︎</a></p>
</div></li>
<li><div id="fn25">
<p>fig:input-comparison<a href="#fnref25" class="footnote-back"
role="doc-backlink">↩︎</a></p>
</div></li>
<li><div id="fn26">
<p><span class="citation" data-cites="card2018psychology">Card, Moran,
και Newell (2018)</span><a href="#fnref26" class="footnote-back"
role="doc-backlink">↩︎</a></p>
</div></li>
</ol>
</section>
<h2 id="η-περίπτωση-των-microsoft-windows">Η περίπτωση των Microsoft
Windows</h2>
<p>Η επιφάνεια εργασίας του επιτραπέζιου υπολογιστή είναι ένα δημοφιλές
και ευέλικτο σύστημα που πέρασε από πολλούς κύκλους ανάπτυξης και
προσαρμογής, τόσο κατά τα πρώτα στάδια δημιουργίας του όσο και κατά τη
διάδοσή του. Η επιφάνεια εργασίας είναι μια πολύ ενδιαφέρουσα μελέτη
περίπτωσης γιατί η εξέλιξή της ήταν σχετικά αργή, σε ένα διάστημα
περισσότερων από σαράντα χρόνων. Σίγουρα η επιφάνεια εργασίας δεν έγινε
τόσο δημοφιλής -ούτε χρονικά ούτε σε κλίμακα- όσο η διεπαφή και η
διάδραση με τον κινητό υπολογισμό. Από την άλλη πλευρά όμως, ο σταδιακός
και διαχρονικός μετασχηματισμός της επιφάνειας εργασίας παρουσιάζει
ενδιαφέρουσες διακυμάνσεις και ομοιότητες ανάμεσα σε ανταγωνιστικά
εμπορικά προϊόντα, τα οποία μπορούν να μας δώσουν πολλά μαθήματα σχετικά
με τον κύκλο της ανθρωποκεντρικής σχεδίασης.</p>
<figure id="fig:windows95">
<img src="../images/windows95.jpg"
alt="Τα Windows95 ήταν μια πολύ επιτυχημένη προσπάθεια που βασίστηκε στην ευρύτατη προβολή, στην οικονομική τιμή, στην ευελιξία εγκατάστασης σε διαφορετικό υλικό αλλά και στην εύκολη ενσωμάτωση υλικού από άλλους κατασκευαστές. Ήταν η πρώτη έκδοση με το κουμπί εκκίνησης και ένα πλήρες παραθυρικό περιβάλλον το οποίο περιλάμβανε και την μπάρα ανοικτών εφαρμογών." />
<figcaption aria-hidden="true">Τα Windows95 ήταν μια πολύ επιτυχημένη
προσπάθεια που βασίστηκε στην ευρύτατη προβολή, στην οικονομική τιμή,
στην ευελιξία εγκατάστασης σε διαφορετικό υλικό αλλά και στην εύκολη
ενσωμάτωση υλικού από άλλους κατασκευαστές. Ήταν η πρώτη έκδοση με το
κουμπί εκκίνησης και ένα πλήρες παραθυρικό περιβάλλον το οποίο
περιλάμβανε και την μπάρα ανοικτών εφαρμογών.</figcaption>
</figure>
<figure id="fig:windows8">
<img src="../images/windows8.png"
alt="Τα Windows8 προσφέρουν μια διεπαφή με τον χρήστη που εμφανισιακά και λειτουργικά είναι δανεισμένη από τις κινητές συσκευές, αφού έχουμε μεγάλα ζωντανά εικονίδια και χειρονομίες, δηλαδή έχουμε μοτίβα διάδρασης που συναντάμε περισσότερο στον κινητό παρά στον επιτραπέζιο υπολογισμό, αφού ο στόχος είναι να δημιουργηθεί μια ενιαία εμπειρία χρήσης ανάμεσα σε πολλές συσκευές διάδρασης. Επιπλέον, για πρώτη φορά από τα Windows 95, δεν έχουν το κουμπί Start." />
<figcaption aria-hidden="true">Τα Windows8 προσφέρουν μια διεπαφή με τον
χρήστη που εμφανισιακά και λειτουργικά είναι δανεισμένη από τις κινητές
συσκευές, αφού έχουμε μεγάλα ζωντανά εικονίδια και χειρονομίες, δηλαδή
έχουμε μοτίβα διάδρασης που συναντάμε περισσότερο στον κινητό παρά στον
επιτραπέζιο υπολογισμό, αφού ο στόχος είναι να δημιουργηθεί μια ενιαία
εμπειρία χρήσης ανάμεσα σε πολλές συσκευές διάδρασης. Επιπλέον, για
πρώτη φορά από τα Windows 95, δεν έχουν το κουμπί Start.</figcaption>
</figure>
<p>Τα Microsoft Windows είναι σίγουρα το πιο δημοφιλές λειτουργικό
σύστημα με επιφάνεια εργασίας για επιτραπέζιους υπολογιστές και
παρουσιάζει ιδιαίτερο ενδιαφέρον ως μελέτη περίπτωσης γιατί η εξέλιξή
του ήταν σταδιακή, πράγμα που μας επιτρέπει να βλέπουμε πιο καθαρά τα
επιμέρους στάδια και να τα ερμηνεύουμε, αφού πρώτα τα συνδέσουμε με
άλλες σχετικές εξελίξεις. Επειδή η αποδοχή του βασικού λειτουργικού
συστήματος Microsoft Disk Operating System (MSDOS) ήταν πολύ μεγάλη, η
πρώτη έκδοση του γραφικού περιβάλλοντος ήταν βασισμένη σε αυτό και δεν
είχε πολλές από τις βασικές λειτουργίες της διάδρασης με τη γραφική
επιφάνεια εργασίας που είχαν ήδη εμφανιστεί σε αντίστοιχα προϊόντα από
τον ανταγωνισμό, όπως ήταν το MacOS. Βλέπουμε πως ο κατασκευαστής της
διάδρασης σε ορισμένες περιπτώσεις μπορεί να αγνοήσει εφικτές και
χρήσιμες δυνατότητες της διάδρασης, προκειμένου να δώσει βάρος σε παλιές
εφαρμογές, απλά και μόνο επειδή οι χρήστες τις έχουν συνηθίσει ή επειδή
οι αντίστοιχοι κατασκευαστές εκείνων των εφαρμογών δεν είναι έτοιμοι να
περάσουν στην επόμενη φάση. Με άλλα λόγια, βλέπουμε για μια ακόμη φορά
ότι ο τεχνολογικός ντετερμινισμός δεν είναι αρκετός για να σπρώξει
μπροστά την ανάπτυξη, αφού υπάρχει και ο ανθρώπινος και ο κοινωνικός
παράγοντας που είναι εξίσου σημαντικοί.</p>
<p>Στα μέσα της δεκαετίας του 1990 οι τεχνολογικές συνθήκες έχουν
ωριμάσει τόσο, ώστε μια μεγάλη μερίδα από τους χρήστες λειτουργικών
συστημάτων να έχει αποκτήσει ή να έχει πρόσβαση σε γρηγορότερους
επεξεργαστές και σε ξεχωριστές κάρτες γραφικών. Ταυτόχρονα, η αγορά των
οικιακών υπολογιστών έχει διευρυνθεί αρκετά και καλύπτει πολλές
επιμέρους ανθρώπινες δραστηριότητες. Οπότε, οι κατασκευαστές υλικού
έχουν αρχίσει να διαθέτουν εξειδικευμένο εξοπλισμό που συνδέεται με τον
υπολογιστή για να διευκολύνει τις διεργασίες των χρηστών, όπως μουσική,
παιχνίδια, σχεδίαση, κτλ. Το παραπάνω πλαίσιο δημιουργεί τις ιδανικές
συνθήκες για την εισαγωγή των Windows95,<a href="#fn27" id="fnref27"
class="footnote-ref" role="doc-noteref"><sup>27</sup></a> τα οποία έχουν
πλέον μια πλήρη γραφική επιφάνεια εργασίας και υποστηρίζουν την εύκολη
προσθήκη νέων προγραμμάτων και επιπλέον υλικού. Η αποδοχή των Windows95
από την αγορά μπορεί να συγκριθεί μόνο με αυτή των WindowsXP σχεδόν δέκα
χρόνια μετά, ενώ η μεγάλη ομοιότητά τους, τόσο με το αρχικό Macintosh
OS, όσο και με το Xerox Star, αποτελεί την απόδειξη ότι από μόνη της η
ποιότητα της διάδρασης δεν είναι αρκετή για να καθορίσει την τύχη ενός
προϊόντος στην ευρύτερη αγορά, αλλά απαιτείται και μια καλύτερη
κατανόηση των αναγκών των επιμέρους ομάδων χρηστών. Βλέπουμε ότι ο
προγραμματισμός της διάδρασης δεν βασίζεται μόνο στη σωστή κατασκευή της
διάδρασης αλλά και στη σωστή κατανόηση των αναγκών των χρηστών.</p>
<p>Όπως είδαμε στα παραπάνω, η κατανόηση και η προσαρμογή στις ανάγκες
των χρηστών είναι σημαντική συνθήκη για την επιτυχία της διάδρασης,
αρκεί βέβαια η διάδραση να είναι εξίσου καλά προσαρμοσμένη στη συσκευή
του χρήστη. Αν και η Microsoft διατηρεί το προβάδισμα στα λειτουργικά
συστήματα του επιτραπέζιου υπολογιστή, η δεκαετία του 2010 τη βρίσκει να
έχει μείνει πίσω στη ραγδαία αναπτυσσόμενη αγορά του κινητού
υπολογισμού, ο οποίος εκτός από τα έξυπνα κινητά τηλέφωνα περιλαμβάνει
και τις ταμπλέτες, που σταδιακά αντικαθιστούν πολλές από τις διεργασίες
του επιτραπέζιου υπολογιστή. Σε μια προσπάθεια να δώσει προτεραιότητα
στις κινητές συσκευές, η Microsoft εισάγει τα Windows8<a href="#fn28"
id="fnref28" class="footnote-ref" role="doc-noteref"><sup>28</sup></a>
με αρχική οθόνη διάδρασης αντίστοιχη με εκείνη που έχει στις κινητές
συσκευές της. Αν και η επιλογή αυτή δημιουργεί μια πραγματικά ομοιόμορφη
και συνεπή εμπειρία για τους χρήστες που κινούνται ανάμεσα σε πολλούς
υπολογιστές (κινητούς και επιτραπέζιους), ταυτόχρονα απέχει από το να
είναι η βέλτιστη για τον επιτραπέζιο υπολογιστή, με αποτέλεσμα να
μειώνει την ευχρηστία του. Βλέπουμε λοιπόν, ότι ναι μεν η εστίαση στον
χρήστη έχει προτεραιότητα, αλλά και η κατανόηση της φόρμας του
υπολογιστή δεν πρέπει να αγνοείται. Επομένως, ο σωστός προγραμματισμός
της διάδρασης μπορεί να γίνει κατανοητός ως μια λεπτή ισορροπία ανάμεσα
στις ιδιότητες της συσκευής και στις ανάγκες του χρήστη, ισορροπία που
μπορεί να γίνει εύθραυστη όταν έχουμε πολλούς διαφορετικούς χρήστες, και
πολλά διαφορετικά είδη συσκευής χρήστη.</p>
<section id="footnotes" class="footnotes footnotes-end-of-section"
role="doc-endnotes">
<hr />
<ol start="27">
<li><div id="fn27">
<p>fig:windows95<a href="#fnref27" class="footnote-back"
role="doc-backlink">↩︎</a></p>
</div></li>
<li><div id="fn28">
<p>fig:windows8<a href="#fnref28" class="footnote-back"
role="doc-backlink">↩︎</a></p>
</div></li>
</ol>
</section>
<h2 id="σύντομη-βιογραφία-του-douglas-engelbart">Σύντομη βιογραφία του
Douglas Engelbart</h2>
<p>O Douglas Engelbart έγινε διάσημος για την συσκευή εισόδου ποντίκι,<a
href="#fn29" id="fnref29" class="footnote-ref"
role="doc-noteref"><sup>29</sup></a> αλλά αυτό θεωρείται μόνο μια μικρή
παράπλευρη εφεύρεση σε σχέση με το σύνολο της συνεισφοράς του στην
περιοχή της κατασκευής της διάδρασης. Το όραμα του περιγράφεται
αναλυτικά στην πρόταση χρηματοδότησης του έργου του, το οποίο οδήγησε σε
μια διαδραστική παρουσίαση που έμεινε γνωστή ως η μητέρα όλων των
επιδείξεων. Εκτός από το ποντίκι, εκείνη η παρουσίαση περιελάμβανε
τεχνολογίες υπερκειμένου και τηλεδιάσκεψης.</p>
<figure id="fig:engelbart-profile">
<img src="../images/engelbart-profile.jpg"
alt="Το έργο του Douglas Engelbart θεμελίωσε την συνεργατική και διαδραστική χρήση των πληροφοριακών συστήματων, αλλά το όραμα για την επαύξηση της ανθρώπινης νοημοσύνης με πολύπλοκα συστήματα διάδρασης αντικαταστάθηκε από την βολικότητα της καθημερινής ευχρηστίας." />
<figcaption aria-hidden="true">Το έργο του Douglas Engelbart θεμελίωσε
την συνεργατική και διαδραστική χρήση των πληροφοριακών συστήματων, αλλά
το όραμα για την επαύξηση της ανθρώπινης νοημοσύνης με πολύπλοκα
συστήματα διάδρασης αντικαταστάθηκε από την βολικότητα της καθημερινής
ευχρηστίας.</figcaption>
</figure>
<figure id="fig:nls-group">
<img src="../images/nls-group.jpg"
alt="Το σύστημα NLS περιέχει μια σειρά από διαχρονικές τεχνολογίες, όπως το υπερκείμενο, διάδραση με το ποντίκι, και τηλεδιάσκεψη, οι οποίες δεν υλοποιήθηκαν απλά ως μια τεχνολογική παρουσίαση, αλλά γιατί ο συνδυασμός τους εξυπηρετεί τον μεγαλύτερο στόχο της συνεργασίας των ανθρώπων ώστε να κατανοήσουν πολύπλοκα προβλήματα." />
<figcaption aria-hidden="true">Το σύστημα NLS περιέχει μια σειρά από
διαχρονικές τεχνολογίες, όπως το υπερκείμενο, διάδραση με το ποντίκι,
και τηλεδιάσκεψη, οι οποίες δεν υλοποιήθηκαν απλά ως μια τεχνολογική
παρουσίαση, αλλά γιατί ο συνδυασμός τους εξυπηρετεί τον μεγαλύτερο στόχο
της συνεργασίας των ανθρώπων ώστε να κατανοήσουν πολύπλοκα
προβλήματα.</figcaption>
</figure>
<p>Η βασική συνεισφορά του όμως δεν ήταν τόσο στις σχετικά πρωτοποριακές
τεχνολογίες που παρουσίασε συγκετρωτικά το 1968 και αμέσως μετά έδωσε
στην ερευνητική κοινότητα, αλλά στο όραμα του για την επαύξηση της
ανθρώπινης νοημοσύνης. Την δεκαετία του 1960, όπως και σε άλλες
δεκαετίες αργότερα, το κυρίαρχο θέμα δραστηριότητας στην τεχνολογία ήταν
αυτό της τεχνητής νοημοσύνης, όπου ο ανθρώπινος παράγοντας απουσιάζει
και οι εργασίες γίνονται αυτόματα από μια φαινομενικά έξυπνη μηχανή, η
οποία έχει προγραμματιστεί ή εκπαιδευτεί ώστε να κάνει τις ενέργειες των
ανθρώπων.</p>
<p>Αντίθετα με το όραμα της τεχνητής νοημοσύνης που βάζει σε δεύτερο
ρόλο τον άνθρωπο, το όραμα της επαυξημένης νοημοσύνης έχει σαν
πρωταγωνιστή τον άνθρωπο, ο οποίος σε συνεργασία με άλλους<a
href="#fn30" id="fnref30" class="footnote-ref"
role="doc-noteref"><sup>30</sup></a> οδηγεί συνειδητά την μηχανή σε μια
καλύτερη κατανόηση πολύπλοκων φαινομένων καθώς και σε καλύτερες
συλλογικές αποφάσεις. Δεν είναι τυχαίο πως αυτό το έργο δημιουργήθηκε
την δεκαετία του 1960 στις δυτικές ακτές των ΗΠΑ, όπου υπήρχαν πολιτικές
και πολιτισμικές ζυμώσεις για έναν καλύτερο και διαφορετικό κόσμο.</p>
<p>Για τον σκοπό αυτό, οι χρήστες του συστήματος μέσα από μια εκπαίδευση
γνώσεων και δεξιοτήτων μπορούσαν να έχουν εναλλακτικές απόψεις πάνω στα
δεδομένα τους. Για παράδειγμα, εκτός από το ποντίκι υπήρχε και μια
συσκευή ακόρντων, η οποία άλλαζε την τροπικότητα της διεπαφής στην
οθόνη. Αν και στην πορεία η ουσία του έργου του χάθηκε για τους πολλούς,
επηρέασε άλλους σημαντικούς ερευνητές όπως ο Alan Kay και ο Ted Nelson,
οι οποίοι συνέχισαν το έργο του στις περιοχές της δεξιοτεχνικής
διάδρασης και του υπερκειμένου, χωρίς όμως ούτε αυτοί να έχουν κάποιο
σημαντικό εμπορικό αποτύπωμα μέχρι σήμερα.</p>
<section id="footnotes" class="footnotes footnotes-end-of-section"
role="doc-endnotes">
<hr />
<ol start="29">
<li><div id="fn29">
<p>fig:engelbart-profile<a href="#fnref29" class="footnote-back"
role="doc-backlink">↩︎</a></p>
</div></li>
<li><div id="fn30">
<p>fig:nls-group<a href="#fnref30" class="footnote-back"
role="doc-backlink">↩︎</a></p>
</div></li>
</ol>
</section>
<h2 class="unnumbered" id="βιβλιογραφία">Βιβλιογραφία</h2>
<div id="refs" class="references csl-bib-body hanging-indent"
role="list">
<div id="ref-buxton2010sketching" class="csl-entry" role="listitem">
Buxton, Bill. 2010. <em>Sketching user experiences: getting the design
right and the right design</em>. Morgan kaufmann.
</div>
<div id="ref-card1978evaluation" class="csl-entry" role="listitem">
Card, Stuart K, William K English, και Betty J Burr. 1978.
<span>‘Evaluation of mouse, rate-controlled isometric joystick, step
keys, and text keys for text selection on a CRT’</span>.
<em>Ergonomics</em> 21 (8): 601–13.
</div>
<div id="ref-card2018psychology" class="csl-entry" role="listitem">
Card, Stuart K, Thomas P Moran, και Allen Newell. 2018. <em>The
psychology of human-computer interaction</em>. Crc Press.
</div>
<div id="ref-carroll2000making" class="csl-entry" role="listitem">
Carroll, John M. 2000. <em>Making use: scenario-based design of
human-computer interactions</em>. MIT press.
</div>
<div id="ref-moggridge2007designing" class="csl-entry" role="listitem">
Moggridge, Bill. 2007. <em>Designing interactions</em>. MIT press
Cambridge, MA.
</div>
<div id="ref-norman2013design" class="csl-entry" role="listitem">
Norman, Don. 2013. <em>The design of everyday things: Revised and
expanded edition</em>. Basic books.
</div>
<div id="ref-papanek1972design" class="csl-entry" role="listitem">
Papanek, Victor, και R Buckminster Fuller. 1972. <em>Design for the real
world</em>. Thames; Hudson London.
</div>
<div id="ref-pering2002interaction" class="csl-entry" role="listitem">
Pering, Celine. 2002. <span>‘Interaction design prototyping of
communicator devices: Towards meeting the hardware-software
challenge’</span>. <em>interactions</em> 9 (6): 36–46.
</div>
<div id="ref-thackara2006bubble" class="csl-entry" role="listitem">
Thackara, John. 2006. <em>In the bubble: designing in a complex
world</em>. MIT press.
</div>
<div id="ref-winograd1996bringing" class="csl-entry" role="listitem">
Winograd, Terry κ.ά. 1996. <em>Bringing design to software</em>. <span
class="math inline">{</span>Addison-Wesley Professional<span
class="math inline">}</span>.
</div>
</div>
<h1 id="αρχέτυπα">Αρχέτυπα</h1>
<blockquote>
<p>O Leonardo da Vinci δεν μπορούσε να εφεύρει ούτε έναν κινητήρα για
κάποιο από τα οχήματά του. Μπορεί να ήταν ο εξυπνότερος άνθρωπος στην
εποχή του, αλλά γεννήθηκε στη λάθος εποχή. Η εξυπνάδα του δεν μπορούσε
να υπερβεί την εποχή του. Alan Kay</p>
</blockquote>
<h3 id="περίληψη">Περίληψη</h3>
<p>Σε αυτό το κεφάλαιο μελετάμε τις ιδιότητες του υπολογιστή που
επιτρέπουν τη διάδραση με τον άνθρωπο. Εδώ εστιάζουμε την προσοχή μας
στις ιδιότητες του υπολογιστή και ειδικά στα συστήματα εισόδου και
εξόδου. Θα μελετήσουμε τα παραδοσιακά συστήματα εισόδου και εξόδου, όπως
είναι το πληκτρολόγιο και το ποντίκι, καθώς και τα κινητά και διάχυτα
συστήματα εισόδου και εξόδου, που έχουν πολύ περισσότερες σε αριθμό και
είδος συσκευές διάδρασης με τον χρήστη, όπως τον εντοπισμό γεωγραφικής
θέσης, την αφή, την κάμερα, κτλ.</p>
<h2 id="δομικά-στοιχεία">Δομικά στοιχεία</h2>
<p>Οι περισσότεροι είμαστε πολύ καλοί ή ακόμη και άριστοι χρήστες του
επιτραπέζιου ΗΥ. Η κατεύθυνση του κινητού και του διάχυτου υπολογισμού
αποτελεί μια πρόκληση για όλους τους χρήστες αλλά και για τους
προγραμματιστές επιτραπέζιων ΗΥ, επειδή τα οικεία συστήματα
εισόδου/εξόδου αλλάζουν δραστικά προς την κατεύθυνση της φυσικής
διάδρασης (π.χ., αφή, φυσική γλώσσα, αναγνώριση εικόνας).<a href="#fn1"
id="fnref1" class="footnote-ref" role="doc-noteref"><sup>1</sup></a>
Επιπλέον, ο κινητός και διάχυτος υπολογισμός σε κάποιες περιπτώσεις δεν
έχει όλους του υπολογιστικούς πόρους (π.χ., επεξεργαστή, μνήμη,
αποθήκευση) στα οποία έχουμε συνηθίσει από τους μοντέρνους ΗΥ
γραφείου.</p>
<p>Ένα μεγάλο μέρος της προόδου στα πρώτα βήματα της διάδρασης έγινε
στις συσκευές εξόδου, όπως είναι η οθόνη και ο τρόπος που απεικονίζεται
η πληροφορία πάνω σε αυτή. Από την πλευρά των συσκευών εισόδου, εκτός
από το κλασικό πληκτρολόγιο, η μεγαλύτερη επιτυχία ήταν το ποντίκι, το
οποίο ανήκει στην ομάδα των συσκευών έμμεσης εισόδου. Με βάση τις
δυνατότητες που έχουν οι αρχικά διαθέσιμες συσκευές εισόδου, εξόδου και
επεξεργασίας δεδομένων, μια σειρά από μορφές διάδρασης έγιναν διαθέσιμες
και αποδεκτές από τους χρήστες: 1) γραμμή εντολών, 2) μενού και φόρμες,
3) φυσική γλώσσα, 4) απευθείας χειρισμός, 5) επαυξημένη και εικονική
πραγματικότητα.</p>
<p>Τα πρώτα βήματα της διάδρασης έγιναν στον χώρο της εργασίας και
ειδικά στις εκδόσεις έντυπου υλικού, και όπως ήταν επόμενο, ένα μεγάλο
μέρος από αυτό που αργότερα έγινε γνωστό ως επιτραπέζιο γραφικό
περιβάλλον εργασίας βασίζεται στις αντίστοιχες ανάγκες.<a href="#fn2"
id="fnref2" class="footnote-ref" role="doc-noteref"><sup>2</sup></a> Το
πληκτρολόγιο ήταν απαραίτητο για την εισαγωγή και την επεξεργασία του
κειμένου, ενώ το καινοτόμο ποντίκι επέτρεψε την εύκολη πλοήγηση ανάμεσα
σε πολλές επιλογές επεξεργασίας του εγγράφου, που αλλιώς θα έπρεπε να
απομνημονεύσει ο χρήστης.</p>
<p>Τα ιστορικά παραδείγματα διάδρασης με συσκευές χρήστη έχουν, σε
ορισμένες περιπτώσεις, κάποιες επικαλύψεις (χρονικές ή στα
χαρακτηριστικά τους), όμως είναι όσο γίνεται περισσότερο ανεξάρτητα. Από
τη μία πλευρά, η χρονολογική επισκόπηση είναι μια ενδιαφέρουσα ιστορική
αναδρομή στην τεχνολογική εξέλιξη με έμφαση στη διάδραση, αλλά
ταυτόχρονα είναι και μια εργαλειοθήκη για τον μελλοντικό σχεδιαστή της
διάδρασης. Εστιάζουμε ειδικότερα στην εξέλιξη των διαδραστικών
συστημάτων και στο πώς έχουν αυξήσει τη χρησιμότητα και την ευχρηστία
των υπολογιστών.</p>
<figure id="fig:sage-radar">
<img src="../images/sage-radar.jpg"
alt="Ο μετασχηματισμός της διάδρασης από τον τηλέτυπο προς την γραφική διεπαφή στις αρχές της δεκαετίας του 1960 φαντάζει ως μια πολύ σημαντική αλλαγή παραδείγματος. Στην πράξη όμως μπορούμε να διαγνώσουμε την έμπνευση των σχεδιαστών των Sketchpad, Spacewar, στο οικείο για αυτούς σύστημα SAGE, το οποίο χρησιμοποιούσε γραφικά για την απεικόνιση και ταυτοποίηση ιπτάμενων αντικειμένων πάνω σε μια οθόνη ραντάρ." />
<figcaption aria-hidden="true">Ο μετασχηματισμός της διάδρασης από τον
τηλέτυπο προς την γραφική διεπαφή στις αρχές της δεκαετίας του 1960
φαντάζει ως μια πολύ σημαντική αλλαγή παραδείγματος. Στην πράξη όμως
μπορούμε να διαγνώσουμε την έμπνευση των σχεδιαστών των Sketchpad,
Spacewar, στο οικείο για αυτούς σύστημα SAGE, το οποίο χρησιμοποιούσε
γραφικά για την απεικόνιση και ταυτοποίηση ιπτάμενων αντικειμένων πάνω
σε μια οθόνη ραντάρ.</figcaption>
</figure>
<figure id="fig:spacewar-players">
<img src="../images/spacewar-players.jpg"
alt="Ενα από τα πρώτα δημοφιλή βιντεοπαιχνίδια δημιουργήθηκε το 1962 και παιζόταν από δύο παίκτες γιατί ο δυνατός για την εποχή υπολογιστής δεν είχε αρκετή ισχύ για τον αυτόματο έλεγχο του αντιπάλου, αφού οι πόροι είχαν χρησιμοποιηθεί για τα γραφικά, την φυσική κίνηση και τον έλεγχο της σύγκρουσης. Το παιχνίδι αυτό αν και δημιουργήθηκε σε ερευνητικό περιβάλλον για επίδειξη, έγινε σημείο αναφοράς και αντιγραφής από πολλούς προγραμματιστές και επηρέασε τα παιχνίδια της επόμενης δεκαετίας που δημιούργησαν την βιομηχανία των βιντεοπαιχνιδιών." />
<figcaption aria-hidden="true">Ενα από τα πρώτα δημοφιλή βιντεοπαιχνίδια
δημιουργήθηκε το 1962 και παιζόταν από δύο παίκτες γιατί ο δυνατός για
την εποχή υπολογιστής δεν είχε αρκετή ισχύ για τον αυτόματο έλεγχο του
αντιπάλου, αφού οι πόροι είχαν χρησιμοποιηθεί για τα γραφικά, την φυσική
κίνηση και τον έλεγχο της σύγκρουσης. Το παιχνίδι αυτό αν και
δημιουργήθηκε σε ερευνητικό περιβάλλον για επίδειξη, έγινε σημείο
αναφοράς και αντιγραφής από πολλούς προγραμματιστές και επηρέασε τα
παιχνίδια της επόμενης δεκαετίας που δημιούργησαν την βιομηχανία των
βιντεοπαιχνιδιών.</figcaption>
</figure>
<p>Με το ίδιο σκεπτικό, οι κατασκευαστές των πρώτων συστημάτων διάδρασης
χρησιμοποίησαν συσκευές εισόδου και εξόδου με τον χρήστη, τις οποίες
είχαν ήδη διαθέσιμες από σχετικές τεχνολογίες. <a href="#fn3"
id="fnref3" class="footnote-ref" role="doc-noteref"><sup>3</sup></a> <a
href="#fn4" id="fnref4" class="footnote-ref"
role="doc-noteref"><sup>4</sup></a> Πράγματι, ο τηλέτυπος ήταν επίσης
μια τεχνολογία με σχεδόν έναν αιώνα λειτουργίας, επομένως ήταν
διαθέσιμος και αξιόπιστος. Στα πρώτα στάδια, ο τηλέτυπος επέτρεψε στον
χρήστη να πληκτρολογήσει το πρόγραμμα και να βλέπει τι ακριβώς έγραψε
στο χαρτί. Καθώς οι υπολογιστές έγιναν περισσότερο διαδραστικοί με την
τεχνολογία του χρονοδιαμοιρασμού ο τηλέτυπος επέτρεψε και την απόκριση
του υπολογιστή σε πραγματικό χρόνο πάνω στο ίδιο χαρτί μπροστά στον
χρήστη. <a href="#fn5" id="fnref5" class="footnote-ref"
role="doc-noteref"><sup>5</sup></a> <a href="#fn6" id="fnref6"
class="footnote-ref" role="doc-noteref"><sup>6</sup></a></p>
<p>Η καθιέρωση του τηλέτυπου ως βασική συσκευή διάδρασης με τον
υπολογιστή οδήγησε σταδιακά και στον διαχωρισμό της εισόδου από την
έξοδο, αφού στις περισσότερες περιπτώσεις ο προγραμματισμός γινόταν σε
εργασίες δέσμης οι οποίες είχαν ετεροχρονισμένη έξοδο. Πράγματι, οι
περισσότεροι υπολογιστές εκείνης της εποχής ήταν πολύ ακριβοί και
σχετικά αργοί για διάδραση σε πραγματικό χρόνο. Ακόμη, πολλές δημοφιλείς
εφαρμογές, όπως ήταν οι λογιστικές και η μισθοδοσία γίνονταν περιοδικά,
αλλά με μεγάλη ανάγκη για ταχύτατη εκτύπωση του αποτελέσματος σε μικρό
χρόνο. Με αυτόν τον τρόπο δημιουργήθηκε η ανάγκη για μια αποκλειστική
συσκευή εξόδου, που οδήγησε στην κατασκευή του εκτυπωτή γραμμής Βλέπουμε
λοιπόν, ότι αρχικά η διάδραση είχε καθοριστεί από τις υπάρχουσες
συσκευές εισόδου και εξόδου, οι οποίες βασίζονται στο πληκτρολόγιο και
στην εκτύπωση κειμένου, τα οποία άφησαν ένα διαχρονικό αποτύπωμα σε όλα
τα σύγχρονα συστήματα, ενώ παραμένουν θεμελιώδη σε συστήματα που
βασίζονται στο UNIX. Η χρήση του τηλέτυπου οδήγησε στην δημιουργία
πολλών μορφών διάδρασης, όπως είναι η γραμμή εντολών, η φόρμα, τα μενού,
και η φυσική γλώσσα.</p>
<figure id="fig:tty-model33">
<img src="../images/tty-model33.jpg"
alt="Το μοντέλο 33 της εταιρείας Teletype αποτελεί μια ολοκληρωμένη συσκευή εισόδου και εξόδου και ήταν πολύ δημοφιλής με τους μίνι-υπολογιστές της δεκαετίας του 1960, καθώς και με τους πρώτους μίκρο-υπολογιστές, αφού για πολλά χρόνια ήταν η πιο οικονομική και οικεία λύση. Ο χρήστης μπορούσε να αλληλεπιδράσει με τον υπολογιστή με το πληκτρολόγιο και να δει την έξοδο να τυπώνεται στο χαρτί, ενώ η διάτρητη χαρτοταινία επιτρέπει τόσο την αποθήκευση δεδομένων, όσο και την φόρτωση τους." />
<figcaption aria-hidden="true">Το μοντέλο 33 της εταιρείας Teletype
αποτελεί μια ολοκληρωμένη συσκευή εισόδου και εξόδου και ήταν πολύ
δημοφιλής με τους μίνι-υπολογιστές της δεκαετίας του 1960, καθώς και με
τους πρώτους μίκρο-υπολογιστές, αφού για πολλά χρόνια ήταν η πιο
οικονομική και οικεία λύση. Ο χρήστης μπορούσε να αλληλεπιδράσει με τον
υπολογιστή με το πληκτρολόγιο και να δει την έξοδο να τυπώνεται στο
χαρτί, ενώ η διάτρητη χαρτοταινία επιτρέπει τόσο την αποθήκευση
δεδομένων, όσο και την φόρτωση τους.</figcaption>
</figure>
<figure id="fig:joss">
<img src="../images/joss.jpg"
alt="Το περιβάλλον προγραμματισμού JOSS δεν έκανε διάκριση ανάμεσα σε γλώσσα προγραμματισμού και λειτουργικό σύστημα και επηρέασε την έκδοση της BASIC για μικροϋπολογιστές της δεκαετίας του 1980, γιατί βασιζόταν σε μια σύγχρονη αλληλεπίδραση ανθρώπου και υπολογιστή, σε αντίθεση με τα συστήματα εκείνης της εποχής που βασίζονταν κυρίως σε εργασίες δέσμης. Επίσης, η JOSS δείχνει την κατανόηση της διάδρασης ως διαλογική επικοινωνία ανθρώπου-υπολογιστή και ταυτόχρονα αποτυπώνει τον ρόλο των συσκευών διάδρασης σε αυτόν τον διάλογο, που στην περίπτωση της ήταν ο τηλέτυπος." />
<figcaption aria-hidden="true">Το περιβάλλον προγραμματισμού JOSS δεν
έκανε διάκριση ανάμεσα σε γλώσσα προγραμματισμού και λειτουργικό σύστημα
και επηρέασε την έκδοση της BASIC για μικροϋπολογιστές της δεκαετίας του
1980, γιατί βασιζόταν σε μια σύγχρονη αλληλεπίδραση ανθρώπου και
υπολογιστή, σε αντίθεση με τα συστήματα εκείνης της εποχής που
βασίζονταν κυρίως σε εργασίες δέσμης. Επίσης, η JOSS δείχνει την
κατανόηση της διάδρασης ως διαλογική επικοινωνία ανθρώπου-υπολογιστή και
ταυτόχρονα αποτυπώνει τον ρόλο των συσκευών διάδρασης σε αυτόν τον
διάλογο, που στην περίπτωση της ήταν ο τηλέτυπος.</figcaption>
</figure>
<p>Εξίσου καθοριστική ήταν η εφεύρεση της συσκευής εισόδου ποντίκι, η
οποία επιτρέπει την έμεση διάδραση με μεγάλη ακρίβεια και άνεση αρχικά
με κείμενο και στην συνέχεια με σημεία της οθόνης.</p>
<p>Η συσκευή εισόδου πένα έχει ιδιαίτερο ενδιαφέρον, καθώς συνδυάζει και
τους δύο τύπους διάδρασης με συσκευές εισόδου, αλλά κυρίως επειδή
ιστορικά εμφανίστηκε πολύ νωρίτερα από το ποντίκι, αλλά δεν είχε την
ίδια αποδοχή. Πρώτα από όλα, η πένα είναι μια συσκευή εισόδου που μπορεί
να λειτουργήσει τόσο ως συσκευή άμεσης όσο και έμμεσης διάδρασης. Για
παράδειγμα, μπορούμε να χρησιμοποιήσουμε την πένα απευθείας πάνω σε μια
οθόνη, οπότε έχουμε μια διάδραση που είναι ανάλογη της χρήσης του
μολυβιού πάνω σε χαρτί. Επιπλέον, μπορούμε να χρησιμοποιήσουμε την πένα
ως συσκευή έμμεσης εισόδου, όπως χρησιμοποιούμε το ποντίκι, και τότε η
διαφορά, εκτός από το κράτημα της συσκευής, βρίσκεται στο γεγονός ότι η
πένα μπορεί να έχει ένα-προς-ένα σχέση με τη συσκευή εξόδου ακόμη και
στην περίπτωση που λειτουργεί ως έμμεση συσκευή εισόδου. Αν και από τα
παραπάνω η πένα φαίνεται να είναι μια ευέλικτη και επιθυμητή συσκευή
εισόδου, στην πράξη έχει αποδειχτεί ότι κουράζει το χέρι, ενώ δεν έχει
την ταχύτητα και την ακρίβεια του ποντικιού. Φυσικά, υπάρχουν κάποιες
επιμέρους χρήσεις, όπως στη σχεδίαση, όπου η πένα μπορεί να έχει πολλά
πλεονεκτήματα έναντι του ποντικιού.</p>
<p>Το ποντίκι στα πρώτα συστήματα διάδρασης ήταν απλώς μια συσκευή
επιλογής κειμένου. Στην πορεία, και καθώς η οθόνη εμπλουτίστηκε με
περισσότερα στοιχεία γραφικών όπως τα παράθυρα και τα εικονίδια, το
ποντίκι κράτησε τον ρόλο του ως η πιο αποδοτική συσκευή επιλογής στόχου
και μετακίνησης αντικειμένων πάνω στην οθόνη. Από τα πρώτα εμπορικά
βήματα, το ποντίκι είχε διαφορετικό αριθμό πλήκτρων ανάλογα με τις
ανάγκες του χρήστη. Για παράδειγμα, οι υπολογιστές της Apple αρχικά
συνοδεύονταν από ποντίκι με ένα κουμπί, ενώ οι περισσότερες από τις
άλλες εμπορικές προτάσεις είχαν δύο ή τρία κουμπιά. Στο πέρασμα των
χρόνων και καθώς το ποντίκι κέρδιζε τη θέση του σε περισσότερες και πιο
πολύπλοκες εφαρμογές, ο σχεδιασμός του επαυξήθηκε, τόσο με επιπλέον
κουμπιά όσο και με νέες λειτουργίες που γεφύρωσαν το χάσμα με τις πολύ
δημοφιλείς οθόνες αφής.</p>
<p>Καθώς ο υπολογιστής απέκτησε μεγαλύτερη ισχύ και δικτύωση, και
κυρίως, καθώς οι ανθρώπινες ανάγκες και χρήσεις του υπολογιστή
επεκτάθηκαν και σε άλλους τομείς πέρα από την εργασία, νέες συσκευές
εισόδου και εξόδου, όπως η κάμερα, το μικρόφωνο, τα ηχεία, απέκτησαν
σημασία. Η πρώτη περίοδος των υπερμέσων και πολυμέσων ήταν περιορισμένη
σε στατικά αποθηκευτικά μέσα όπως οι οπτικοί δίσκοι, αλλά η εξάπλωση της
δικτύωσης μετέφερε την αποθήκευση, την επεξεργασία, και τη διανομή τους
μέσω του δικτύου των υπολογιστών με τη συμμετοχή των χρηστών.</p>
<section id="footnotes" class="footnotes footnotes-end-of-section"
role="doc-endnotes">
<hr />
<ol>
<li><div id="fn1">
<p><span class="citation" data-cites="mcewen2013designing">McEwen και
Cassimally (2013)</span><a href="#fnref1" class="footnote-back"
role="doc-backlink">↩︎</a></p>
</div></li>
<li><div id="fn2">
<p><span class="citation" data-cites="hiltzik1999dealers">Hiltzik
(1999)</span><a href="#fnref2" class="footnote-back"
role="doc-backlink">↩︎</a></p>
</div></li>
<li><div id="fn3">
<p>fig:sage-radar<a href="#fnref3" class="footnote-back"
role="doc-backlink">↩︎</a></p>
</div></li>
<li><div id="fn4">
<p>fig:spacewar-players<a href="#fnref4" class="footnote-back"
role="doc-backlink">↩︎</a></p>
</div></li>
<li><div id="fn5">
<p>fig:tty-model33<a href="#fnref5" class="footnote-back"
role="doc-backlink">↩︎</a></p>
</div></li>
<li><div id="fn6">
<p>fig:joss<a href="#fnref6" class="footnote-back"
role="doc-backlink">↩︎</a></p>
</div></li>
</ol>
</section>
<h2 id="κατασκευή-νέων-διεπαφών">Κατασκευή νέων διεπαφών</h2>
<p>Η διάκριση ανάμεσα σε συσκευές εισόδου και εξόδου είναι περισσότερο
τεχνητή παρά πραγματική και γίνεται χάριν ανάλυσης, αφού τελικά αυτό που
μας ενδιαφέρει, δηλαδή το μοντέλο της διάδρασης είναι πάντα ένας
συνδυασμός αυτών των δύο. Ο χρήστης μέσω της συσκευής εισόδου θα
μεταδώσει την πρόθεσή του στον υπολογιστή, ο οποίος θα επικοινωνήσει την
κατάστασή του μέσω μιας συσκευής εξόδου. Έχοντας προσεγγίσει τη διάδραση
τόσο από την πλευρά του ανθρώπου όσο και από την πλευρά του υπολογιστή,
θα στρέψουμε την προσοχή μας στον μεταξύ τους διάλογο, όπου θα
εξετάσουμε διάφορα μοντέλα διάδρασης.</p>
<p>Η μεγάλη πρόκληση στη σχεδίαση των μοντέλων διάδρασης βρίσκεται στο
γεφύρωμα των διαφορών που υπάρχουν ανάμεσα στην εικόνα που έχει ο
τελικός χρήστης για το σύστημα και σε εκείνη που έχουν οι κατασκευαστές
του για το πώς λειτουργεί το σύστημα εσωτερικά. Το χάσμα αυτό αποτελεί
πρόκληση, κυρίως γιατί οι ανάγκες των χρηστών είναι ένας κινούμενος
στόχος, αφού οι χρήστες έχουν μεγάλες διαφορές μεταξύ τους και επιπλέον,
ο ίδιος χρήστης έχει διαφορετικές ανάγκες και προτιμήσεις ανάλογα με τη
χρονική στιγμή και την περίσταση, καθώς και διαχρονικά. Τέλος, η κάθε
τεχνολογική παρέμβαση επηρεάζει (ή τουλάχιστον επαναπροσδιορίζει) τις
ανάγκες των χρηστών, και δημιουργεί μια αυτοτροφοδοτούμενη ανάγκη για
νέα μοντέλα διάδρασης.</p>
<figure id="fig:chorded-input">
<img src="../images/chorded-input.jpg"
alt="Το πληκτρολόγιο ακόρντων επιτρέπει την είσοδο 31 διαφορετικών κωδικών που καλύπουν όλο το λατινικό αλφάβητο ή μπορούν να αντιστοιχούν σε τροπικές κεντολές. Σε συνδυασμό με μια αποδοτική συσκευής επιλογής στόχων στην οθόνη, δεν υπάρχει ανάγκη για το παραδοσιακό πληκτρολόγιο, ειδικά για την συχνή διεργασία της απλής επεξεργασίας έτοιμου κειμένου. Αν και είχε ήδη χρησιμοποιηθεί στο παρελθόν στον τηλέτυπο και στην συντομογραφία, ο συνδυασμός με το ποντίκι έχει το εργονομικό πλεονέκτημα ότι ο χρήστης δεν χρειάζεται να μετακινήσει τα χέρια του." />
<figcaption aria-hidden="true">Το πληκτρολόγιο ακόρντων επιτρέπει την
είσοδο 31 διαφορετικών κωδικών που καλύπουν όλο το λατινικό αλφάβητο ή
μπορούν να αντιστοιχούν σε τροπικές κεντολές. Σε συνδυασμό με μια
αποδοτική συσκευής επιλογής στόχων στην οθόνη, δεν υπάρχει ανάγκη για το
παραδοσιακό πληκτρολόγιο, ειδικά για την συχνή διεργασία της απλής
επεξεργασίας έτοιμου κειμένου. Αν και είχε ήδη χρησιμοποιηθεί στο
παρελθόν στον τηλέτυπο και στην συντομογραφία, ο συνδυασμός με το
ποντίκι έχει το εργονομικό πλεονέκτημα ότι ο χρήστης δεν χρειάζεται να
μετακινήσει τα χέρια του.</figcaption>
</figure>
<figure id="fig:vpl-data-glove">
<img src="../images/vpl-data-glove.png"
alt="Το γάντι δεδομένων περιέχει αισθητήρες που καταγράφουν την θέση του χεριού και τις κινήσεις των δακτύλων, έτσι ώστε να υπάρχει λεπτομερής χειρισμός σε περιβάλλον εικονικής πραγματικότητας ή σε άλλες εφαρμογές, όπως ρομποτική." />
<figcaption aria-hidden="true">Το γάντι δεδομένων περιέχει αισθητήρες
που καταγράφουν την θέση του χεριού και τις κινήσεις των δακτύλων, έτσι
ώστε να υπάρχει λεπτομερής χειρισμός σε περιβάλλον εικονικής
πραγματικότητας ή σε άλλες εφαρμογές, όπως ρομποτική.</figcaption>
</figure>
<p>Οι σχεδιαστές προσπαθούν να γεφυρώσουν το χάσμα με γενικά μοντέλα
διάδρασης. Τα μοντέλα διάδρασης μας βοηθούν να κατανοήσουμε τι συμβαίνει
κατά την επικοινωνία μεταξύ του χρήση και του συστήματος. Η εργονομία
ασχολείται με τα φυσικά χαρακτηριστικά της διάδρασης, και πώς αυτά
επηρεάζουν την αποτελεσματικότητά της. Ο διάλογος μεταξύ του χρήστη και
του συστήματος επηρεάζεται από το στυλ της διεπαφής ανθρώπου και
υπολογιστή, και το στυλ αυτό είναι το βασικό αντικείμενο της σχεδίασης,
όπως τουλάχιστον θα φανεί στον τελικό χρήστη. Η διάδραση λαμβάνει χώρα
μέσα σε ένα κοινωνικό και οργανωτικό πλαίσιο, το οποίο επηρεάζει τόσο
τον χρήστη, όσο και το σύστημα. Τα υποδείγματα διάδρασης παρέχουν μια
καλή θεώρηση του ιστορικού των διαδραστικών συστημάτων υπολογιστών.</p>
<p>Στις προηγούμενες ενότητες είδαμε ξεχωριστά μια σειρά από συσκευές
εισόδου (π.χ., ποντίκι) και εξόδου (π.χ., οθόνη), καθώς και τα στυλ
διάδρασης που επιτρέπουν (π.χ., μενού), αλλά δεν έχουμε δει καθόλου τους
συνδυασμούς τους. Ειδικά η δημοφιλής επιφάνεια εργασίας στον επιτραπέζιο
υπολογιστή είναι παράδειγμα μονοδιάστατης αντίληψης για τη διάδραση
ανθρώπου και υπολογιστή. Αν φανταστούμε πώς βλέπει τον χρήστη ένας
υπολογιστής με διάδραση τύπου επιφάνειας εργασίας, τότε καταλήγουμε ότι
η εικόνα που έχει ο υπολογιστής για εμάς δεν είναι πλήρης αλλά μοιάζει
με μια παλάμη, ένα δάκτυλο, κι ένα μάτι, αφού αυτά αρκούν για αυτό τον
τύπο διάδρασης. Με δεδομένη τη δυνατότητα του ανθρώπου να εκφράζει τις
προθέσεις του και να προσλαμβάνει ερεθίσματα με ένα πολύ πλουσιότερο
φάσμα κινήσεων και αισθήσεων, καταλήγουμε ότι η διάδραση με την
επιφάνεια εργασίας είναι απλά μια μικρή υποπερίπτωση της διάδρασης
ανθρώπου και υπολογιστή. <a href="#fn7" id="fnref7" class="footnote-ref"
role="doc-noteref"><sup>7</sup></a> <a href="#fn8" id="fnref8"
class="footnote-ref" role="doc-noteref"><sup>8</sup></a></p>
<p>Υπάρχει μια πολύ μεγάλη ποικιλία από συσκευές εισόδου για τον
υπολογιστή και η επιλογή της κατάλληλης συσκευής εξαρτάται λιγότερο από
την τεχνολογία και περισσότερο από τον χρήστη, το πλαίσιο χρήσης, καθώς
και από τις διεργασίες του χρήστη. Αρχικά, στους πρώτους κεντρικούς
υπολογιστές η είσοδος βασιζόταν στο χαρτί, αφού το χαρτί ήταν από πολύ
παλιά ένα μέσο οικείο για τον άνθρωπο. Καθώς, όμως, οι υπολογιστές
μετασχηματίζονται, με νέες φόρμες και χρήσεις, σε επιτραπέζιους,
κινητούς και διάχυτους, δημιουργούνται νέοι τρόποι ελέγχου και νέες
συσκευές εισόδου. Μερικές από τις πιο δημοφιλείς συσκευές εισόδου στους
επιτραπέζιους υπολογιστές είναι το πληκτρολόγιο, το ποντίκι, η πένα, το
χειριστήριο (παιχνιδιών), το trackpad, η κάμερα, κ.ά. Στον κινητό
υπολογισμό έχουμε επιπλέον συστήματα εισόδου όπως η γεωγραφική θέση, ο
προσανατολισμός, το επιταγχυσιόμετρο, ενώ στον διάχυτο υπολογισμό (π.χ.,
φορετοί υπολογιστές, έξυπνα ρολόγια) έχουμε επιπλέον συστήματα εισόδου
όπως οι αισθητήρες περιβαλλοντικών και βιολογικών σημάτων. Η επιλογή
συσκευών εισόδου γίνεται περισσότερο περίπλοκη όταν θέλουμε να
συνδυάσουμε διαφορετικές συσκευές εισόδου σε μια πολυτροπική
σύνθεση.</p>
<figure id="fig:trackball">
<img src="../images/trackball.jpg"
alt="Όπως και η πένα εισόδου, έτσι και μπάλα κύλισης δημιουργήθηκε αρχικά για να διευκολύνει τον εντοπισμό σημείων πάνω σε μια οθόνη ραντάρ που οπτικοποιεί πλοία. Η μπάλα κύλισης παράμεινε πάντα σε χρήση για ορισμένες εφαρμογές και έδωσε την έμπνευση για την πιο σημαντική βελτίωση στην χρήση του ποντικιού όπου οι τροχοί του αντικαταστάθηκαν από μια μικρή μπάλα." />
<figcaption aria-hidden="true">Όπως και η πένα εισόδου, έτσι και μπάλα
κύλισης δημιουργήθηκε αρχικά για να διευκολύνει τον εντοπισμό σημείων
πάνω σε μια οθόνη ραντάρ που οπτικοποιεί πλοία. Η μπάλα κύλισης
παράμεινε πάντα σε χρήση για ορισμένες εφαρμογές και έδωσε την έμπνευση
για την πιο σημαντική βελτίωση στην χρήση του ποντικιού όπου οι τροχοί
του αντικαταστάθηκαν από μια μικρή μπάλα.</figcaption>
</figure>
<figure id="fig:telefunken-ball-mouse">
<img src="../images/telefunken-ball-mouse.jpg"
alt="Το αρχικό ποντίκι με τους δύο τροχούς κύλισης που ακουμπάνε απευθείας πάνω στο τραπέζι μπορούσε να επιλέγει κείμενο αλλά δεν ήταν βέλτιστο για την ελεύθερη επιλογή σημείων στην οθόνη, γιατί μπορούσε να κινηθεί μόνο σε οριζόντιες και κατακόρυφες ευθείες γραμμές. Οι μηχανικοί της Telefunken βασιζόμενοι στην σχεδίαση της μπάλας κύλισης, την οποία γύρισαν ανάποδα, έφτιαξαν το πρώτο εύχρηστο ποντίκι για γραφικά περιβάλλοντα." />
<figcaption aria-hidden="true">Το αρχικό ποντίκι με τους δύο τροχούς
κύλισης που ακουμπάνε απευθείας πάνω στο τραπέζι μπορούσε να επιλέγει
κείμενο αλλά δεν ήταν βέλτιστο για την ελεύθερη επιλογή σημείων στην
οθόνη, γιατί μπορούσε να κινηθεί μόνο σε οριζόντιες και κατακόρυφες
ευθείες γραμμές. Οι μηχανικοί της Telefunken βασιζόμενοι στην σχεδίαση
της μπάλας κύλισης, την οποία γύρισαν ανάποδα, έφτιαξαν το πρώτο
εύχρηστο ποντίκι για γραφικά περιβάλλοντα.</figcaption>
</figure>
<p>Ένας δημοφιλής και απλός τρόπος για να ταξινομήσουμε τις συσκευές
εισόδου είναι με δύο παραμέτρους που αντιστοιχούν στον αριθμό των
διαστάσεων και στην ιδιότητα που παρακολουθεί η συσκευή εισόδου. Για
παράδειγμα, το ποντίκι μπορεί να έχει μια ροδέλα κύλισης η οποία
επιτρέπει την εύκολη κατακόρυφη ροή των σελίδων κειμένου στην οθόνη, ενώ
ταυτόχρονα παρακολουθεί τη θέση της συσκευής πάνω στις δύο διαστάσεις
του τραπεζιού για να μετακινήσει αντίστοιχα τον δείκτη στην οθόνη. Με τη
χρήση μιας κάμερας βάθους πεδίου μπορούμε να παρακολουθήσουμε την κίνηση
των δακτύλων ή όλου του σώματος σε τρεις διαστάσεις. Βλέπουμε λοιπόν ότι
για την ίδια παράμετρο (αριθμός διαστάσεων) μπορούμε να έχουμε την ίδια
ή διαφορετικές συσκευές εισόδου, καθώς και ένα μεγάλο εύρος από
αισθητήρες, που μπορεί να αποτελούνται από μηχανικά, ηλεκτρονικά, και
οπτικά μέρη. Εκτός από την παράμετρο του αριθμού των διαστάσεων που
καταγράφει μια συσκευή εισόδου, η δεύτερη παράμετρος είναι το είδος της
κίνησης που καταγράφεται. Το είδος της κίνησης μπορεί να είναι η θέση
(π.χ., ποντίκι πάνω σε τραπέζι), η κίνηση (π.χ., ροδέλα κύλισης), και η
πίεση (π.χ., πλήκτρο). Η αποτύπωση των παραμέτρων και η συμπλήρωση των
αντίστοιχων συσκευών εισόδου, μας επιτρέπει να δημιουργήσουμε έναν
σχεδιαστικό χώρο όπου φαίνονται άμεσα οι ευκαιρίες για νέες συσκευές
εισόδου. <a href="#fn9" id="fnref9" class="footnote-ref"
role="doc-noteref"><sup>9</sup></a> <a href="#fn10" id="fnref10"
class="footnote-ref" role="doc-noteref"><sup>10</sup></a></p>
<p>Η κατασκευή νέων συσκευών εισόδου είναι μια πολύ ενδιαφέρουσα αλλά
και σύνθετη εργασία. Από τη μια πλευρά, η κατασκευή νέων συσκευών
εισόδου δίνει στον άνθρωπο νέες επαυξημένες δυνατότητες για να ενεργήσει
στον κόσμο της πληροφορίας, ο οποίος αντιπροσωπεύει ή ακόμη και ελέγχει
τον πραγματικό κόσμο. Από την άλλη πλευρά, η κατασκευή νέων συσκευών
εισόδου επηρεάζεται από ένα μεγάλο εύρος παραμέτρων, των οποίων η
σύνθεση δύσκολα γίνεται γνωστή σε βάθος από τους σχεδιαστές. Για
παράδειγμα, η σχεδίαση της συσκευής εισόδου ‘ποντίκι’ υλοποίησε στο
ακέραιο το όραμα του σχεδιαστή της για την επαύξηση της ανθρώπινης
σκέψης, αφού έδωσε πρόσβαση στους υπολογιστές και στην πληροφορία σε ένα
μεγάλο εύρος χρηστών πέρα από τους ειδικούς. Ταυτόχρονα, η κατασκευή της
συσκευής εισόδου ‘ποντίκι’ δεν ήταν άμεσα προφανής, αφού υπάρχουν πάντα
πολλές εναλλακτικές συσκευές εισόδου για τον ίδιο σκοπό. Ακόμη, η
συσκευή εισόδου ‘ποντίκι’ βρίσκεται σε έναν συνεχή μετασχηματισμό, καθώς
επηρεάζεται από πολλούς παράγοντες όπως το πλαίσιο χρήσης, οι
προτιμήσεις, και η κατανόηση που έχουν οι σχεδιαστές της. Για
παράδειγμα, τα δημοφιλή δικτυακά βιντεοπαιχνίδια δράσης τρίτου προσώπου
δημιούργησαν την ανάγκη για ποντίκια με πολλά πλήκτρα. Αντίστοιχα, η
κατασκευή κάθε νέας συσκευής εισόδου θα πρέπει να ισορροπήσει ανάμεσα σε
όλες τις παραπάνω δυνάμεις.</p>
<p>Οι υπολογιστές έχουν τη δυνατότητα να επεξεργάζονται πληροφορία που
τελικά αναπαριστούν μέσα από πολλά διαφορετικά κανάλια. Οι πρώτοι
κεντρικοί υπολογιστές είχαν ως έξοδο το χαρτί, ακριβώς όπως είχαν το
χαρτί ως είσοδο, γιατί αυτός ήταν ο πιο αποτελεσματικός τρόπος διάδρασης
με τους ανθρώπους, οι οποίοι από πολύ παλιά έχουν μια οικειότητα με το
χαρτί. Καθώς ο υπολογιστής απέκτησε νέες μορφές (όπως είναι ο
επιτραπέζιος, ο κινητός, και ο διάχυτος), αναπτύχθηκαν νέοι τρόποι
αναπαράστασης της πληροφορίας. Η οθόνη του υπολογιστή είναι με μεγάλη
διαφορά η πιο δημοφιλής συσκευή εξόδου, επειδή μπορεί να έχει πολλά
σχήματα και μεγέθη, ανάλογα με τη φόρμα του υπολογιστή (π.χ.,
επιτραπέζιος, φορητός, φορετός, δωματίου, κτλ.), και στην περίπτωση που
πρόκειται για οθόνη εικονοστοιχείων, μπορεί να οπτικοποιήσει την
πληροφορία με πολλούς διαφορετικούς τρόπους. <a href="#fn11"
id="fnref11" class="footnote-ref" role="doc-noteref"><sup>11</sup></a>
<a href="#fn12" id="fnref12" class="footnote-ref"
role="doc-noteref"><sup>12</sup></a> Εκτός από την οθόνη, τα ηχεία
επιτρέπουν στον υπολογιστή να επικοινωνήσει μέσω του ήχου ή ακόμη και
μέσω της φυσικής γλώσσας με ομιλία. Στις μικρότερες φόρμες των
υπολογιστών (π.χ., κινητός, φορετός) καθώς και στα πλαίσια χρήσης όπου η
οπτική προσοχή του ανθρώπου είναι στραμμένη αλλού (π.χ., οδήγηση,
άθληση), οι ενδεικτικές λυχνίες καθώς και η δόνηση αποκτούν σημαντικό
ρόλο.</p>
<figure id="fig:tv-typewriter">
<img src="../images/tv-typewriter.jpg"
alt="Η μεγάλη διαθεσιμότητα των συσκευών τηλεόρασης την δεκαετία του 1970 επέτρεψε σε πολλούς ερασιτέχνες να συνδέσουν ένα πληκτρολόγιο για να γράψουν κείμενο στην οθόνη της. Αν και οι συσκευές αυτές δεν είχαν κάποιο επεξεργαστή, στην συνέχεια επεκτάθηκαν για να συνδεθούν με τους πρώτους μικροϋπολογιστές." />
<figcaption aria-hidden="true">Η μεγάλη διαθεσιμότητα των συσκευών
τηλεόρασης την δεκαετία του 1970 επέτρεψε σε πολλούς ερασιτέχνες να
συνδέσουν ένα πληκτρολόγιο για να γράψουν κείμενο στην οθόνη της. Αν και
οι συσκευές αυτές δεν είχαν κάποιο επεξεργαστή, στην συνέχεια
επεκτάθηκαν για να συνδεθούν με τους πρώτους
μικροϋπολογιστές.</figcaption>
</figure>
<figure id="fig:teletext">
<img src="../images/teletext.jpg"
alt="Το teletext είναι ένα από τα πρώτα λειτουργικά συστήματα διαδραστικής πληροφόρησης το οποίο μάλιστα βασίζεται στην αναλογική τεχνολογία μετάδοσης και απεικόνισης τηλεοπτικού σήματος. Αρχικά σχεδιάστηκε για την μετάδοση προαιρετικών υπότιτλων για όσους έχουν προβλήματα ακοής, αλλά στην συνέχεια έγινε δημοφιλές για τις σελίδες πληροφόρησης σχετικά με τον καιρό, τις ειδήσεις, αθλητικά, και σελίδες τοπικού ενδιαφέροντος αφού η εμβέλεια του τηλεοπτικού σήματος είναι από την φύσης της περιορισμένη." />
<figcaption aria-hidden="true">Το teletext είναι ένα από τα πρώτα
λειτουργικά συστήματα διαδραστικής πληροφόρησης το οποίο μάλιστα
βασίζεται στην αναλογική τεχνολογία μετάδοσης και απεικόνισης
τηλεοπτικού σήματος. Αρχικά σχεδιάστηκε για την μετάδοση προαιρετικών
υπότιτλων για όσους έχουν προβλήματα ακοής, αλλά στην συνέχεια έγινε
δημοφιλές για τις σελίδες πληροφόρησης σχετικά με τον καιρό, τις
ειδήσεις, αθλητικά, και σελίδες τοπικού ενδιαφέροντος αφού η εμβέλεια
του τηλεοπτικού σήματος είναι από την φύσης της
περιορισμένη.</figcaption>
</figure>
<p>Η κυριαρχία της οθόνης ως συσκευής εξόδου είναι τόσο μεγάλη που στις
περισσότερες πηγές για την κατασκευή της διάδρασης υπονοείται η χρήση
της, χωρίς να αφήνονται περιθώρια για τη θεώρηση εναλλακτικών συσκευών
εξόδου. Επιπλέον, η ωριμότητα και το προσιτό κόστος των προβολών σε δύο
διαστάσεις έχει αφήσει στο περιθώριο την πιο φυσική για τον άνθρωπο
προβολή σε τρεις διαστάσεις και τα αντίστοιχα εικονικά περιβάλλοντα. Από
μια ανθρωποκεντρική σκοπιά, αν εξετάσουμε τα αισθητήρια όργανα του
ανθρώπου διαπιστώνουμε ότι η αίσθηση της αφής, ειδικά αυτή στις άκρες
των δακτύλων, είναι από τις πιο πλούσιες σε νευρικές απολήξεις, τόσο σε
εύρος όσο και σε είδος, αφού μπορεί να αντιληφθεί την υφή, το σχήμα, τη
θερμοκρασία των υλικών. Με δεδομένο ότι οι διαθέσιμες τεχνολογίες που
επαυξάνουν την αφή δεν είναι ακόμη τόσο ώριμες όσο οι τεχνολογίες για
τις οθόνες, γίνεται φανερό ότι η κυριαρχία της οθόνης ως συσκευής εξόδου
είναι περισσότερο αποτέλεσμα μιας τεχνολογικής περίστασης και όχι τόσο
της ανάγκης για ανθρωποκεντρική κατασκευή της διάδρασης. Όπως και στην
περίπτωση των συσκευών εισόδου, έτσι και για τις συσκευές εξόδου τα πιο
ενδιαφέροντα αλλά και δύσκολα στην κατασκευή συστήματα διάδρασης
βασίζονται στη σύνθετη ή πολυτροπική διάδραση, που εξετάζεται στην
επόμενη ενότητα.</p>
<p>Με τον όρο φυσική διάδραση<a href="#fn13" id="fnref13"
class="footnote-ref" role="doc-noteref"><sup>13</sup></a> εννοούμε ένα
σύνολο από δεξιότητες που είναι δεδομένες για τους ανθρώπους, όπως είναι
οι χειρονομίες, οι εκφράσεις του προσώπου, η αναγνώριση φυσικής γλώσσας,
κτλ. Η φυσική διάδραση ανθρώπου και υπολογιστή φαίνεται να είναι ο πιο
λογικός τρόπος για να γεφυρώσουμε τις διαφορές που έχουν άνθρωποι και
υπολογιστές. Στην πράξη, αν και τα συστήματα φυσικής διάδρασης έχουν
ωριμάσει αρκετά, η αποτελεσματικότητά τους είναι αποδεκτή μόνο σε πολύ
στενά πλαίσια της ανθρώπινης δραστηριότητας. Οι περιορισμοί που έχουν τα
συστήματα φυσικής διάδρασης έχουν να κάνουν με την αδυναμία να δώσουν
ανάδραση για την παρούσα κατάσταση, και κυρίως με την περιορισμένη
εικόνα που έχει ο χρήστης για τις πιθανές δράσεις. Από τη μία πλευρά, ο
χρήστης δε χρειάζεται να προσαρμοστεί στο μοντέλο λειτουργίας του
συστήματος (αφού αυτό είναι τελείως φυσικό και βασίζεται απόλυτα στις
ανθρώπινες δεξιότητες), από την άλλη πλευρά όμως, η φυσική διάδραση δεν
επιτρέπει τη δημιουργία σύνθετων συστημάτων, αφού είναι δύσκολο να ξέρει
ο χρήστης πού βρίσκεται και τι μπορεί να κάνει. Επιπλέον, η φυσική
διάδραση σε πολλές περιπτώσεις είναι δύσκολο να κατασκευαστεί με τρόπο
γενικό, που να καλύπτει όλους τους ανθρώπους, επειδή υπάρχει πολύ μεγάλη
διακύμανση σε φυσικές δεξιότητες, όπως είναι οι χειρονομίες ή η
ομιλία.</p>
<p>O σχεδιασμός του υπολογιστή και ειδικά των συσκευών εισόδου και
εξόδου μπορεί να επιφέρει συγκεκριμένη ανάδραση από τους χρήστες. Το αν
οι χρήστες θα αγοράσουν, θα μάθουν, θα χρησιμοποιήσουν ένα προϊόν ή αν
θα συνεργαστούν με άλλους, εξαρτάται σε μεγάλο βαθμό από το πόσο άνετα
νιώθουν όταν βλέπουν και κρατάνε το αντίστοιχο σύστημα, καθώς και από το
πόσο το εμπιστεύονται. Εάν ο υπολογιστής αργεί και είναι ενοχλητικός,
τότε είναι πιθανό οι χρήστες να αποφύγουν τη διάδραση. Εάν όμως το
σύστημα εισόδου και εξόδου είναι ευχάριστο και γρήγορο τότε η χρήση του
γίνεται περισσότερο επιθυμητή και άνετη, οπότε οι χρήστες είναι πιθανό
να το αγοράσουν και να το χρησιμοποιήσουν.</p>
<figure id="fig:makey_makey_front">
<img src="../images/makey_makey_front.png"
alt="Το Makey Makey είναι ένα Arduino που έχει οργανωθεί και προγραμματιστεί έτσι ώστε να διευκολύνει τον πειραματισμό με νέες συσκευές εισόδου." />
<figcaption aria-hidden="true">Το Makey Makey είναι ένα Arduino που έχει
οργανωθεί και προγραμματιστεί έτσι ώστε να διευκολύνει τον πειραματισμό
με νέες συσκευές εισόδου.</figcaption>
</figure>
<figure id="fig:minecraft-pi">
<img src="../images/minecraft-pi.jpg"
alt="Το RaspberryPi δημιουργήθηκε για να δώσει οικονομική πρόσβαση στον προγραμματισμό του υπολογιστή σε όσο γίνεται περισσότερους χρήστες και με ιδιαίτερη έμφαση στα παιδιά. Για αυτόν τον σκοπό, δεν περιλαμβάνει συσκευές εισόδου και εξόδου, αλλά παρέχει την δυνατότητα σύνδεσης τόσο με τα παραδοσιακές συσκευές όπως η οθόνη και το πληκτρολόγιο, αλλά και νέες συσκευές που μπορούν να εφευρεθούν μελοντικά." />
<figcaption aria-hidden="true">Το RaspberryPi δημιουργήθηκε για να δώσει
οικονομική πρόσβαση στον προγραμματισμό του υπολογιστή σε όσο γίνεται
περισσότερους χρήστες και με ιδιαίτερη έμφαση στα παιδιά. Για αυτόν τον
σκοπό, δεν περιλαμβάνει συσκευές εισόδου και εξόδου, αλλά παρέχει την
δυνατότητα σύνδεσης τόσο με τα παραδοσιακές συσκευές όπως η οθόνη και το
πληκτρολόγιο, αλλά και νέες συσκευές που μπορούν να εφευρεθούν
μελοντικά.</figcaption>
</figure>
<p>Τα Lilypad και MakeyMakey είναι μικρο-επεξεργαστές (Arduino) που
αποδεικνύουν την ευελιξία της πλατφόρμας και ανταποκρίνονται στην ανάγκη
να προγραμματίσουμε τη διάδραση γρήγορα, οικονομικά και πέρα από τις
συσκευές εισόδου και εξόδου του επιτραπέζιου υπολογιστή.<a href="#fn14"
id="fnref14" class="footnote-ref" role="doc-noteref"><sup>14</sup></a>
Οι σχεδιαστές του MakeyMakey παρατήρησαν ότι μεγάλο μέρος της χρήσης του
κλασικού Arduino περιλάμβανε τη δοκιμή νέων συσκευών εισόδου. Οι
επίδοξοι σχεδιαστές έπρεπε να φτιάξουν ένα εξωτερικό κύκλωμα που να
διευκολύνει την αγωγιμότητα ανάμεσα στη νέα συσκευή εισόδου και στο
Arduino. Ενώ το Arduino λειτουργεί ως γέφυρα ανάμεσα στην είσοδο του
χρήστη και στον επιτραπέζιο υπολογιστή, ο υπολογιστής επεξεργάζεται την
εντολή που λαμβάνει από το Arduino. Στις περισσότερες περιπτώσεις,
μάλιστα, οι εντολές από το Arduino έχουν αντιστοιχία με κουμπιά από το
πληκτρολόγιο, επειδή αυτή η επιλογή διευκολύνει πολύ την ανάπτυξη του
προγράμματος διάδρασης στον επιτραπέζιο υπολογιστή με οποιοδήποτε
λογισμικό, από έναν φυλλομετρητή μέχρι ένα εξειδικευμένο λογισμικό. Για
αυτόν τον λόγο, το MakeyMakey είναι ένα Arduino που λαμβάνει σήμα
εισόδου από αγώγιμα υλικά και τα μεταφράζει σε πατήματα του
πληκτρολογίου. <a href="#fn15" id="fnref15" class="footnote-ref"
role="doc-noteref"><sup>15</sup></a></p>
<p>Μαζί με το Arduino, το RaspeberryPi είναι μια ακόμη συσκευή που
βασίζεται στον ανοικτό κώδικα για να προσφέρει έναν μικρό σε μέγεθος και
οικονομικό υπολογιστή. Οι ομοιότητες ανάμεσα στο Arduino και στο
RaspberryPi δεν σταματούν στον ανοικτό κώδικα και στην οικονομία, αλλά
συνεχίζονται και στα κίνητρα, αφού και στις δύο περιπτώσεις η εκπαίδευση
έπαιξε κυρίαρχο ρόλο, τουλάχιστον στον αρχικό σχεδιασμό. Η διαφορά στην
περίπτωση του RaspberryPi είναι ότι σχεδιάστηκε για την εκπαίδευση στον
προγραμματισμό των υπολογιστών με έμφαση στα παιδιά. Η έμπνευση για το
RaspberryPi είναι οι πρώτοι οικιακοί υπολογιστές της δεκαετίας του
1970-80. Ήταν πολύ απλές συσκευές που μπορούσαν να συνδεθούν στην
τηλεόραση και αμέσως μετά κάποιος μπορούσε να αρχίσει να δημιουργεί (ή
έστω να έχει μια διάδραση) σε επίπεδο που να βοηθάει στην κατανόηση της
λειτουργίας του υπολογιστή. Σε αντίθεση με την εικόνα που δίνει ο
παγκόσμιος ιστός και τα κοινωνικά δίκτυα (τα κυρίαρχα μέσα με τα οποία
μεγάλωσε η νέα γενιά του 1990-2000), το RaspberryPi βασίζεται στο
λειτουργικό σύστημα Linux και πρεσβεύει μια πιο κοντινή σχέση με τον
υπολογιστή. <a href="#fn16" id="fnref16" class="footnote-ref"
role="doc-noteref"><sup>16</sup></a></p>
<p>Αν και σε πρώτη ανάγνωση τα RaspberryPi και Arduino μπορεί να
φαίνονται ανταγωνιστικά, αφού από την πλευρά της φόρμας και τους κόστους
βρίσκονται στην ίδια κατηγορία, στην πράξη η λειτουργικότητά τους είναι
συμπληρωματική, κυρίως επειδή καλύπτουν πολύ διαφορετικές ανάγκες. Το
RaspberryPi είναι ένας πολύ ισχυρός πολυμεσικός υπολογιστής, κατάλληλος
για πολλές από τις εργασίες που κάνουν οι προσωπικοί επιτραπέζιοι και
φορητοί υπολογιστές. Στο πλαίσιο της κατασκευής συσκευών εισόδου και
εξόδου μπορεί να χρησιμοποιηθεί για την κατασκευή πρωτοτύπων που
απαιτούν μεγάλη υπολογιστική ισχύ κατά την επεξεργασία αλλά και την
είσοδο-έξοδο προς τον χρήστη, αφού εκτός από έναν δυνατό κεντρικό
επεξεργαστή, προσφέρει και μεγάλο εύρος ζώνης στα κανάλια εισόδου και
εξόδου. Αντιθέτως, το Arduino ξεχωρίζει για τη χαμηλή υπολογιστική ισχύ
και το στενό εύρος ζώνης, που όμως έρχονται με μικρότερο κόστος
ενεργειακής λειτουργίας, γεγονός που το κάνει κατάλληλο για την
κατασκευή πρωτοτύπων για συσκευές που πρέπει να έχουν χαμηλή κατανάλωση
ενέργειας, όπως είναι οι φορετοί και οι διάχυτοι υπολογιστές. Στην
πορεία, οι κατασκευαστές των RaspberryPi και Arduino έχουν δημιουργήσει
επιμέρους εκδόσεις των βασικών συστημάτων διευρύνοντας τις δυνατότητές
τους, είτε προς το οικονομία, είτε προς την ισχύ, ενώ υπάρχουν και πολλά
άλλα παρόμοια συστήματα από ανταγωνιστές.</p>
<section id="footnotes" class="footnotes footnotes-end-of-section"
role="doc-endnotes">
<hr />
<ol start="7">
<li><div id="fn7">
<p>fig:chorded-input<a href="#fnref7" class="footnote-back"
role="doc-backlink">↩︎</a></p>
</div></li>
<li><div id="fn8">
<p>fig:vpl-data-glove<a href="#fnref8" class="footnote-back"
role="doc-backlink">↩︎</a></p>
</div></li>
<li><div id="fn9">
<p>fig:trackball<a href="#fnref9" class="footnote-back"
role="doc-backlink">↩︎</a></p>
</div></li>
<li><div id="fn10">
<p>fig:telefunken-ball-mouse<a href="#fnref10" class="footnote-back"
role="doc-backlink">↩︎</a></p>
</div></li>
<li><div id="fn11">
<p>fig:tv-typewriter<a href="#fnref11" class="footnote-back"
role="doc-backlink">↩︎</a></p>
</div></li>
<li><div id="fn12">
<p>fig:teletext<a href="#fnref12" class="footnote-back"
role="doc-backlink">↩︎</a></p>
</div></li>
<li><div id="fn13">
<p><span class="citation" data-cites="o2004physical">O’Sullivan και Igoe
(2004)</span><a href="#fnref13" class="footnote-back"
role="doc-backlink">↩︎</a></p>
</div></li>
<li><div id="fn14">
<p><span class="citation" data-cites="igoe2007making">Igoe
(2007)</span><a href="#fnref14" class="footnote-back"
role="doc-backlink">↩︎</a></p>
</div></li>
<li><div id="fn15">
<p>fig:makey_makey_front<a href="#fnref15" class="footnote-back"
role="doc-backlink">↩︎</a></p>
</div></li>
<li><div id="fn16">
<p>fig:minecraft-pi<a href="#fnref16" class="footnote-back"
role="doc-backlink">↩︎</a></p>
</div></li>
</ol>
</section>
<h2 id="σύνθετα-στυλ-διάδρασης">Σύνθετα στυλ διάδρασης</h2>
<p>Στο ερευνητικό σύστημα NLS (oN-Line System) του Stanford Research
Institute (SRI), για πρώτη φορά, τα συστήματα εισόδου και εξόδου του
χρήστη είχαν ενδιάμεσα επίπεδα αφαιρετικότητας, τα οποία επέτρεπαν τον
έλεγχο διαφορετικών τύπων πληροφορίας (π.χ., κειμένου και γραφικών)
καθώς και διαφορετικές συνθέσεις και οργανώσεις της πληροφορίας, από μια
συσκευή εισόδου όπως το ποντίκι.</p>
<p>Η δημοφιλής επιφάνεια εργασίας είναι ένα σύνθετο στυλ διάδρασης με
τον χρήστη, που στηρίζεται στον απευθείας χειρισμό (π.χ, εικονίδια που
αντιπροσωπεύουν φακέλους και εργασίες) αλλά περιέχει και μενού (π.χ.,
για τις επιμέρους λειτουργίες πάνω σε ένα αρχείο ή φάκελο), φόρμες
(π.χ., για τις επιμέρους ρυθμίσεις μιας εφαρμογής ή του λειτουργικού
συστήματος), καθώς και γραμμή εντολών (π.χ., για την αναζήτηση αρχείων ή
για άνοιγμα εφαρμογών). Επίσης, από την πλευρά των συσκευών εισόδου, η
επιφάνεια εργασίας μπορεί να λειτουργήσει με διαφορετικούς τρόπους
(π.χ., ποντίκι, πληκτρολόγιο, φωνή, γραφή, πένα, κτλ.) και ανάλογα με
τις ανάγκες και προτιμήσεις του χρήστη. Η ανάγκη συνδυασμού των
διαφορετικών στυλ διάδρασης δείχνει ότι δεν υπάρχει κάποιο που να
υπερτερεί έναντι των άλλων, αλλά όλα παίζουν έναν διαφορετικό ρόλο
ανάλογα με τις ανάγκες και τους σκοπούς του χρήστη.</p>
<figure id="fig:menus-on-windows">
<img src="../images/menus-on-windows.png"
alt="Σε ένα παραθυρικό περιβάλλον εργασίας τα μενού μπορούν να βρίσκονται στην κορυφή των παραθύρων την εφαρμογής, το οποίο προσφέρει μια συνοχή ειδικά όταν έχουμε πολλά ανοικτά, ορατά, και επικαλυπτόμενα παράθυρα, αλλά ταυτόχρονα κάνει κάπως δυσκολότερη την επιλογή των μενού με τον δείκτη του ποντικιού. Αυτή η σχεδίαση είναι η πιο δημοφιλής καθώς χρησιμοποιείται από τα Microsoft Windows και από πολλές εκδοχές στα παραθυρικά περιβάλλοντα του Linux, ενώ ήταν και η πρώτη που δοκιμάστηκε εργαστηριακά από τους σχεδιαστές του Apple Liza." />
<figcaption aria-hidden="true">Σε ένα παραθυρικό περιβάλλον εργασίας τα
μενού μπορούν να βρίσκονται στην κορυφή των παραθύρων την εφαρμογής, το
οποίο προσφέρει μια συνοχή ειδικά όταν έχουμε πολλά ανοικτά, ορατά, και
επικαλυπτόμενα παράθυρα, αλλά ταυτόχρονα κάνει κάπως δυσκολότερη την
επιλογή των μενού με τον δείκτη του ποντικιού. Αυτή η σχεδίαση είναι η
πιο δημοφιλής καθώς χρησιμοποιείται από τα Microsoft Windows και από
πολλές εκδοχές στα παραθυρικά περιβάλλοντα του Linux, ενώ ήταν και η
πρώτη που δοκιμάστηκε εργαστηριακά από τους σχεδιαστές του Apple
Liza.</figcaption>
</figure>
<figure id="fig:menus-on-top">
<img src="../images/menus-on-top.png"
alt="Σε ένα παραθυρικό περιβάλλον εργασίας τα μενού μπορούν να βρίσκονται στην κορυφή της οθόνης, με αυτήν την επιλογή να είναι αντικειμενικά περισσότερο εργονομική προς τον χρήστη, χωρίς όμως να έχει κερδίσει την αντίστοιχη αποδοχή στην αγορά, αν και ήταν η πρώτη σχεδίαση που έγινε διαθέσιμη εμπορικά με τον Apple Macintosh." />
<figcaption aria-hidden="true">Σε ένα παραθυρικό περιβάλλον εργασίας τα
μενού μπορούν να βρίσκονται στην κορυφή της οθόνης, με αυτήν την επιλογή
να είναι αντικειμενικά περισσότερο εργονομική προς τον χρήστη, χωρίς
όμως να έχει κερδίσει την αντίστοιχη αποδοχή στην αγορά, αν και ήταν η
πρώτη σχεδίαση που έγινε διαθέσιμη εμπορικά με τον Apple
Macintosh.</figcaption>
</figure>
<p>Το σύνθετο στυλ διάδρασης της επιφάνειας εργασίας (WIMP: Windows,
Icons, Menus, Pointer) εκτός από τα παράθυρα και τα εικονίδια περιέχει
και μενού που μπορεί να επιλέξει ο χρήστης και να εξερευνήσει με τη
βοήθεια του δείκτη του ποντικιού ή με ανάλογη συσκευή εισόδου. Τα μενού
αλλάζουν περιεχόμενο ανάλογα με την εφαρμογή χρήστη που είναι στο
προσκήνιο, αλλά η σημαντικότερη διαφορά ανάμεσα στα διαθέσιμα
λειτουργικά συστήματα αφορά στη θέση τους, που μπορεί να είναι είτε πάνω
στο παράθυρο της εφαρμογής (π.χ., Microsoft Windows) είτε στην κορυφή
της οθόνης (π.χ., Apple Mac OS). Τα παραθυρικά συστήματα πάνω από το
λειτουργικό σύστημα Linux ακολουθούν έναν από τους δύο τρόπους, με
αποτέλεσμα να δημιουργείται μια ασυνέπεια μεταξύ τους, ακόμη και σε αυτό
το βασικό στυλ διάδρασης (μενού). Αν και τα περισσότερα στοιχεία της
διάδρασης με τον χρήστη εμπεριέχουν και στοιχεία συνήθειας και
προτίμησης, τα μενού στην κορυφή της οθόνης είναι πιο εργονομικά, αφού ο
δείκτης δεν μπορεί να κινηθεί πέρα από αυτήν. <a href="#fn17"
id="fnref17" class="footnote-ref" role="doc-noteref"><sup>17</sup></a>
<a href="#fn18" id="fnref18" class="footnote-ref"
role="doc-noteref"><sup>18</sup></a></p>
<p>Η πολυτροπική διάδραση (multimodal interaction) είναι η πιο
ανθρωποκεντρική προσπάθεια για τη διάδραση, αφού προσπαθεί να
χρησιμοποιήσει παράλληλα και συνθετικά όλα τα διαθέσιμα κανάλια
επικοινωνίας ανάμεσα στον άνθρωπο και τον υπολογιστή. Αρχικά εφαρμόστηκε
για να δώσει καθολική πρόσβαση στους υπολογιστές σε χρήστες που είχαν
διαφορετικές ικανότητες. Για παράδειγμα, ένας χρήστης που δε βλέπει
μπορεί να χρησιμοποιήσει μια συσκευή εισόδου, όπως ένα ποντίκι που
παρέχει και ανάδραση με δόνηση, έτσι ώστε να μπορεί να κάνει επιλογές σε
μενού. Στην πορεία, διαπιστώθηκε ότι οι διαφορετικές ικανότητες των
χρηστών δεν περιορίζονται μόνο σε επιμέρους ομάδες ανθρώπων, αλλά
μπορούν να γενικευτούν σε πολλά πλαίσια χρήσης. Για παράδειγμα, ένας
χρήστης καθώς οδηγεί αυτοκίνητο, μπορεί να θεωρηθεί ότι δε βλέπει την
οθόνη διάδρασης του αυτοκινήτου. Επιπλέον, η πολυτροπική διάδραση
δημιούργησε ένα νέο επαυξημένο επίπεδο αναφοράς σχετικά με την αντίληψη
που έχουμε για τις ανθρώπινες αισθήσεις, τις οποίες μπορούμε πλέον να
χειριστούμε ως απλές διεπαφές για την πληροφορία, ανεξάρτητα από τη φύση
της πληροφορίας. Για παράδειγμα, η αίσθηση της δόνησης μπορεί να
χρησιμοποιηθεί ως διεπαφή για να μεταφέρει σε έναν χρήστη την πληροφορία
της γεωγραφικής κατεύθυνσης. Με αυτόν τον τρόπο οι υπάρχουσες αισθήσεις
του ανθρώπου μπορούν να επαυξηθούν με νέες αισθήσεις, των οποίων τη
διάδραση με το περιβάλλον μπορούμε να προγραμματίσουμε και να
εκπαιδεύσουμε τους χρήστες στο να τη χρησιμοποιούν.</p>
<p>Ο συνδυασμός των συστημάτων εισόδου και εξόδου έχει επιτρέψει τη
δημιουργία μιας σειράς από επιτυχημένα στυλ διάδρασης, τα οποία
εμφανίζονται είτε ανεξάρτητα είτε σε σύνθετες μορφές. Το πιο παλιό στυλ
διάδρασης είναι η γραμμή εντολών, σύμφωνα με το οποίο ο χρήστης
πληκτρολογεί τις εντολές. Η φόρμα είναι ένα εξίσου παλιό στυλ διάδρασης,
αφού μπορεί να εμφανιστεί ακόμη και σε τερματικά κειμένου, ενώ το ίδιο
ισχύει και για το μενού εντολών. Ο απευθείας χειρισμός βασίζεται είτε
στην αφή, είτε σε μια συσκευή εισόδου όπως η πένα και το ποντίκι, καθώς
και σε εικονίδια που αναπαριστούν αντικείμενα και δράσεις. Η φυσική
γλώσσα βασίζεται στην απευθείας αναγνώριση της ανθρώπινης γλώσσας από
τον υπολογιστή και έχει πολλές μορφές, όπως την αναγνώριση κειμένου από
το πληκτρολόγιο, και την αναγνώριση γραφής και ομιλίας. Η επαυξημένη
πραγματικότητα επιτρέπει την διάδραση με ψηφιακά αντικείμενα τα οποία
φαίνονται να εμφανίζονται πάνω στον πραγματικό κόσμο, όπως αυτός
φαίνεται μέσα από μια κάμερα. Τέλος, η εικονική πραγματικότητα είναι ένα
στυλ διάδρασης που προσομοιώνει τη διάδραση του ανθρώπου με τον
πραγματικό κόσμο και απαιτεί την χρήση συσκευών εμβύθησης.</p>
<p>Ένα παράδειγμα σύνθετης διάδρασης, η οποία κάνει ένα βήμα μπροστά και
εμπλουτίζει την επιφάνεια εργασίας με περισσότερες κινήσεις από το
ανθρώπινο ρεπερτόριο, είναι αυτό του υπολογιστή ταμπλέτας με είσοδο από
πένα. Το σύστημα αυτό παρουσιάζει ένα πλεονέκτημα τουλάχιστον στις
διεργασίες επεξεργασίας κειμένου, καθώς ο χρήστης δε χρειάζεται να πάρει
το χέρι του από το πληκτρολόγιο και να μετακινήσει το ποντίκι για να
επιλέξει μια επιπλέον λειτουργία. Αντί αυτής της εναλλαγής των δύο
διαφορετικών συσκευών εισόδου, η διάδραση με την ταμπλέτα και την πένα
επιτρέπει τη χρήση φυσικής γλώσσας για τη συγγραφή με την πένα, ενώ η
πένα μπορεί να λειτουργήσει και ως δείκτης, ώστε να γίνει η επιλογή
κάποιας επιπλέον λειτουργίας.</p>
<p>Σε έναν επιτραπέζιο υπολογιστή με πληκτρολόγιο, ποντίκι και οθόνη δύο
διαστάσεων συνήθως έχουμε τα παράθυρα και την επιφάνεια εργασίας ως
βασική αναλογία/μεταφορά της διάδρασης με τον χρήστη. Στην κατηγορία
αυτή εμπίπτουν πολλά συστήματα τα οποία μπορεί να έχουν επιμέρους
διαφορές τόσο στην εμφάνιση όσο και στη λειτουργία τους. Για παράδειγμα,
η πιο απλή επιφάνεια εργασίας στο λειτουργικό σύστημα UNIX (που
βασίζεται στο παραθυρικό σύστημα X-Windows) χρησιμοποιεί τα παράθυρα για
να οργανώσει εφαρμογές, οι οποίες έχουν διεπαφή με κείμενο και όχι με
εικονίδια. Φυσικά, υπάρχουν παραθυρικά συστήματα στο UNIX τα οποία είναι
εξίσου πλούσια με αυτά που συναντάμε στα εμπορικά συστήματα (π.χ., MAC
OS X, Microsoft Windows), όμως ένα μεγάλο μέρος του πλαισίου χρήσης του
UNIX αφορά λειτουργίες διαχείρισης συστήματος στα χαμηλότερα επίπεδα
(π.χ., χρήστες, βάση δεδομένων, δίκτυα, κτλ.), λειτουργίες που έχουν
μεγάλο όφελος από την ύπαρξη ενός πλήρους παραθυρικού περιβάλλοντος. Το
συμπέρασμα από αυτό το παράδειγμα είναι ότι τα παράθυρα είναι απλώς ένα
από τα αρχέτυπα διάδρασης που συνιστούν την επιφάνεια εργασίας στους
επιτραπέζιους υπολογιστές, και με τον κατάλληλο συνδυασμό των επιμέρους
αρχετύπων διάδρασης, η επιφάνεια εργασίας μπορεί να εξυπηρετήσει
διαφορετικούς χρήστες και τις ανάγκες τους.</p>
<p>Ανάμεσα στους πολλούς τρόπους για να ταξινομήσουμε τις συσκευές
εισόδου ξεχωρίζουμε τη διάκριση στις κατηγορίες της άμεσης και της
έμμεσης διάδρασης. Το ποντίκι είναι ο βασικός εκπρόσωπος της έμμεσης
διάδρασης, αφού για να μετακινήσουμε τον δείκτη σε μια συσκευή εξόδου
(π.χ., οθόνη) μετακινούμε μια διαφορετική συσκευή, όπως είναι το
ποντίκι. Από την άλλη πλευρά, η οθόνη αφής ανήκει στις συσκευές εισόδου
άμεσης διάδρασης, αφού για να επιλέξουμε έναν στόχο ή για να
μετακινήσουμε ένα αντικείμενο το κάνουμε απευθείας με τα χέρια μας πάνω
στην οθόνη, χωρίς να μεσολαβεί κάποια ενδιάμεση μετάφραση. Από την άποψη
της διάκρισης σε άμεσες και έμμεσες συσκευές, ιδιαίτερο ενδιαφέρον έχει
και η συσκευή εισόδου της πένας, η οποία μπορεί να ανήκει και στις δύο
κατηγορίες. <a href="#fn19" id="fnref19" class="footnote-ref"
role="doc-noteref"><sup>19</sup></a> <a href="#fn20" id="fnref20"
class="footnote-ref" role="doc-noteref"><sup>20</sup></a></p>
<figure id="fig:hand-occlusion">
<img src="../images/hand-occlusion.png"
alt="Η άμεση διάδραση με συσκευές αφής έχει το μειονέκτημα ότι το χέρι ή τα δάκτυλα μπορεί να καλύπτουν τον στόχο (ή το αντικείμενο) που θέλουμε να επιλέξουμε ή και να μετακινήσουμε, φαινόμενο γνωστό ως occlusion (έμφραξη), εκτός αν αυτό είναι αρκετά μεγάλο ή χρησιμοποιηθούν τεχνικές που αναιρούν το occlusion." />
<figcaption aria-hidden="true">Η άμεση διάδραση με συσκευές αφής έχει το
μειονέκτημα ότι το χέρι ή τα δάκτυλα μπορεί να καλύπτουν τον στόχο (ή το
αντικείμενο) που θέλουμε να επιλέξουμε ή και να μετακινήσουμε, φαινόμενο
γνωστό ως occlusion (έμφραξη), εκτός αν αυτό είναι αρκετά μεγάλο ή
χρησιμοποιηθούν τεχνικές που αναιρούν το occlusion.</figcaption>
</figure>
<figure id="fig:media-scrub">
<img src="../images/media-scrub.png"
alt="Η άμεση διάδραση πάνω σε μια οθόνη αφής δεν επιτρέπει τον έλεγχο του ρυθμού μετακίνησης, αλλά αυτό μπορεί να γίνει εφικτό τουλάχιστον για την περίπτωση της γραμμικής μετακίνησης, αν ο ρυθμός αντιπροσωπεύεται από μια άλλη ορθογωνική κίνηση του δακτύλου, όπως για παράδειγμα στην περίπτωση της αναζήτησης στον οριζόντιο χρόνο οπτικοακουστικού περιεχομένου, όπου ο ρυθμός αλλάζει με την κατακόρυφη θέση του δακτύλου." />
<figcaption aria-hidden="true">Η άμεση διάδραση πάνω σε μια οθόνη αφής
δεν επιτρέπει τον έλεγχο του ρυθμού μετακίνησης, αλλά αυτό μπορεί να
γίνει εφικτό τουλάχιστον για την περίπτωση της γραμμικής μετακίνησης, αν
ο ρυθμός αντιπροσωπεύεται από μια άλλη ορθογωνική κίνηση του δακτύλου,
όπως για παράδειγμα στην περίπτωση της αναζήτησης στον οριζόντιο χρόνο
οπτικοακουστικού περιεχομένου, όπου ο ρυθμός αλλάζει με την κατακόρυφη
θέση του δακτύλου.</figcaption>
</figure>
<p>Αν και σε πρώτη ανάγνωση οι συσκευές άμεσης διάδρασης φαίνεται να
έχουν πολλά πλεονεκτήματα, τουλάχιστον αναφορικά με την ευκολία
εκμάθησής τους, υπάρχουν πολλές περιπτώσεις όπου μια συσκευή έμμεσης
διάδρασης υπερτερεί. Για παράδειγμα, η επιλογή μικρών στόχων ή ακόμη
δυσκολότερα ο χειρισμός τους με άμεση διάδραση (π.χ., πάνω σε μια οθόνη
αφής) δεν είναι εύκολος, εκτός αν υπάρχει ειδική υποστήριξη από το
αντίστοιχο λογισμικό. Για το τελευταίο, χαρακτηριστική περίπτωση είναι η
μικρομετρική αναζήτηση πάνω στον χρόνο για ένα βίντεο ή για ένα μουσικό
τραγούδι. Εκτός από το ποντίκι, οι ερευνητές δοκίμασαν και άλλες
συσκευές εισόδου όπως την πένα, η οποία επιτρέπει τόσο άμεση όσο και
έμμεση διάδραση.</p>
<p>Η επιφάνεια εργασίας σε συνδυασμό με τις συσκευές εισόδου ποντίκι και
πληκτρολόγιο αντιπροσωπεύει ένα στυλ διάδρασης με τον χρήστη δημοφιλές
στους επιτραπέζιους υπολογιστές γραφείου, καθώς είναι μια κοντινή
μεταφορά του πλαισίου εργασίας του χρήστη. Όταν οι υπολογιστές βρίσκουν
εφαρμογή εκτός του πλαισίου του γραφείου είναι επόμενο να χρειαζόμαστε
διαφορετικά μοντέλα διάδρασης, τα οποία ναι μεν θα ανταποκρίνονται στις
βασικές ιδιότητες του ανθρώπου (που δεν είναι πολύ διαφορετικές
ανεξάρτητα από το πλαίσιο χρήσης), αλλά θα ταιριάζουν και στο αντίστοιχο
πλαίσιο και στις ανάγκες που αυτό δημιουργεί, οι οποίες μπορεί να είναι
πολύ διαφορετικές σε σχέση με εκείνες της χρήσης εντός του γραφείου.</p>
<p>Αν και η τεχνολογία των υπολογιστών έχει κάνει πολύ μεγάλη ποσοτική
πρόοδο αναφορικά με την ταχύτητα και το μέγεθος των δεδομένων που
μπορούν να επεξεργαστούν, την ίδια στιγμή, η πρόοδος αυτή δεν έχει
μεγάλο αντίκρισμα στην ποιότητα της διάδρασης ανθρώπου και υπολογιστή. Η
ποιότητα της διάδρασης εξαρτάται, τόσο από τον υπολογιστή, όσο και από
τον άνθρωπο. Μπορούμε να σκεφτούμε και να δημιουργήσουμε πολλές
διαφορετικές συσκευές εισόδου και εξόδου για την επικοινωνία με τον
άνθρωπο, όμως αν αυτές δεν είναι συμβατές με τις ανάγκες του, ή αν δεν
γίνουν αποδεκτές, τότε δεν έχουμε πετύχει κάποια πρόοδο. Επομένως, η
πρόκληση που παραμένει ανοικτή είναι να κατασκευάσουμε εκείνες τις
συσκευές εισόδου και εξόδου που είναι κατάλληλες για τις ανάγκες του
ανθρώπου και των δραστηριοτήτων του.</p>
<p>Το συμπέρασμα από τη σύγκριση της καθιερωμένης διάδρασης με την
επιφάνεια εργασίας και των δυνατοτήτων του ανθρώπου μας δίνει νέους
ορίζοντες για το πεδίο ορισμού του φαινομένου της διάδρασης. Το
διευρυμένο πεδίο ορισμού της διάδρασης μπορεί να προσδιοριστεί με βάση
τις δυνατότητες του ανθρώπου που δεν έχουν ακόμη ρόλο σε συνδυασμό με
ένα νέο πλαίσιο χρήσης, πέρα από το γραφείο και τον επιτραπέζιο
υπολογιστή.</p>
<section id="footnotes" class="footnotes footnotes-end-of-section"
role="doc-endnotes">
<hr />
<ol start="17">
<li><div id="fn17">
<p>fig:menus-on-windows<a href="#fnref17" class="footnote-back"
role="doc-backlink">↩︎</a></p>
</div></li>
<li><div id="fn18">
<p>fig:menus-on-top<a href="#fnref18" class="footnote-back"
role="doc-backlink">↩︎</a></p>
</div></li>
<li><div id="fn19">
<p>fig:hand-occlusion<a href="#fnref19" class="footnote-back"
role="doc-backlink">↩︎</a></p>
</div></li>
<li><div id="fn20">
<p>fig:media-scrub<a href="#fnref20" class="footnote-back"
role="doc-backlink">↩︎</a></p>
</div></li>
</ol>
</section>
<h2 id="η-περίπτωση-του-apple-ipod">Η περίπτωση του Apple iPod</h2>
<p>Η περίπτωση της συσκευής αναπαραγωγής μουσικής iPod σήμανε την αρχή
της γρήγορης μετατόπισης της διάδρασης από τον επιτραπέζιο προς τον
κινητό και διάχυτο υπολογισμό. Η μετάβαση του υπολογισμού από τον
επιτραπέζιο στον κινητό συνοδεύτηκε από μια ριζική αναθεώρηση τόσο των
συστημάτων εισόδου όσο και των μοντέλων διάδρασης.</p>
<figure id="fig:ipod_1g">
<img src="../images/ipod_1g.png"
alt="Η πρώτη γενιά iPod εισάγει έναν νέο τρόπο πλοήγησης σε μεγάλες λίστες (μενού) αρχείων μουσικής, τον περιστρεφόμενο τροχό. Ταυτόχρονα, λειτούργησε ως δούρειος ίππος για την σταδιακή εισαγωγή και εξοικείωση των χρηστών με κινητές συσκευές διάδρασης που συνδέονται με τον προσωπικό υπολογιστή." />
<figcaption aria-hidden="true">Η πρώτη γενιά iPod εισάγει έναν νέο τρόπο
πλοήγησης σε μεγάλες λίστες (μενού) αρχείων μουσικής, τον περιστρεφόμενο
τροχό. Ταυτόχρονα, λειτούργησε ως δούρειος ίππος για την σταδιακή
εισαγωγή και εξοικείωση των χρηστών με κινητές συσκευές διάδρασης που
συνδέονται με τον προσωπικό υπολογιστή.</figcaption>
</figure>
<figure id="fig:itunes3">
<img src="../images/itunes3.png"
alt="Το iTunes, αν και ξεκίνησε ως μια ταπεινή εφαρμογή εκτέλεσης μουσικών αρχείων και συγχρονισμού τους με το iPod, μετατράπηκε σε Δούρειο Ίππο για τη μεταφόρτωση εφαρμογών και τον συγχρονισμό με το οικοσύστημα των κινητών συσκευών χρήστη." />
<figcaption aria-hidden="true">Το iTunes, αν και ξεκίνησε ως μια ταπεινή
εφαρμογή εκτέλεσης μουσικών αρχείων και συγχρονισμού τους με το iPod,
μετατράπηκε σε Δούρειο Ίππο για τη μεταφόρτωση εφαρμογών και τον
συγχρονισμό με το οικοσύστημα των κινητών συσκευών χρήστη.</figcaption>
</figure>
<p>Η πρώτη έκδοση του iPod περιέχει έναν μικρό σκληρό δίσκο και
λειτουργεί ως συσκευή αποθήκευσης αρχείων, όπως πολλές αντίστοιχες
εμπορικές συσκευές εκείνης της εποχής, με τη διαφορά ότι ο
περιστρεφόμενος τροχός επιτρέπει τη γρήγορη πλοήγηση σε μεγάλες λίστες
μουσικών αρχείων.<a href="#fn21" id="fnref21" class="footnote-ref"
role="doc-noteref"><sup>21</sup></a> Οι άλλες συσκευές της κατηγορίας
του αντί για τον τροχό έχουν πλήκτρα βήματος, τα οποία είναι πιο
δύσχρηστα, ειδικά στην περίπτωση που ο σκληρός δίσκος είναι γεμάτος με
μουσικά αρχεία. Οι περισσότερες ανταγωνιστικές συσκευές εισόδου
βασίζονται σε μια απευθείας απεικόνιση (direct mapping) της λίστας
πολυμεσικών αρχείων με τα κουμπιά εισόδου, τα οποία είναι οργανωμένα
κατακόρυφα. Αν και ο τροχός κύλισης του iPod παραβαίνει τον κανόνα της
απευθείας απεικόνισης αποδικνύεται περισσότερο εύχρηστος, γιατί πολύ
γρήγορα οι χρήστες καταλαβαίνουν ότι με την περιστροφή του τροχού
μπορούν να κινηθούν πάνω-κάτω, και ακόμη γρηγορότερα μπορούν να
επιλέξουν ένα αρχείο από την λίστα, γιατί ο τροχός προσφέρει εκτός από
τον έλεγχο της κατεύθυνσης και τον έλεγχο της επιτάγχυνσης.</p>
<p>Βλέπουμε, λοιπόν, ότι η επιτυχία (κατά ένα μέρος) οφείλεται στη
δημιουργία μιας νέας συσκευής εισόδου που δίνει έμφαση στην πιο συχνή
διεργασία του χρήστη. Όπως ακριβώς το ποντίκι ήρθε να διευκολύνει την
επιλογή κειμένου στην οθόνη και το έκανε αποδεδειγμένα πολύ καλύτερα από
όλες τις εναλλακτικές (όπως είδαμε στην ερευνητική μελέτη περίπτωσης),
έτσι και ο τροχός του πρώτου iPod είναι ο πιο αποτελεσματικός τρόπος για
την επιλογή μέσα σε λίστες με πολλές καταχωρήσεις. Κάποιος θα μπορούσε
να προσθέσει ότι πέρα από λειτουργικός, ο τροχός του iPod είναι και
διασκεδαστικός, αφού θυμίζει την κίνηση που κάνουν οι DJs, όταν
διαλέγουν μουσική.</p>
<p>Ένα ακόμη στοιχείο που συνέβαλε στην επιτυχία του iPod ήταν η
ολοκλήρωσή του με ένα σύστημα διανομής μουσικής που περιλάμβανε μια
εφαρμογή επιτραπέζιου υπολογιστή, καθώς και ένα ηλεκτρονικό κατάστημα.
Στα τέλη της δεκαετίας του 1990, η επικράτηση των αρχείων μουσικής τύπου
MP3 και η εύκολη διανομή τους μέσω του δικτύου, επέτρεψε στους χρήστες
να συγκεντρώσουν πολύ μεγάλες συλλογές μουσικών αρχείων, που ήταν
δύσκολο να οργανώσουν και να ακούσουν. Η εφαρμογή iTunes και το
αντίστοιχο ηλεκτρονικό κατάστημα επεδίωξε να λύσει αυτό το πρόβλημα και
το έκανε με μεγάλη επιτυχία, ενώ ταυτόχρονα το iTunes έγινε η πύλη για
την εισαγωγή νέων πολυμεσικών αρχείων πέρα από τη μουσική, όπως βίντεο
και φωτογραφίες, και αργότερα εφαρμογές για την κατηγορία των έξυπνων
κινητών (iPod Touch, iPhone).</p>
<p>Η εφαρμογή iTunes,<a href="#fn22" id="fnref22" class="footnote-ref"
role="doc-noteref"><sup>22</sup></a> εκτός από το να οργανώνει και να
διανέμει τα πολυμεσικά πλέον αρχεία του χρήστη, μετατρέπεται σταδιακά
στον Δούρειο Ίππο που θα φέρει τις κινητές εφαρμογές στη συσκευή του
χρήστη. Οι πρώτες εκδόσεις του iTunes είναι επιτραπέζιες εφαρμογές
εκτέλεσης μουσικών αρχείων και συγχρονισμού με το iPod, ενώ οι
τελευταίες εκδόσεις συνδέονται και ενημερώνουν το λογισμικό για όλες τις
κινητές συσκευές του χρήστη (π.χ., smart phone, tablet, smart watch,
κτλ.). Ταυτόχρονα, συνδέονται και με τα οικιακά συστήματα ψυχαγωγίας,
όπως ηχεία και τηλεόραση, ώστε να επιτρέψουν την εκτέλεση των
πολυμεσικών αρχείων σε συσκευές εξόδου υψηλότερης πιστότητας σε σχέση με
εκείνες του επιτραπέζιου υπολογιστή.</p>
<p>Ένα σημαντικό μάθημα που μας δίνει η ιστορία του iPod είναι πως τα
σύγχρονα διαδραστικά συστήματα δε στέκονται από μόνα τους, αλλά
λειτουργούν σε ένα οικοσύστημα συσκευών και εφαρμογών. Ένα ακόμη μάθημα
είναι πως η εισαγωγή της καινοτομίας πρέπει να γίνει τόσο σταδιακά που η
μετάβαση να είναι διαφανής για τον τελικό χρήστη. Όταν οι πρώτοι χρήστες
του iPod έβαζαν το iTunes ήθελαν απλώς να οργανώσουν καλύτερα τη μουσική
τους, ένα πρόβλημα που ήδη αντιμετώπιζαν στον επιτραπέζιο υπολογιστή.
Καθώς απέκτησαν οικειότητα με το iTunes, το είδαν να μεταμορφώνεται σε
ένα πολυεργαλείο για όλες τις κινητές συσκευές τους.</p>
<section id="footnotes" class="footnotes footnotes-end-of-section"
role="doc-endnotes">
<hr />
<ol start="21">
<li><div id="fn21">
<p>fig:ipod_1g<a href="#fnref21" class="footnote-back"
role="doc-backlink">↩︎</a></p>
</div></li>
<li><div id="fn22">
<p>fig:itunes3<a href="#fnref22" class="footnote-back"
role="doc-backlink">↩︎</a></p>
</div></li>
</ol>
</section>
<h2 id="η-περίπτωση-των-καθημερινών-πραγμάτων">Η περίπτωση των
καθημερινών πραγμάτων</h2>
<p>Η κατανόηση και η χρήση μιας συσκευής διέπεται από μερικές βασικές
και διαχρονικές αξίες που είναι οι ίδιες ανεξάρτητα από το είδος και την
πολυπλοκότητα που μπορεί να έχει η διάδραση ανθρώπου υπολογιστή. Στο
κλασικό βιβλίο του “Η Σχεδίαση των Καθημερινών Πραγμάτων” ο Ντον Νόρμαν
παραθέτει ένα μικρό σύνολο από βασικές αξίες και δίνει παραδείγματα
καλής και κακής εφαρμογής σε καθημερινά απλά αντικείμενα, όπως πόρτες
και υδραυλικά. Οι βασικές αξίες που πρέπει να έχει μια συσκευή, ώστε να
είναι κατανοητή και εύχρηστη κατά τη διάδραση με τον άνθρωπο, είναι:
affordance, constraint, mapping, feedback. Το affordance αναφέρεται στις
περισσότερο ή λιγότερο προφανείς χρήσεις που επιτρέπει η ίδια η εμφάνιση
και λειτουργία ενός αντικειμένου. Το constraint αναφέρεται στους
περιορισμούς που σκόπιμα εισάγει ο σχεδιασμός, ώστε να εμποδίσει κάποιες
χρήσεις ή να αποτρέψει το λάθος κατά την σωστή χρήση. Το mapping
αναφέρεται στη φυσική σύνδεση ανάμεσα στις καταστάσεις λειτουργίας και
στον έλεγχο από την πλευρά του χρήστη.<a href="#fn23" id="fnref23"
class="footnote-ref" role="doc-noteref"><sup>23</sup></a> Τέλος, το
feedback αναφέρεται στην συνεχή ανάδραση του συστήματος, ώστε να είναι
πάντα γνωστή η κατάστασή του στον χρήστη.</p>
<p>Η διαπίστωση που επιβεβαιώνεται διαχρονικά στη σχεδίαση των
καθημερινών πραγμάτων<a href="#fn24" id="fnref24" class="footnote-ref"
role="doc-noteref"><sup>24</sup></a> είναι ότι οι κατασκευαστές
επαναλαμβάνουν τα ίδια λάθη με την παράλειψη των βασικών αξιών και ότι
οι αξίες αυτές έχουν μείνει αναλλοίωτες. Οι κατασκευαστές κάνουν τα ίδια
λάθη, γιατί κάθε φορά που έχουμε μια νέα τεχνολογική επανάσταση, η
κατασκευή της διάδρασης γίνεται συνήθως από τους κατασκευαστές που έχουν
οικειότητα με τη νέα τεχνολογία και οι οποίοι συνήθως είναι είτε νέοι
είτε επικεντρωμένοι μόνο στην τεχνολογία. Οι βασικές αξίες έχουν μείνει
οι ίδιες, γιατί ο άνθρωπος αλλάζει πολύ πιο αργά από όσο η τεχνολογία.
Τελικά, ο στόχος της ανθρωποκεντρικής κατασκευής συστημάτων είναι να
βρούμε μια ισορροπία ανάμεσα σε όλες τις δυνάμεις που επηρεάζουν τη
σχεδίαση, την κατασκευή, τη διανομή, και τη χρήση των συσκευών
διάδρασης. Για παράδειγμα, ο σχεδιασμός του τυπικού πληκτρολογίου QWERTY
δεν είναι βέλτιστος για την πληκτρολόγηση όσο το σύστημα DVORAK, αλλά
επικράτησε γιατί στα πρώτα στάδια διάδοσης των υπολογιστών με
πληκτρολόγιο, αυτά ήταν διαθέσιμα και οικεία.<a href="#fn25"
id="fnref25" class="footnote-ref"
role="doc-noteref"><sup>25</sup></a></p>
<p>Καθώς η χρήση του υπολογιστή ξέφυγε από το στενό πλαίσιο της εργασίας
και από την αντίληψη του υπολογιστή ως απλού εργαλείο -όπου η απαίτηση
για χρησιμότητα και ευχρηστία είναι κυρίαρχη- δημιουργήθηκε η ανάγκη για
ένα νέο αξιακό σύστημα που να βασίζεται περισσότερο στα συναισθήματα του
ανθρώπου, και να εμπλέκει πιο πολλές ανθρώπινες αισθήσεις. Τόσο οι
ερευνητικές μελέτες όσο και τα εμπορικά προϊόντα προς το τέλος της
δεκαετίας του 2000 άρχισαν να δίνουν έμφαση όχι μόνο στη γνωστική
επεξεργασία της πληροφορίας αλλά και στα συναισθήματα του ανθρώπου,<a
href="#fn26" id="fnref26" class="footnote-ref"
role="doc-noteref"><sup>26</sup></a> και αντίστοιχα, η περιοχή της
σχεδίασης της διάδρασης ανθρώπου και υπολογιστή αρχίζει να περιγράφεται
και ως σχεδίαση της εμπειρίας του χρήστη.<a href="#fn27" id="fnref27"
class="footnote-ref" role="doc-noteref"><sup>27</sup></a> Με αυτόν τον
τρόπο γίνεται ένα ακόμη βήμα μακρύτερα από την αρχική θεώρηση της
περιοχής της διάδρασης, που ήταν γνωστή ως σχεδίαση της διεπαφής
ανθρώπου και υπολογιστή, όπου η διάδραση γινόταν, για παράδειγμα,
αντιληπτή ως η σχεδίαση των παραθύρων και των εικονιδίων της γραφικής
επιφάνειας εργασίας.</p>
<figure id="fig:mapping-principle">
<img src="../images/mapping-principle.jpg"
alt="Σε μια συσκευή που έχει την έξοδο σε διαφορετικό σημείο από την είσοδο του χρήστη θα πρέπει να υπάρχει μια συνεπής απεικόνιση ανάμεσα στην είσοδο και στην έξοδο, όπως στην περίπτωση των εστιών μιας κουζίνας μαγειρέματος." />
<figcaption aria-hidden="true">Σε μια συσκευή που έχει την έξοδο σε
διαφορετικό σημείο από την είσοδο του χρήστη θα πρέπει να υπάρχει μια
συνεπής απεικόνιση ανάμεσα στην είσοδο και στην έξοδο, όπως στην
περίπτωση των εστιών μιας κουζίνας μαγειρέματος.</figcaption>
</figure>
<figure id="fig:dvorak-keyboard">
<img src="../images/dvorak-keyboard.png"
alt="Η επίτευξη της ευχρηστίας δεν είναι η μόνη απόλυτη αξία καθώς μια συσκευή διάδρασης επηρεάζεται από πολλούς ακόμη παράγοντες, όπως από την αισθητική, το κόστος, αλλά και από τη συνήθεια, η οποία είναι η κύρια αιτία που το πιο συνηθισμένο πληκτρολόγιο για τον επιτραπέζιο υπολογιστή δεν είναι το πιο εύχρηστο. Η οργάνωση των πλήκτρων κάτω από τα δάκτυλα στο πληκτρολόγιο Dvorak έχει γίνει έτσι ώστε τα πιο συχνά γράμματα να βρίσκονται πιο κοντά στα δάκτυλα." />
<figcaption aria-hidden="true">Η επίτευξη της ευχρηστίας δεν είναι η
μόνη απόλυτη αξία καθώς μια συσκευή διάδρασης επηρεάζεται από πολλούς
ακόμη παράγοντες, όπως από την αισθητική, το κόστος, αλλά και από τη
συνήθεια, η οποία είναι η κύρια αιτία που το πιο συνηθισμένο
πληκτρολόγιο για τον επιτραπέζιο υπολογιστή δεν είναι το πιο εύχρηστο. Η
οργάνωση των πλήκτρων κάτω από τα δάκτυλα στο πληκτρολόγιο Dvorak έχει
γίνει έτσι ώστε τα πιο συχνά γράμματα να βρίσκονται πιο κοντά στα
δάκτυλα.</figcaption>
</figure>
<section id="footnotes" class="footnotes footnotes-end-of-section"
role="doc-endnotes">
<hr />
<ol start="23">
<li><div id="fn23">
<p>fig:mapping-principle<a href="#fnref23" class="footnote-back"
role="doc-backlink">↩︎</a></p>
</div></li>
<li><div id="fn24">
<p><span class="citation" data-cites="norman2013design">D. Norman
(2013)</span><a href="#fnref24" class="footnote-back"
role="doc-backlink">↩︎</a></p>
</div></li>
<li><div id="fn25">
<p>fig:dvorak-keyboard<a href="#fnref25" class="footnote-back"
role="doc-backlink">↩︎</a></p>
</div></li>
<li><div id="fn26">
<p><span class="citation" data-cites="norman2004emotional">D. A. Norman
(2004)</span><a href="#fnref26" class="footnote-back"
role="doc-backlink">↩︎</a></p>
</div></li>
<li><div id="fn27">
<p><span class="citation" data-cites="garrett2010elements">Garrett
(2010)</span><a href="#fnref27" class="footnote-back"
role="doc-backlink">↩︎</a></p>
</div></li>
</ol>
</section>
<h2 id="σύντομη-βιογραφία-του-larry-tesler">Σύντομη βιογραφία του Larry
Tesler</h2>
<p>Ο Larry Tesler στην πρώτη προγραμματιστική δουλειά του προσπάθησε να
βελτιώσει την ευχρηστία μιας διεπαφής σχεδίασης γραφικών για μεγάλες
οθόνες σε στάδια ποδοσφαίρου, έτσι ώστε να είναι προσβάσιμη από τους
γραφίστες και όχι μόνο από τους προγραμματιστές. Αν και δεν είχε κάποια
εκπαίδευση σε θέματα ευχρηστίας, στο μέλλον θα έκανε πολλές συνεισφορές
σε αυτήν την περιοχή αρχικά εργαζόμενος στο Xerox PARC και στην Apple
και μετά ως σύμβουλος ευχρηστίας πολλών οργανισμών. Η βασική στόχος του
Larry Tesler είναι ότι μια διεπαφή θα πρέπει να είναι εύκολη για τον
αρχάριο και ευκαιριακό χρήστη, φιλοσοφία που τελικά επικράτησε στον
κλάδο της σχεδίασης της διάδρασης.</p>
<figure id="fig:tesler-profile">
<img src="../images/tesler-profile.jpg"
alt="Ο Larry Tesler κατασκεύασε λογισμικό με έμφαση στην προσβασιμότητα από απλούς χρήστες. Η πιο σημαντική συνεισφορά του είναι η μη-τροπική αλληλεπίδραση την οποία δοκίμασε αρχικά στο Xerox Alto με τον επεξεργαστή κειμένου Gypsy. Η έννοια της ευχρηστίας για τον Larry Tesler συμπίπτει με την ευκολία για τον περιστασιακό και αρχάριο χρήστη και τελικά επικράτησε στην περιοχή της διάδρασης." />
<figcaption aria-hidden="true">Ο Larry Tesler κατασκεύασε λογισμικό με
έμφαση στην προσβασιμότητα από απλούς χρήστες. Η πιο σημαντική
συνεισφορά του είναι η μη-τροπική αλληλεπίδραση την οποία δοκίμασε
αρχικά στο Xerox Alto με τον επεξεργαστή κειμένου Gypsy. Η έννοια της
ευχρηστίας για τον Larry Tesler συμπίπτει με την ευκολία για τον
περιστασιακό και αρχάριο χρήστη και τελικά επικράτησε στην περιοχή της
διάδρασης.</figcaption>
</figure>
<figure id="fig:nomodes">
<img src="../images/nomodes.png"
alt="Η διάδραση με έναν επεξεργαστή κειμένου γινόταν αρχικά με την επιλογή κατάστασης λειτουργίας όπως είναι η εισαγωγή κειμένου και οι εντολές αναζήτησης και αποθήκευσης. Ο τρόπος αυτός αν και παραμένει αποδεκτός από τους προχωρημένους χρήστες, ήταν ένα εμπόδιο για τους αρχάριους που οδήγησε τον Larry Tesler να το βάλει στην πινακίδα του αυτοκινήτου του καθώς και στην ονομασία της προσωπικής ιστοσελίδας του." />
<figcaption aria-hidden="true">Η διάδραση με έναν επεξεργαστή κειμένου
γινόταν αρχικά με την επιλογή κατάστασης λειτουργίας όπως είναι η
εισαγωγή κειμένου και οι εντολές αναζήτησης και αποθήκευσης. Ο τρόπος
αυτός αν και παραμένει αποδεκτός από τους προχωρημένους χρήστες, ήταν
ένα εμπόδιο για τους αρχάριους που οδήγησε τον Larry Tesler να το βάλει
στην πινακίδα του αυτοκινήτου του καθώς και στην ονομασία της προσωπικής
ιστοσελίδας του.</figcaption>
</figure>
<p>Η σημαντικότερη συνεισφορά του έγινε πραγματικότητα με την επιμονή
του στην μη-τροπικότητα της διεπαφής. Σε μια εποχή που όλες οι διεπαφές,
όπως η γραμμή εντολών και τα πρώτα γραφικά περιβάλλοντα, βασίζονται στην
τροπικότητα, σχεδίασε, υλοποίησε και δοκίμασε με απλούς χρήστες μια μη
τροπική διεπαφή. Πράγματι, οι αρχάριοι χρήστες φάνηκε να προτιμάνε πρώτα
την επιλογή ενός αντικειμένου στην διεπαφή, π.χ., λέξη, παράγραφος,
εικόνα, και μετά την επιλογή της ενέργειας, παρά το αντίθετο, που μέχρι
τότε ήταν το κυρίαρχο τροπικό στυλ διάδρασης.</p>
<p>Το μεγαλύτερο μέρος της αρχικής προγραμματιστής δουλειάς του έγινε
για περιβάλλον γραφείου με έμφαση στον επεξεργαστή κειμένου.<a
href="#fn28" id="fnref28" class="footnote-ref"
role="doc-noteref"><sup>28</sup></a> Με αυτόν τον τρόπο μετέτρεψε τον
αρχικό οπτικό επεξεργαστή κειμένου Xerox Bravo, σε μια μη-τροπική
έκδοση<a href="#fn29" id="fnref29" class="footnote-ref"
role="doc-noteref"><sup>29</sup></a> που λεγόταν Gypsy και η οποία
ελάχιστα διαφέρει από τους σύγχρονους οπτικούς επεξεργαστές κειμένου,
όπως το Microsoft Word. Επιπλέον, ανέπτυξε το σύστημα PUΒ, το οποίο
αποτελέσε την έμπνευση για την μελλοντική ανάπτυξη του συστήματος
LaTex.</p>
<p>Η πιο δημοφιλής συνεισφορά του Larry Tesler είναι η διάδραση
αντιγραφής και επικόλλησης μέσω του προχείρου, το οποίο πλέον βρίσκεται
σε όλες τις γραφικές διεπαφές. Λιγότερη γνωστή αλλά εξίσου σημαντική
είναι η κατασκευή του πρώτου περιηγητή κώδικα στο περιβάλλον Smalltalk.
Μετά την δεκαετία του 1980, από την θέση του συμβούλου θα συνεχίσει να
επηρεάζει την κατασκευή της διάδρασης για περισσότερο η λιγότερο γνωστά
συστήματα όπως το Apple Newton και Amazon Books.</p>
<section id="footnotes" class="footnotes footnotes-end-of-section"
role="doc-endnotes">
<hr />
<ol start="28">
<li><div id="fn28">
<p>fig:tesler-profile<a href="#fnref28" class="footnote-back"
role="doc-backlink">↩︎</a></p>
</div></li>
<li><div id="fn29">
<p>fig:nomodes<a href="#fnref29" class="footnote-back"
role="doc-backlink">↩︎</a></p>
</div></li>
</ol>
</section>
<h2 class="unnumbered" id="βιβλιογραφία">Βιβλιογραφία</h2>
<div id="refs" class="references csl-bib-body hanging-indent"
role="list">
<div id="ref-garrett2010elements" class="csl-entry" role="listitem">
Garrett, Jesse James. 2010. <em>Elements of user experience, the:
user-centered design for the web and beyond</em>. Pearson Education.
</div>
<div id="ref-hiltzik1999dealers" class="csl-entry" role="listitem">
Hiltzik, Michael. 1999. <span>‘Dealers of Lightning: Xerox PARC and the
Dawning of the Computer Age’</span>.
</div>
<div id="ref-igoe2007making" class="csl-entry" role="listitem">
Igoe, Tom. 2007. <em>Making things talk: Practical methods for
connecting physical objects</em>. " O’Reilly Media, Inc.".
</div>
<div id="ref-mcewen2013designing" class="csl-entry" role="listitem">
McEwen, Adrian, και Hakim Cassimally. 2013. <em>Designing the internet
of things</em>. John Wiley &amp; Sons.
</div>
<div id="ref-norman2013design" class="csl-entry" role="listitem">
Norman, Don. 2013. <em>The design of everyday things: Revised and
expanded edition</em>. Basic books.
</div>
<div id="ref-norman2004emotional" class="csl-entry" role="listitem">
Norman, Donald A. 2004. <em>Emotional design: Why we love (or hate)
everyday things</em>. Basic Civitas Books.
</div>
<div id="ref-o2004physical" class="csl-entry" role="listitem">
O’Sullivan, Dan, και Tom Igoe. 2004. <em>Physical computing: sensing and
controlling the physical world with computers</em>. Course Technology
Press.
</div>
<div id="ref-shneiderman1997direct" class="csl-entry" role="listitem">
Shneiderman, Ben, και Pattie Maes. 1997. <span>‘Direct manipulation vs.
interface agents’</span>. <em>interactions</em> 4 (6): 42–61.
</div>
</div>
<h1 id="τεχνικές">Τεχνικές</h1>
<blockquote>
<p>Μπορώ να κατανοήσω μόνο αυτό που μπορώ να φτιάξω. Ρίτσαρντ
Φευνμαν</p>
</blockquote>
<h3 id="περίληψη">Περίληψη</h3>
<p>Αυτό το κεφάλαιο περιγράφει τα βασικά δομικά στοιχεία και τις
τεχνικές του προγραμματισμού της διάδρασης, επομένως απευθύνεται σε
όσους έχουν λίγες γνώσεις στις επιμέρους περιοχές ή στον συνδυασμό τους.
Παρέχει συνοπτικά τις βασικές γνώσεις τόσο για τη γενική πλευρά του
προγραμματισμού όσο και για την ειδική περίπτωση της διάδρασης. Ο
αναγνώστης θα μάθει τα θεμελιώδη που απαιτούνται για τον προγραμματισμό
της διάδρασης. Επίσης, θα διαβάσει για τις τεχνικές και τις διαδικασίες
που χρησιμοποιούνται για την κατασκευή μιας διεπαφής με τον χρήστη.
Συνοπτικά, το κεφάλαιο αυτό προσφέρει τις βασικές γνώσεις από τις
περιοχές του προγραμματισμού συστημάτων με έμφαση στον ανθρωποκεντρικό
σχεδιασμό.</p>
<h2 id="περιβάλλον-ανάπτυξης-λογισμικού">Περιβάλλον ανάπτυξης
λογισμικού</h2>
<p>Η διαδικασία υλοποίησης ενός συστήματος διάδρασης ανθρώπου και
υπολογιστή μπορεί να διευκολυνθεί, αν ο προγραμματιστής έχει στη διάθεσή
του επιμέρους εργαλεία και τεχνικές που βοηθούν στην κατασκευή των
πρωτοτύπων και κυρίως στην κατασκευή του τελικού συστήματος διάδρασης.
Τα συστήματα υποστήριξης της κατασκευής διάδρασης είναι σχετικά απλά
στην περίπτωση του παραδοσιακού επιτραπέζιου συστήματος, γιατί το
λεξιλόγιο της διάδρασης (π.χ., παράθυρο, μενού, φόρμα, παλέτα, έγγραφο,
κτλ.) είναι σχετικά περιορισμένο. Η σχεδίαση του υλικού/λογισμικού για
τον διάχυτο ΗΥ έχει αυξήσει (και ουσιαστικά έχει αλλάξει) τις
παραμέτρους της διάδρασης, τόσο που τα περισσότερα εργαλεία να είναι
ακατάλληλα, αφού δεν μπορούν να δώσουν μια πλήρη εικόνα της εκτέλεσης
στην τελική συσκευή του χρήστη. Από την άλλη πλευρά, οι γενικές τεχνικές
προδιαγραφών διατηρούν την αξιοπιστία τους, όπως το μοντέλο
ελεγκτής-όψη, οι δηλωτικές γλώσσες προδιαγραφών, και τα διαγράμματα ροής
και κατάστασης. <a href="#fn1" id="fnref1" class="footnote-ref"
role="doc-noteref"><sup>1</sup></a> <a href="#fn2" id="fnref2"
class="footnote-ref" role="doc-noteref"><sup>2</sup></a></p>
<figure id="fig:grail-flow">
<img src="../images/grail-flow.jpg"
alt="Το πρώτο περιβάλλον οπτικού προγραμματισμού GRAIL (GRaphical Input Language) απευθύνεται σε επαγγελματίες που δεν γνωρίζουν να γράφουν κώδικα, αλλά γνωρίζουν άριστα την ροή εργασίας της δουλειάς τους, οπότε μπορούν να την περιγράψουν σε ένα ευέλικτο διάγραμμα ροής στον υπολογιστή." />
<figcaption aria-hidden="true">Το πρώτο περιβάλλον οπτικού
προγραμματισμού GRAIL (GRaphical Input Language) απευθύνεται σε
επαγγελματίες που δεν γνωρίζουν να γράφουν κώδικα, αλλά γνωρίζουν άριστα
την ροή εργασίας της δουλειάς τους, οπότε μπορούν να την περιγράψουν σε
ένα ευέλικτο διάγραμμα ροής στον υπολογιστή.</figcaption>
</figure>
<figure id="fig:max-language">
<img src="../images/max-language.jpg"
alt="Η οπτική γλώσσα προγραμματισμού MAX δημιουργήθηκε για να διευκολύνει την καλιτεχνική δημιουργία και βασίζεται στην λογική της ροής δεδομένων μέσα από τον οπτικά σχεδιασμένο γράφο επεξεργασίας τους, αντί για κείμενο και εντολές ελέγχου σε γραμμική σειρά που συναντάμε στις παραδοσιακές γλώσσες προγραμματισμού." />
<figcaption aria-hidden="true">Η οπτική γλώσσα προγραμματισμού MAX
δημιουργήθηκε για να διευκολύνει την καλιτεχνική δημιουργία και
βασίζεται στην λογική της ροής δεδομένων μέσα από τον οπτικά σχεδιασμένο
γράφο επεξεργασίας τους, αντί για κείμενο και εντολές ελέγχου σε
γραμμική σειρά που συναντάμε στις παραδοσιακές γλώσσες
προγραμματισμού.</figcaption>
</figure>
<p>Τα περισσότερα βιβλία προγραμματισμού διαλέγουν από την αρχή κάποια
από τα τρέχοντα διαθέσιμα εργαλεία με έμφαση συνήθως στη γλώσσα
προγραμματισμού (π.χ., Java), το λειτουργικό σύστημα (π.χ., Windows),
και το περιβάλλον ανάπτυξης (π.χ., Eclipse), και από εκεί και πέρα
περιγράφουν τα επιμέρους ζητήματα. Αντίθετα, σε αυτό το βιβλίο,
αντιμετωπίζουμε όλα τα εργαλεία του προγραμματισμού ως ζητούμενα τα
οποία έχουν διαφορετικές τιμές ανάλογα με τις απαιτήσεις του έργου. Για
τον σκοπό αυτό, δίνουμε μια επισκόπηση των διαθέσιμων εργαλείων και
τεχνικών ανάπτυξης με έμφαση στα κριτήρια επιλογής τους ανάλογα με τις
περιπτώσεις του προγραμματισμού της διάδρασης. Επίσης, σε αντίθεση με τα
περισσότερα βιβλία που επιλέγουν περισσότερο ή λιγότερο ρητά μια
δημοφιλή τεχνική και διαδικασία ανάπτυξης, εδώ περιγράφουμε τις
ιδιότητές τους και αξιολογούμε την καταλληλότητά τους ανάλογα με το
ζητούμενο. Για παράδειγμα, κάποια βιβλία θεωρούν δεδομένο ότι θα πρέπει
να ξεκινήσουμε τον προγραμματισμό μόνο αφού έχουμε καθορίσει με ακρίβεια
τις προδιαγραφές, αλλά υπάρχουν πολλές περιπτώσεις χρήσης όπου ο ίδιος ο
προγραμματισμός της διάδρασης μπορεί να μας βοηθήσει να κατανοήσουμε
καλύτερα ποιες είναι οι προδιαγραφές. Είναι τόσα πολλά τα πιθανά
επιμέρους εργαλεία που έχει ανάγκη ένας προγραμματιστής, που
δημιουργήθηκε μια νέα κατηγορία υπερ-εργαλείου, το ολοκληρωμένο
περιβάλλον ανάπτυξης, το οποίο περιλαμβάνει όλα τα παραπάνω μέσα στην
ίδια εφαρμογή.</p>
<p>Το ολοκληρωμένο περιβάλλον ανάπτυξης αποτελείται από μια οργάνωση
εργαλείων με εύκολη πρόσβαση σε δομές και τεχνικές που βοηθούν στην
παραγωγή του τελικού προϊόντος. Ανάλογα με την εμπειρία και τις
προτιμήσεις του κατασκευαστή, το περιβάλλον ανάπτυξης μπορεί να έχει
πάρα πολλές μορφές και επίπεδα λειτουργίας. Για παράδειγμα, οι αρχάριοι
χρήστες συνήθως διευκολύνονται από οπτικά περιβάλλοντα ανάπτυξης
λογισμικού τα όποια δεν δίνουν άμεση πρόσβαση στον τελικό πηγαίο κώδικα,
αλλά δίνουν πολύ εύκολη πρόσβαση σε βασικά μοτίβα χρήσης. Από την άλλη
πλευρά, οι έμπειροι κατασκευαστές που θέλουν να φτιάξουν κάτι εντελώς
καινούριο, όχι μόνο χρησιμοποιούν πολύ απλά και ευέλικτα εργαλεία (π.χ.,
έναν απλό επεξεργαστή κειμένου), αλλά ξοδεύουν και αρκετό χρόνο
φτιάχνοντας δικά τους εργαλεία και τεχνικές. Ανάμεσα σε αυτές τις δύο
ακραίες περιπτώσεις, υπάρχουν πάρα πολλά εργαλεία και τεχνικές τις
οποίες μπορεί να χρησιμοποιήσει κάποιος, ανάλογα με τις ικανότητες και
τον σκοπό του. <a href="#fn3" id="fnref3" class="footnote-ref"
role="doc-noteref"><sup>3</sup></a> <a href="#fn4" id="fnref4"
class="footnote-ref" role="doc-noteref"><sup>4</sup></a></p>
<figure id="fig:eclipse-ide">
<img src="../images/eclipse-ide.png"
alt="Ένα δημοφιλές περιβάλλον ανάπτυξης ανοικτού κώδικα είναι το Eclipse, το οποίο χρησιμοποιεί την επιτραπέζια γραφική διεπαφή για να ολοκληρώσει σε μια εφαρμογή χρήσιμα εργαλεία όπως είναι ο επεξεργαστής κειμένου, η αυτόματη μορφοποίηση και συμπλήρωση κώδικα, ο αποσφαλματωτής, και η υποστήριξη για διαφορετικές γλώσσες προγραμματισμού." />
<figcaption aria-hidden="true">Ένα δημοφιλές περιβάλλον ανάπτυξης
ανοικτού κώδικα είναι το Eclipse, το οποίο χρησιμοποιεί την επιτραπέζια
γραφική διεπαφή για να ολοκληρώσει σε μια εφαρμογή χρήσιμα εργαλεία όπως
είναι ο επεξεργαστής κειμένου, η αυτόματη μορφοποίηση και συμπλήρωση
κώδικα, ο αποσφαλματωτής, και η υποστήριξη για διαφορετικές γλώσσες
προγραμματισμού.</figcaption>
</figure>
<figure id="fig:processing-ide">
<img src="../images/processing-ide.png"
alt="Το περιβάλλον ανάπτυξης Processing μοιάζει σκόπιμα με μια εφαρμογή εκτέλεσης αρχείων πολυμέσων. Τα προγράμματα ονομάζονται σχεδιαγράμματα, έτσι ώστε να ενθαρρύνουν την συνεχή αλλαγή τους." />
<figcaption aria-hidden="true">Το περιβάλλον ανάπτυξης Processing
μοιάζει σκόπιμα με μια εφαρμογή εκτέλεσης αρχείων πολυμέσων. Τα
προγράμματα ονομάζονται σχεδιαγράμματα, έτσι ώστε να ενθαρρύνουν την
συνεχή αλλαγή τους.</figcaption>
</figure>
<p>Ιδιαίτερη αναφορά αξίζει να γίνει στο ολοκληρωμένο περιβάλλον του
Processing, το οποίο έχει φτιαχτεί σκόπιμα έτσι ώστε να μοιάζει
περισσότερο με εφαρμογή εκτέλεσης πολυμεσικών αρχείων παρά με ένα
προγραμματιστικό περιβάλλον. Σε αντίθεση με τα δημοφιλή ολοκληρωμένα
περιβάλλοντα, η εμφάνιση του Processing είναι τουλάχιστον “σπαρτιάτικη”,
πράγμα που έχει γίνει για να διευκολύνει τον νέο προγραμματιστή. Ίσως
περισσότερο αντισυμβατική και από την εμφάνιση είναι η ορολογία σε αυτό
το περιβάλλον, αφού σκόπιμα αναφέρεται στον πηγαίο κώδικα ως “διάγραμμα”
(sketch). Η πρόθεση των σχεδιαστών είναι να παροτρύνουν τον
προγραμματιστή σε αυτό το περιβάλλον να πειραματιστεί και να βελτιώσει
την ιδέα του κάνοντας δοκιμή και λάθος. Σε αντίθεση λοιπόν με την
παραδοσιακή συμβουλή της αρχικής αναλυτικής σχεδίασης ενός προγράμματος
πριν την υλοποίησή του, το περιβάλλον αυτό προτρέπει στον
αυτοσχεδιασμό.</p>
<p>Τα εργαλεία που διευκολύνουν την ανάπτυξη υλικού και λογισμικού
διάδρασης έχουν αποδειχθεί ιδιαίτερα αποτελεσματικά σε πολλές
περιπτώσεις, αρχίζοντας από το γραφικό περιβάλλον του επιτραπέζιου
υπολογιστή. Ο κάθε κατασκευαστής λειτουργικού συστήματος, σε διαφορετικό
βαθμό, παρέχει ένα σύνολο από μοτίβα τα οποία επιτρέπουν μια ομοιόμορφη
εμφάνιση και κυρίως μια συνεπή συμπεριφορά ανάμεσα στις πολλές
διαφορετικές εφαρμογές χρήστη. Ήταν η Apple που πρώτη έδωσε στους
κατασκευαστές εφαρμογών ένα σετ από οδηγίες και μοτίβα σωστού σχεδιασμού
της διάδρασης με τον υπολογιστή Macintosh, ενώ ταυτόχρονα τα αντίστοιχα
εργαλεία ανάπτυξης του λογισμικού σέβονταν αυτές τις οδηγίες. Για
παράδειγμα, η θέση, η εμφάνιση και η λειτουργία των κουμπιών που
καθορίζουν το μέγεθος του παραθύρου έχουν προκαθορισμένες ιδιότητες ώστε
να μοιάζουν ανάμεσα στις διαφορετικές εφαρμογές του χρήστη,
δημιουργώντας μια αίσθηση οικειότητας. Ο κατασκευαστής εφαρμογών χρήστη
μπορεί πάντα να αγνοήσει τις οδηγίες και τα έτοιμα μοτίβα, αν επιθυμεί
να φτιάξει μια εφαρμογή που έχει λόγους να διαφέρει.</p>
<p>Πέρα από την Apple, και οι άλλοι κατασκευαστές λειτουργικών
συστημάτων με γραφικό περιβάλλον, σε μικρότερο (π.χ., Linux) ή
μεγαλύτερο βαθμό (π.χ., Windows), παρέχουν πλέον τα αντίστοιχα σετ
οδηγιών, καθώς και “προκάτ” δομικά στοιχεία κατασκευής της διάδρασης. <a
href="#fn5" id="fnref5" class="footnote-ref"
role="doc-noteref"><sup>5</sup></a> Υπάρχουν δύο κύριοι λόγοι για τους
οποίους ένας κατασκευαστής της διάδρασης θα ήθελε να κινηθεί έξω από την
ασφάλεια που του προσφέρει το στενό και προκαθορισμένο σύνολο οδηγιών
που του παρέχει ο κατασκευαστής της αρχικής πλατφόρμας. Ο πρώτος λόγος
είναι να θέλει να φτιάξει μια εφαρμογή που πρέπει να δείχνει και να
συμπεριφέρεται διαφορετικά - επειδή αυτό εξυπηρετεί τις ανάγκες του.
Χαρακτηριστικά παραδείγματα είναι τα skinable mp3 players καθώς και οι
εφαρμογές με φίλτρα ψηφιακής φωτογραφίας (Kai Tools). Ο δεύτερος και
σημαντικότερος λόγος που κάνει έναν κατασκευαστή να κινηθεί έξω από τους
κανόνες, είναι η ανάπτυξη ενός συστήματος που δε μοιάζει καθόλου με το
σύστημα του υπολογιστή εργασίας του, όπως για παράδειγμα η ανάπτυξη
κινητών εφαρμογών σε επιτραπέζιο υπολογιστή.</p>
<figure id="fig:visual-basic-form-designer">
<img src="../images/visual-basic-form-designer.png"
alt="Το οπτικό περιβάλλον της Visual Basic έδωσε τη δυνατότητα σε πολλούς χρήστες που δεν ήταν ειδικοί της πληροφορικής να φτιάξουν προγράμματα για ειδικούς σκοπούς όπως αναζήτηση και ανάκτηση πληροφορίας από βάση δεδομένων, χωρίς να πρέπει μάθουν όλες τις λεπτομέρειες της ανάπτυξης λογισμικού. Ταυτόχρονα όμως ο σχεδιασμός περιορίζεται από τα διαθέσιμα αρχέτυπα με αποτέλεσμα την δημιουργία κινητών εφαρμογών που μοιάζουν και συμπεριφέρονται όπως οι επιτραπέζιες." />
<figcaption aria-hidden="true">Το οπτικό περιβάλλον της Visual Basic
έδωσε τη δυνατότητα σε πολλούς χρήστες που δεν ήταν ειδικοί της
πληροφορικής να φτιάξουν προγράμματα για ειδικούς σκοπούς όπως αναζήτηση
και ανάκτηση πληροφορίας από βάση δεδομένων, χωρίς να πρέπει μάθουν όλες
τις λεπτομέρειες της ανάπτυξης λογισμικού. Ταυτόχρονα όμως ο σχεδιασμός
περιορίζεται από τα διαθέσιμα αρχέτυπα με αποτέλεσμα την δημιουργία
κινητών εφαρμογών που μοιάζουν και συμπεριφέρονται όπως οι
επιτραπέζιες.</figcaption>
</figure>
<figure id="fig:windows-mobile">
<img src="../images/windows-mobile.png"
alt="Ένα από τα πρώτα λειτουργικά συστήματα με γραφικό περιβάλλον για κινητά τηλέφωνα, τα windows mobile μεταφέρουν τις έννοιες από το λειτουργικό σύστημα του επιτραπέζιου υπολογιστή σε εκείνο του κινητού. Οι έννοιες αυτές, αν και επιτυχημένες, είναι ακατάλληλες για το πλαίσιο χρήσης του κινητού υπολογισμού." />
<figcaption aria-hidden="true">Ένα από τα πρώτα λειτουργικά συστήματα με
γραφικό περιβάλλον για κινητά τηλέφωνα, τα windows mobile μεταφέρουν τις
έννοιες από το λειτουργικό σύστημα του επιτραπέζιου υπολογιστή σε εκείνο
του κινητού. Οι έννοιες αυτές, αν και επιτυχημένες, είναι ακατάλληλες
για το πλαίσιο χρήσης του κινητού υπολογισμού.</figcaption>
</figure>
<p>Δεν είναι τυχαίο που κάποιες από τις πρώτες προσπάθειες κατασκευής
κινητών εφαρμογών έμοιαζαν πολύ με τις αντίστοιχες επιτραπέζιες (π.χ.,
οι πρώτες εκδόσεις των Windows Mobile). <a href="#fn6" id="fnref6"
class="footnote-ref" role="doc-noteref"><sup>6</sup></a> Φυσικά, αυτό δε
βοήθησε στην αποδοχή αυτών των κινητών εφαρμογών στα πρώτα στάδια, μέχρι
που η Apple με το iPhone έδωσε έναν νέο ορισμό του πλαισίου μέσα στο
οποίο θα πρέπει να κινούνται οι εφαρμογές χρήστη στις κινητές συσκευές,
για να είναι χρήσιμες, εύχρηστες και αποδεκτές. Αντίστοιχα, κάθε νέα
τεχνολογία που μετατοπίζει τη διάδραση πέρα από τον επιτραπέζιο
υπολογιστή, αντιμετωπίζει τις ίδιες προκλήσεις. Στα πρώτα στάδια, οι
κατασκευαστές εφαρμογών χρήστη θα δανειστούν (λανθασμένα) πάρα πολλά
στοιχεία από συσκευές που φαίνονται παρόμοιες, αλλά στην πορεία (και
μετά από μερικούς κύκλους δοκιμής και λάθους) θα καταλήξουν σε ένα
ενημερωμένο σύνολο από οδηγίες και εργαλεία που θα τους βοηθήσουν στην
παραγωγή κατάλληλων εφαρμογών χρήστη. Συνοπτικά, όταν κατασκευάζουμε
εφαρμογές (λειτουργικού συστήματος ή χρήστη) που θα εκτελεστούν σε
υπολογιστή που διαφέρει από τον επιτραπέζιο, θα πρέπει να προσέχουμε
πρώτα από όλα τις συσκευές εισόδου και εξόδου (είναι πληκτρολόγιο και
ποντίκι ή μήπως κάτι άλλο;) και το πλαίσιο χρήσης (είναι περιβάλλον
γραφείου και εργασία με εκδόσεις ή κάτι άλλο;).</p>
<p>Το τελικό αποτέλεσμα, και κυρίως το πλαίσιο ορισμού στο οποίο μπορεί
να κινηθεί ένα νέο πρόγραμμα διάδρασης, εξαρτάται από τα βασικά μοτίβα
σχεδίασης που είδαμε παραπάνω. Αλλά εξαρτάται και από τα εργαλεία, την
οργάνωση και τη διαδικασία κατασκευής. Όπως ακριβώς τα βασικά
σχεδιαστικά και τεχνολογικά μοτίβα που έχει στη διάθεσή του ένας
κατασκευαστής μπορούν να δώσουν συγκεκριμένες μορφές και λειτουργίες στη
διάδραση, έτσι και η μέθοδος κατασκευής μπορεί να επιτρέψει ή να
αποτρέψει κάποιες μορφές και λειτουργίες της διάδρασης. Τα πρώτα
συστήματα προγραμματισμού της διάδρασης δεν είχαν καμία διαφορά από
εκείνα για τον προγραμματισμό του συστήματος, οπότε πολλοί δυνητικοί
κατασκευαστές της διάδρασης δεν είχαν καταφέρει να δώσουν τη συνεισφορά
τους. Μετά τη δεκαετία του 1970, οι αντικειμενοστραφείς γλώσσες
προγραμματισμού (π.χ., SmallTalk, C++, Java, JavaScript) και τα οπτικά
περιβάλλοντα ανάπτυξης (π.χ, KidSim, MIT Scratch, Processing) επέτρεψαν
σε γνώστες της περιοχής του προγραμματισμού της διάδρασης να
συμμετάσχουν. Ταυτόχρονα, η διευκόλυνση κάποιων πτυχών του
προγραμματισμού της διάδρασης, ακόμη και από τον τελικό χρήστη,
ολοκληρώνει τη διαχρονική τάση που ενθαρρύνει τη συμμετοχικότητα του
τελικού χρήστη, όχι μόνο στην απλή χρήση, αλλά και στη δημιουργία.</p>
<section id="footnotes" class="footnotes footnotes-end-of-section"
role="doc-endnotes">
<hr />
<ol>
<li><div id="fn1">
<p>fig:grail-flow<a href="#fnref1" class="footnote-back"
role="doc-backlink">↩︎</a></p>
</div></li>
<li><div id="fn2">
<p>fig:max-language<a href="#fnref2" class="footnote-back"
role="doc-backlink">↩︎</a></p>
</div></li>
<li><div id="fn3">
<p>fig:eclipse-ide<a href="#fnref3" class="footnote-back"
role="doc-backlink">↩︎</a></p>
</div></li>
<li><div id="fn4">
<p>fig:processing-ide<a href="#fnref4" class="footnote-back"
role="doc-backlink">↩︎</a></p>
</div></li>
<li><div id="fn5">
<p>fig:visual-basic-form-designer<a href="#fnref5" class="footnote-back"
role="doc-backlink">↩︎</a></p>
</div></li>
<li><div id="fn6">
<p>fig:windows-mobile<a href="#fnref6" class="footnote-back"
role="doc-backlink">↩︎</a></p>
</div></li>
</ol>
</section>
<h2 id="εργαλεία-ανάπτυξης">Εργαλεία ανάπτυξης</h2>
<p>Για πολλά χρόνια η ανάπτυξη και εκτέλεση εφαρμογών στον επιτραπέζιο
υπολογιστή ήταν μονόδρομος, αφού οι άλλες μορφές υπολογιστή δεν ήταν
ιδιαίτερα διαδεδομένες.<a href="#fn7" id="fnref7" class="footnote-ref"
role="doc-noteref"><sup>7</sup></a> Πάντα υπήρχαν υπερ-υπολογιστές καθώς
και παιχνιδομηχανές, αλλά η ανάπτυξη για αυτές τις πλατφόρμες γινόταν
από ειδικευμένο προσωπικό που λάμβανε την αντίστοιχη εκπαίδευση.<a
href="#fn8" id="fnref8" class="footnote-ref"
role="doc-noteref"><sup>8</sup></a> Η ανάπτυξη και εκτέλεση εφαρμογών
διάδρασης στον επιτραπέζιο υπολογιστή έχει πολλές παραμέτρους που πρέπει
να αξιολογήσει ο κατασκευαστής και δεν είναι καθόλου τετριμμένη
περίπτωση. Όμως, έχει ένα βασικό πλεονέκτημα σε σχέση με την ανάπτυξη
για τον κινητό και διάχυτο υπολογισμό. Η βασική διαφορά στην ανάπτυξη
λογισμικού διάδρασης ανάμεσα σε επιτραπέζιο και κινητό ή διάχυτο
υπολογισμό είναι το γεγονός ότι το πρόγραμμα εκτελείται στην πρώτη
περίπτωση πάνω στον ίδιο τον υπολογιστή ανάπτυξης, ενώ στη δεύτερη
περίπτωση το πρόγραμμα εκτελείται πάνω σε διαφορετικό υλικό.</p>
<p>Όταν το πρόγραμμα που κατασκευάζουμε εκτελείται τελικά πάνω σε
διαφορετικό υλικό από εκείνο του υπολογιστή ανάπτυξης, τότε η δυνατότητα
που έχουμε για εφαρμογή του ανθρωποκεντρικού κύκλου σχεδίασης μειώνεται
ανάλογα με τον βαθμό και το είδος της διάδρασης. Αν, για παράδειγμα,
κατασκευάζουμε ένα πρόγραμμα για έξυπνο κινητό που έχει πληκτρολόγιο και
δεν έχει οθόνη αφής, τότε μπορούμε σχετικά εύκολα να κάνουμε τις
επαναληπτικές δοκιμές της διάδρασης πάνω στον επιτραπέζιο υπολογιστή, ο
οποίος έχει πληκτρολόγιο που ναι μεν διαφέρει από το μικρό πληκτρολόγιο
του κινητού, όμως δεν είναι δραματικά διαφορετικό. Στην περίπτωση, όμως,
που το έξυπνο κινητό έχει μόνο πολυαπτική οθόνη αφής, τότε η δοκιμή της
διάδρασης στον επιτραπέζιο υπολογιστή γίνεται πιο δύσκολη -αφού συνήθως
δε συνοδεύεται από τέτοια συσκευή εισόδου. Η δοκιμή της διάδρασης
γίνεται ακόμη δυσκολότερη όταν η διάδραση βασίζεται σε αισθητήρες
εισόδου, όπως ο εντοπισμός θέσης ή το γυροσκόπιο, αφού αυτά δεν υπάρχουν
στον επιτραπέζιο υπολογιστή και απαιτείται πλέον η σύνδεσή του με την
τελική συσκευή για την πραγματοποίηση των επαναληπτικών δοκιμών κατά το
στάδιο της ανάπτυξης.</p>
<p>Όπως είδαμε παραπάνω, το βασικό μειονέκτημα της κατασκευής στην
περίπτωση του κινητού και διάχυτου υπολογισμού είναι ότι τα περισσότερα
εργαλεία ανάπτυξης είναι διαθέσιμα κυρίως για τον επιτραπέζιο
υπολογιστή, που μπορεί να διαφέρει -από λίγο έως πάρα πολύ- από την
τελική πλατφόρμα, αναφορικά με τις συσκευές εισόδου και εξόδου. Για
παράδειγμα, ένας επιτραπέζιος υπολογιστής έχει είσοδο κυρίως από το
πληκτρολόγιο και το ποντίκι, ενώ ένα έξυπνο κινητό έχει κυρίως είσοδο
από μια πολυαπτική οθόνη. Το αποτέλεσμα είναι ότι, εκτός από κάποιες
απλές επιλογές αντικειμένων πάνω στην οθόνη, πολλές από τις πιθανές
διαδράσεις που είναι χρήσιμες στο έξυπνο κινητό δεν είναι διαθέσιμες για
δοκιμή στην πλατφόρμα ανάπτυξης, όταν αυτή είναι ο επιτραπέζιος
υπολογιστής. Από αυτήν την άποψη θα μπορούσαμε να φανταστούμε ότι τα
μελλοντικά εργαλεία ανάπτυξης για κινητό υπολογισμό θα εκτελούνται
απευθείας πάνω στο κινητό. Αυτό φυσικά υπαγορεύει ένα πολύ διαφορετικό
μοντέλο ανάπτυξης αναφορικά με τα εργαλεία και τις διαδικασίες
κατασκευής του προγράμματος διάδρασης.</p>
<figure id="fig:smalltalk">
<img src="../images/smalltalk.jpg"
alt="Η αντικειμενοστραφής γλώσσα προγραμματισμού Smalltalk με έμπνευση από τον τρόπο που επικοινωνούν σε πολύ μεγάλη κλίμακα τα βιολογικά κύταρα, είχε έμφαση σε οντότητες υψηλού επιπέδου και στην διάδραση με τον χρήστη και έτσι διευκόλυνε την κατασκευή και τις δοκιμές του λογισμικού που τελικά οδήγησε στους πρώτους επιτυχημένους εμπορικά επιτραπέζιους υπολογιστές." />
<figcaption aria-hidden="true">Η αντικειμενοστραφής γλώσσα
προγραμματισμού Smalltalk με έμπνευση από τον τρόπο που επικοινωνούν σε
πολύ μεγάλη κλίμακα τα βιολογικά κύταρα, είχε έμφαση σε οντότητες υψηλού
επιπέδου και στην διάδραση με τον χρήστη και έτσι διευκόλυνε την
κατασκευή και τις δοκιμές του λογισμικού που τελικά οδήγησε στους
πρώτους επιτυχημένους εμπορικά επιτραπέζιους υπολογιστές.</figcaption>
</figure>
<figure id="fig:lilith-modula">
<img src="../images/lilith-modula.jpg"
alt="Η εμπειρία της διάδρασης με το Alto εντυπωσίασε τόσο πολύ τον Niklaus Wirth που αποφάσισε να δημιουργήσει ένα παρόμοιο μηχάνημα με την ονομασία Lilith. Ακολούθησε μια λιγότερο δυναμική κατεύθυνση από αυτήν της Smalltalk, με την δημιουργία της γλώσσας προγραμματισμού Modula καθώς και με παράθυρα που δεν αλληλοεπικαλύπτονται." />
<figcaption aria-hidden="true">Η εμπειρία της διάδρασης με το Alto
εντυπωσίασε τόσο πολύ τον Niklaus Wirth που αποφάσισε να δημιουργήσει
ένα παρόμοιο μηχάνημα με την ονομασία Lilith. Ακολούθησε μια λιγότερο
δυναμική κατεύθυνση από αυτήν της Smalltalk, με την δημιουργία της
γλώσσας προγραμματισμού Modula καθώς και με παράθυρα που δεν
αλληλοεπικαλύπτονται.</figcaption>
</figure>
<p>Η κατασκευή προγραμμάτων διάδρασης διευκολύνεται από εργαλεία και
τεχνικές,<a href="#fn9" id="fnref9" class="footnote-ref"
role="doc-noteref"><sup>9</sup></a> τα οποία είναι τόσο διαφορετικά, όσο
και το εύρος των συσκευών εισόδου, εξόδου, και υπολογισμού.<a
href="#fn10" id="fnref10" class="footnote-ref"
role="doc-noteref"><sup>10</sup></a> Επιπλέον, τα εργαλεία και οι
διαδικασίες κατασκευής εξαρτώνται από τις προτιμήσεις του κατασκευαστή,
οι οποίες μπορεί να γίνουν αρκετά πολύπλοκες στην περίπτωση μεγάλων
οργανισμών και ομάδων ανάπτυξης, επομένως τότε αναφερόμαστε στην
κουλτούρα ανάπτυξης του κάθε κατασκευαστή. <a href="#fn11" id="fnref11"
class="footnote-ref" role="doc-noteref"><sup>11</sup></a> <a
href="#fn12" id="fnref12" class="footnote-ref"
role="doc-noteref"><sup>12</sup></a></p>
<p>Μετά τον καθορισμό του στόχου και των αναγκών του χρήστη, το επόμενο
βήμα είναι η επιλογή των εργαλείων ανάπτυξης, καθώς και ο καθορισμός του
πλάνου ανάπτυξης που θα διευκολύνει τη σωστή παράδοση του προγράμματος
της διάδρασης. Το πλάνο ανάπτυξης περιλαμβάνει ένα σύνολο από παραδοτέα
της μορφής αναφορά ή πρωτότυπο, ενώ η σωστή οργάνωση της ομάδας
ανάπτυξης περιλαμβάνει ρόλους όπως προγραμματιστής, δοκιμαστής,
αναλυτής-σχεδιαστής. Σε ένα πραγματικό έργο ανάπτυξης λογισμικού, αν ο
οργανισμός χρησιμοποιήσει περισσότερους ανθρώπινους πόρους από όσους
χρειάζεται θα πέσει έξω οικονομικά, αφού το να δουλεύει το έργο δεν
είναι ο μοναδικός στόχος ενός οργανισμού. Θα πρέπει το έργο να έχει
παραχθεί και με μικρό κόστος, ώστε να είναι ανταγωνιστικό. Υπό αυτήν τη
σκοπιά, θα πρέπει να γίνει μια συζήτηση για τη σκοπιμότητα επιλογής
εργαλείων ανάπτυξης που να βασίζεται στις δεξιότητες των
προγραμματιστών, αλλά και στους στόχους του έργου.<a href="#fn13"
id="fnref13" class="footnote-ref"
role="doc-noteref"><sup>13</sup></a></p>
<p>Το πιο σημαντικό, διαχρονικά, εργαλείο στην ανάπτυξη νέων συστημάτων
είναι ο επεξεργαστής κειμένου. Η σημασία του κειμένου οφείλεται στο
γεγονός ότι πολλές γλώσσες προγραμματισμού είναι γραπτές. Αν και η
επεξεργασία κειμένου είναι μια σχετικά απλή δραστηριότητα, υπάρχουν πάρα
πολλά είδη επεξεργαστή κειμένου, γιατί οι προτιμήσεις των
προγραμματιστών και οι απαιτήσεις των έργων ανάπτυξης έχουν μεγάλη
ποικιλία. Για παράδειγμα, μπορούμε να χρησιμοποιήσουμε από έναν
επεξεργαστή κειμένου γενικής χρήσης, που συνήθως είναι ελεύθερα
διαθέσιμος με το λειτουργικό σύστημα του υπολογιστή, μέχρι έναν
εξειδικευμένο επεξεργαστή κειμένου που είναι μέρος ενός εξειδικευμένου
συνόλου εργαλείων ανάπτυξης για μια συγκεκριμένη πλατφόρμα υπολογιστή.
Ανάμεσα σε αυτά τα δύο άκρα υπάρχει ένα πολύ μεγάλο φάσμα από είδη
επεξεργαστών κειμένου, τα οποία διευκολύνουν τη συγγραφή, την ανάγνωση
και τις αλλαγές στον κώδικα, καθώς και τις συνήθειες του προγραμματιστή.
<a href="#fn14" id="fnref14" class="footnote-ref"
role="doc-noteref"><sup>14</sup></a> <a href="#fn15" id="fnref15"
class="footnote-ref" role="doc-noteref"><sup>15</sup></a> Η σχετική
σημασία του επεξεργαστή κειμένου μειώνεται στις περιπτώσεις που έχουμε
μια μετατόπιση προς οπτικές γλώσσες προγραμματισμού και προς
ολοκληρωμένα περιβάλλοντα ανάπτυξης.</p>
<figure id="fig:emacs-ide">
<img src="../images/emacs-ide.png"
alt="Ο επεξεργαστής κειμένου GNU Emacs επιτρέπει την επέκταση του με την γλώσσα προγραμματισμού LISP και οργανώνει τα δεδομένα σε παράλληλους αποθηκευτικούς χώρους που μπορούν να εμφανίζονται επιλεκτικά στην οθόνη του χρήστη. Με αυτόν τον τρόπο, έχουν αναπτυχθεί επεκτάσεις για πολλές εφαρμογές όπως η ηλεκτρονική αλληλογραφία, η πλοήγηση στην πληροφορία και η κατασκευή λογισμικού σε ολοκληρωμένο περιβάλλον ανάπτυξης." />
<figcaption aria-hidden="true">Ο επεξεργαστής κειμένου GNU Emacs
επιτρέπει την επέκταση του με την γλώσσα προγραμματισμού LISP και
οργανώνει τα δεδομένα σε παράλληλους αποθηκευτικούς χώρους που μπορούν
να εμφανίζονται επιλεκτικά στην οθόνη του χρήστη. Με αυτόν τον τρόπο,
έχουν αναπτυχθεί επεκτάσεις για πολλές εφαρμογές όπως η ηλεκτρονική
αλληλογραφία, η πλοήγηση στην πληροφορία και η κατασκευή λογισμικού σε
ολοκληρωμένο περιβάλλον ανάπτυξης.</figcaption>
</figure>
<figure id="fig:vim-ide">
<img src="../images/vim-ide.jpg"
alt="Ο συνδυασμός ενός ευέλικτου και επεκτάσιμου επεξεργαστή κειμένου όπως ο vim με ένα απλό παραθυρικό περιβάλλον ή ακόμη και με έναν πολυπλέκτη τερματικών όπως το tmux επιτρέπει στον έμπειρο προγραμματιστή να έχει ένα γρήγορο και πλούσιο σε πληροφορία περιβάλλον που μπορεί να τον ακολουθεί ανεξάρτητα από τις δυνατότητες του τερματικού υπολογιστή." />
<figcaption aria-hidden="true">Ο συνδυασμός ενός ευέλικτου και
επεκτάσιμου επεξεργαστή κειμένου όπως ο vim με ένα απλό παραθυρικό
περιβάλλον ή ακόμη και με έναν πολυπλέκτη τερματικών όπως το tmux
επιτρέπει στον έμπειρο προγραμματιστή να έχει ένα γρήγορο και πλούσιο σε
πληροφορία περιβάλλον που μπορεί να τον ακολουθεί ανεξάρτητα από τις
δυνατότητες του τερματικού υπολογιστή.</figcaption>
</figure>
<p>Μετά τη συγγραφή του πηγαίου κώδικα, το επόμενο βασικό εργαλείο που
απαιτείται για τον προγραμματισμό είναι η δυνατότητα της μετάφρασης ή
της μεταγλώττισης σε εκτελέσιμο κώδικα της τελικής πλατφόρμας. Στο
πλαίσιο του προγραμματισμού και ειδικά των λειτουργικών συστημάτων αυτό
είναι μια μεγάλη ενότητα, αλλά στο πλαίσιο του προγραμματισμού της
διάδρασης η προτεραιότητα είναι στη γρήγορη δημιουργία εναλλακτικών
προγραμμάτων και κυρίως στις επαναληπτικές αλλαγές. Για τον σκοπό αυτό,
αν υπάρχει μια παράμετρος της κατασκευής κατά τον προγραμματισμό της
διάδρασης που έχει μεγάλη σημασία, αυτή είναι η ταχύτητα με την οποία
μπορεί ο κατασκευαστής να εναλλάσσει την ανάπτυξη με τη δοκιμή.<a
href="#fn16" id="fnref16" class="footnote-ref"
role="doc-noteref"><sup>16</sup></a> Όσο πιο γρήγορα μπορεί ο
κατασκευαστής να περνάει από το στάδιο της σχεδίασης της διάδρασης στο
στάδιο της δοκιμής της διάδρασης -στο πλαίσιο δοκιμών είτε με ειδικούς
είτε με τελικούς χρήστες- τόσο πιο γρήγορα το πρόγραμμα της διάδρασης θα
αποκτήσει την επιθυμητή ποιότητα.</p>
<p>Καθώς τα προγράμματα διάδρασης γίνονται περισσότερο σύνθετα και
πολύπλοκα, η σημασία των παραπάνω βασικών εργαλείων και διαδικασιών
(π.χ., επεξεργαστής κειμένου, μετατροπή σε εκτελέσιμο) γίνονται λιγότερα
σημαντικά από την πλευρά του προγραμματιστή της διάδρασης, αφού
προτεραιότητα έχει η επιλογή του κατάλληλου πλαισίου προγραμματισμού
ανάλογα με τις ανάγκες. Για παράδειγμα, ο προγραμματισμός της διάδρασης
για μια εφαρμογή που θα εκτελείται στο διαδίκτυο επιβάλλει τη χρήση των
τεχνολογιών του ιστού και ειδικά εκείνων που διευκολύνουν τη δημιουργία
της διάδρασης στο τερματικό του χρήστη. Στην περίπτωση που είναι
αναγκαίο η δικτυακή εφαρμογή να εκτελείται σε τερματικές συσκευές
διαφορετικού μεγέθους, επιβάλλεται η χρήση των αντίστοιχων τεχνολογικών
αρχετύπων που διευκολύνουν την κλιμάκωση της εφαρμογής σε συσκευές
χρήστη με διαφορετικές δυνατότητες (π.χ., επιτραπέζιος, φορητός,
κινητός, τάμπλετ, κτλ.). Ταυτοχρόνως, αν η δικτυακή φύση της εφαρμογής
απαιτεί και τη διατήρηση της κατάστασης, τότε επιβάλλεται και η χρήση
των τεχνολογιών του εξυπηρετητή σε απομακρυσμένο υπολογιστή.</p>
<figure id="fig:android-emulator">
<img src="../images/android-emulator.png"
alt="Ο εξομοιωτής για τις κινητές συσκευές με λειτουργικό σύστημα Android, εκτός από την εξομοίωση της επεξεργασίας των δεδομένων, περιλαμβάνει και μια προσομοίωση κάποιων κουμπιών και διαδράσεων που συνήθως έχουν τα έξυπνα κινητά." />
<figcaption aria-hidden="true">Ο εξομοιωτής για τις κινητές συσκευές με
λειτουργικό σύστημα Android, εκτός από την εξομοίωση της επεξεργασίας
των δεδομένων, περιλαμβάνει και μια προσομοίωση κάποιων κουμπιών και
διαδράσεων που συνήθως έχουν τα έξυπνα κινητά.</figcaption>
</figure>
<figure id="fig:geolocation-simulation">
<img src="../images/geolocation-simulation.png"
alt="Το iOS SDK περιλαμβάνει την δυνατότητα προσομοίωσης της γεωγραφικής θέσης του χρήστη, γιατί η θέση του πάνω στον χάρτη είναι σημαντική είσοδος για πολλές κινητές εφαρμογές, οι οποίες μπορούν να αλλάξουν την πληροφορία στην οθόνη και να στείλουν ειδοποιήσεις" />
<figcaption aria-hidden="true">Το iOS SDK περιλαμβάνει την δυνατότητα
προσομοίωσης της γεωγραφικής θέσης του χρήστη, γιατί η θέση του πάνω
στον χάρτη είναι σημαντική είσοδος για πολλές κινητές εφαρμογές, οι
οποίες μπορούν να αλλάξουν την πληροφορία στην οθόνη και να στείλουν
ειδοποιήσεις</figcaption>
</figure>
<p>Εξίσου πολύπλοκο τεχνολογικό πλαίσιο μπορεί να έχουμε και για την
ανάπτυξη μιας εφαρμογής επιτραπέζιου υπολογιστή όταν υπάρχει η απαίτηση
η είσοδος να γίνεται από συσκευή χειρονομίας και η έξοδος να γίνεται σε
περιβάλλον εικονικής πραγματικότητας. Γίνεται, λοιπόν, κατανοητό ότι σε
ένα τόσο διευρυμένο τεχνολογικό πλαίσιο, αναφορικά με τις συσκευές
εισόδου και εξόδου με τον χρήστη, ο προγραμματισμός της διάδρασης έχει
περισσότερο να κάνει με τη δοκιμή και την επιλογή των κατάλληλων για την
περίσταση εργαλείων (π.χ., βιβλιοθήκη προγραμματισμού), παρά με τις
λεπτομέρειες της υλοποίησης, οι οποίες μπορεί να είναι τόσο διαφορετικές
όσο και οι διαφορετικές πλατφόρμες ανάπτυξης (π.χ., επιτραπέζιος ΗΥ,
απομακρυσμένος εξυπηρετητής) και εκτέλεσης (π.χ., έξυπνο κινητό, έξυπνο
ρολόι). Φυσικά, υπάρχουν κάποιες σταθερές αξίες που ισχύουν ανεξάρτητα
από το τεχνολογικό πλαίσιο και τις λεπτομέρειες της κάθε βιβλιοθήκης
προγραμματισμού, όπως είναι ο συνεχής έλεγχος που είδαμε στην
προηγούμενη ενότητα, καθώς και ο έλεγχος σε ένα περιβάλλον που θα
μοιάζει με αυτό της τελικής πλατφόρμας εκτέλεσης, τον οποίο θα δούμε
στην επόμενη ενότητα.</p>
<p>Όταν η τελική εφαρμογή έχει ως πλατφόρμα εκτέλεσης την ίδια την
πλατφόρμα ανάπτυξης (π.χ., ανάπτυξη εφαρμογής για την επιφάνεια εργασίας
σε επιτραπέζιο υπολογιστή), τότε η μετατροπή του πηγαίου κώδικα σε
εκτελέσιμο κώδικα μπορεί να δοκιμαστεί άμεσα από τον προγραμματιστή πάνω
στον ίδιο υπολογιστή. Στην περίπτωση όμως που η τελική πλατφόρμα
εκτέλεσης είναι διαφορετική από την πλατφόρμα ανάπτυξης μιας εφαρμογής,
τότε η δουλειά του προγραμματιστή διευκολύνεται από έναν προσομοιωτή.
Στην περίπτωση που η εφαρμογή δεν έχει διεπαφή με τον χρήστη, τότε ο
προσομοιωτής είναι απλά αναγκαίος για τη δοκιμή και αποσφαλμάτωση του
πηγαίου κώδικα. Όμως, στην πιο ενδιαφέρουσα περίπτωση που η τελική
εφαρμογή περιλαμβάνει και την ανάγκη για διάδραση με τον χρήστη, τότε
έχουμε την απαίτηση ο προσομοιωτής να είναι κάτι παραπάνω από ένα μαύρο
κουτί. Αν και στην απλή εκτέλεση κώδικα υψηλού επιπέδου (π.χ., Java) για
διαφορετική τελική συσκευή είναι δόκιμο να χρησιμοποιήσουμε την έννοια
του εξομοιωτή (emulator), αυτό σίγουρα δεν είναι σκόπιμο για την
περίπτωση του προγραμματισμού της διάδρασης, όπου η χρήση του
προσομοιωτή (simulator) είναι περισσότερο εύστοχη. <a href="#fn17"
id="fnref17" class="footnote-ref" role="doc-noteref"><sup>17</sup></a>
<a href="#fn18" id="fnref18" class="footnote-ref"
role="doc-noteref"><sup>18</sup></a></p>
<p>Ένας προσομοιωτής για τη δοκιμή εφαρμογών με διάδραση χρήστη που
εκτελούνται σε διαφορετική πλατφόρμα ανάπτυξης θα πρέπει να περιλαμβάνει
και την αντίστοιχη διεπαφή ή τουλάχιστον κάποια προσομοίωση αυτής. Για
παράδειγμα, ο προσομοιωτής για τα έξυπνα κινητά τηλέφωνα περιλαμβάνει
οθόνη, τα αντίστοιχα εικονικά κουμπιά και την προσομοίωση για κάποιες
χειρονομίες. Η οθόνη του προσομοιωτή δεν είναι ίδια με αυτήν της τελικής
συσκευής, αφού η οθόνη του υπολογιστή ανάπτυξης τις περισσότερες φορές
έχει διαφορετικές προδιαγραφές, αλλά σίγουρα είναι πολύ κοντά. Από την
άλλη πλευρά, οι συσκευές εισόδου σε ένα έξυπνο κινητό (π.χ., κουμπιά
πάνω στη συσκευή, αισθητήρες κίνησης και θέσης, πολυαπτική οθόνη, κτλ.)
είναι πολύ διαφορετικές από το πληκτρολόγιο και το ποντίκι του
επιτραπέζιου υπολογιστή ανάπτυξης, με αποτέλεσμα ο βαθμός προσομοίωσης
της διάδρασης να είναι μικρός.</p>
<p>Συμπερασματικά, ο προσομοιωτής είναι ένα αναγκαίο κακό που
διευκολύνει μεν τις δοκιμές κατά τα πρώτα στάδια της ανάπτυξης, αλλά δεν
μπορεί να αντικαταστήσει τις δοκιμές στην τελική συσκευή, επειδή η
διάδραση με τον χρήστη δεν μπορεί να προσομοιωθεί εν γένει. Μάλιστα, όσο
πιο πολύ διαφέρει η διάδραση με τον προσομοιωτή από εκείνη με την τελική
συσκευή, τόσο πιο αναγκαίο είναι ένα μεγάλο μέρος της ανάπτυξης να γίνει
στην τελική συσκευή. Από την άλλη πλευρά, ο εξομοιωτής είναι αναγκαίος
όταν θέλουμε να κατασκευάσουμε ένα νέο περιβάλλον προγραμματισμού της
διάδρασης.<a href="#fn19" id="fnref19" class="footnote-ref"
role="doc-noteref"><sup>19</sup></a></p>
<figure id="fig:pygmalion">
<img src="../images/pygmalion.jpg"
alt="Το σύστημα Pygmalion, στα μέσα της δεκαετίας του 1970, ήταν εκείνο που έδωσε τον ορισμό για τα εικονίδια, αλλά κυρίως ήταν το πρώτο που επέτρεψε τη δημιουργία λογισμικού με βάση την τελική συμπεριφορά και το αποτέλεσμα που πρέπει να έχει ένα πρόγραμμα υπολογιστή (αντί της κυρίαρχης πρακτικής που ήταν να δίνουμε οδηγίες στο πρόγραμμα για το τι ακριβώς να κάνει)." />
<figcaption aria-hidden="true">Το σύστημα Pygmalion, στα μέσα της
δεκαετίας του 1970, ήταν εκείνο που έδωσε τον ορισμό για τα εικονίδια,
αλλά κυρίως ήταν το πρώτο που επέτρεψε τη δημιουργία λογισμικού με βάση
την τελική συμπεριφορά και το αποτέλεσμα που πρέπει να έχει ένα
πρόγραμμα υπολογιστή (αντί της κυρίαρχης πρακτικής που ήταν να δίνουμε
οδηγίες στο πρόγραμμα για το τι ακριβώς να κάνει).</figcaption>
</figure>
<figure id="fig:programming-example">
<img src="../images/programming-example.jpg"
alt="Το σύστημα SmallStar επιτρέπει την δημιουργία νέου λογισμικού χωρίς την χρήση γλώσσας προγραμματισμού με κείμενο για την ροή εκτέλεσης. Για τον σκοπό αυτό, ο χρήστης κάνει εγγραφή της αλληλεπίδρασης με την διεπαφή και συμπληρώνει φόρμες όπου υπάρχει ασάφεια." />
<figcaption aria-hidden="true">Το σύστημα SmallStar επιτρέπει την
δημιουργία νέου λογισμικού χωρίς την χρήση γλώσσας προγραμματισμού με
κείμενο για την ροή εκτέλεσης. Για τον σκοπό αυτό, ο χρήστης κάνει
εγγραφή της αλληλεπίδρασης με την διεπαφή και συμπληρώνει φόρμες όπου
υπάρχει ασάφεια.</figcaption>
</figure>
<p>Ο οπτικός προγραμματισμός έχει γνωρίσει μεγάλη αποδοχή στις
περιπτώσεις της εκμάθησης προγραμματισμού, στον αντικειμενοστραφή
προγραμματισμό, και ειδικά στον σχεδιασμό της διεπαφής με χρήστη.
Αρχικά, ο οπτικός προγραμματισμός επιτρέπει την οπτική οργάνωση και
επισκόπηση στην περίπτωση που έχουμε πηγαίο κώδικα μεγάλης κλίμακας. Σε
αυτήν την περίπτωση, ο οπτικός προγραμματισμός λειτουργεί ως ένα επίπεδο
αφαίρεσης των λεπτομερειών της υλοποίησης, έτσι ώστε ο κατασκευαστής να
μπορεί να εστιάσει αρχικά στον συνδυασμό των επιμέρους αντικειμένων και
στη συνολική αρχιτεκτονική της διάδρασης. Με αυτόν τον τρόπο, ο
αντικειμενοστραφής προγραμματισμός μπορεί να διευκολυνθεί από ένα οπτικό
περιβάλλον προγραμματισμού.</p>
<p>Στην περίπτωση του σχεδιασμού της διεπαφής με τον υπολογιστή, ο
οπτικός προγραμματισμός επιτρέπει στον κατασκευαστή να χρησιμοποιήσει
έτοιμα μοτίβα ή να φτιάξει τα δικά του. Για παράδειγμα, η Visual Basic
ήταν μια πολύ διαδεδομένη γλώσσα προγραμματισμού για το λειτουργικό
σύστημα Microsoft Windows, γιατί παρείχε ένα οπτικό περιβάλλον
σχεδιασμού της διεπαφής. Ο προγραμματιστής μπορούσε να διαλέξει οπτικά
τα εικονίδια, τα μενού και τις φόρμες που ήθελε να συμπεριλάβει στην
εφαρμογή του και έπειτα να τα συνδυάσει με τις ενέργειες και τις
λειτουργίες του προγράμματος. Με αυτόν τον τρόπο δημιουργείται ένας
διαχωρισμός ανάμεσα στη διεπαφή και την υλοποίηση των λειτουργιών, που
διευκολύνει και τον καταμερισμό της εργασίας ανάμεσα στους
προγραμματιστές των λειτουργιών και σε εκείνους της διεπαφής. <a
href="#fn20" id="fnref20" class="footnote-ref"
role="doc-noteref"><sup>20</sup></a> <a href="#fn21" id="fnref21"
class="footnote-ref" role="doc-noteref"><sup>21</sup></a></p>
<p>Οι γλώσσες προγραμματισμού με την ευρεία έννοια τους είναι οι δομικές
τεχνολογίες για τα συστήματα διάδρασης, αφού με αυτές υλοποιούνται και
καθορίζεται η ποιότητα των διαδραστικών συστημάτων. Οι γλώσσες
προγραμματισμού που βασίζονται σε γραπτό κείμενο είναι ο βασικός τρόπος
διάδρασης για όσους θέλουν να κατασκευάσουν ένα διαδραστικό σύστημα,
ακόμη και αν αυτό χρησιμοποιεί μια άλλη συμβολική γλώσσα πέρα από το
κείμενο για την αλληλεπίδραση με τον χρήστη. Για παράδειγμα, το UNIX
κατασκευάστηκε με την γλώσσα προγραμματισμού C, αλλά οι χρήστες θα
αλληλεπιδράσουν με ένα κέλυφος που παρέχει ένα σετ από βασικές εντολές
που μπορούν να συνδυαστούν σε απλά προγράμματα. Αντίθετα, το σύστημα του
Alto βασίζεται μόνο στην Smalltalk η οποία εκτός από γλώσσα
προγραμματισμού καθορίζει και την συμπεριφορά του συστήματος διάδρασης
συνολικά τόσο στην βάση του, όσο και στις τελικές εφαρμογές, ενώ στο
UNIX αν θέλουμε μια νέα διαφορετική εντολή ή σημαντικές αλλαγές στο
σύστημα, αυτό μπορεί να γίνει με την γλώσσα C. Το χάσμα ανάμεσα στην
γλώσσα προγραμματισμού και στην διάδραση γίνεται ακόμη μεγαλύτερο κατά
την μετάβαση στις γραφικές διεπαφές επιφάνειας εργασίας, όπου η διάδραση
βασίζεται στον απευθείας χειρισμό αντικειμένων στην οθόνη. Για να
γεφυρωθεί αυτό το χάσμα προγραμματισμού έχει αναπτυχθεί η τεχνική του
προγραμματισμού με παραδείγματα, όπου ο προγραμματιστής αντί να
περιγράφει στον υπολογιστή πως θα εκτελέσει μια λειτουργία, χρησιμοποιεί
την διάδραση με απευθείας χειρισμό για να δείξει το αποτέλεσμα που
θέλει. Η τεχνική του προγραμματισμού με παραδείγματα μπορεί θεωρητικά να
δώσει τις δυνατότητες του προγραμματισμού σε χρήστες με μικρότερες
δεξιότητες, αλλά στην πράξη δεν έχει αποδειχτεί χρήσιμη ούτε
εκπαιδευτικά, ούτε στην αποτελεσματικότητα των νέων δημιουργιών,
αφήνοντας έτσι όλο το βάρος στην ανάπτυξη δεξιοτήτων με τις γλώσσες
προγραμματισμού ή ακόμη καλύτερα στην ανάπτυξη νέων γλωσσών
προγραμματισμού.</p>
<p>Τελευταία σε αυτήν την ενότητα αφήσαμε τη γλώσσα προγραμματισμού,
επειδή, τουλάχιστον στην περίπτωση του προγραμματισμού της διάδρασης,
έχει τη λιγότερη σημασία σε σχέση με τις παραμέτρους που εξετάσαμε
παραπάνω. Τα περισσότερα βιβλία για τον προγραμματισμό ασχολούνται
αποκλειστικά με μία γλώσσα προγραμματισμού. Αυτό είναι σωστό μόνο στην
περίπτωση που κάποιος θέλει να μάθει μια γλώσσα προγραμματισμού, και
λάθος όταν κάποιος θέλει να μάθει τη λογική πίσω από τον προγραμματισμό
υπολογιστών -πράγμα πιο σημαντικό από τις συντακτικές λεπτομέρειες της
κάθε γλώσσας. Η γλώσσα προγραμματισμού είναι σίγουρα μια σπουδαία
παράμετρος, τόσο στην εκμάθηση προγραμματισμού όσο και στον
προγραμματισμό της διάδρασης, αλλά δεν είναι η μόνη παράμετρος, ούτε η
σημαντικότερη. Ειδικά για τη συγγραφή κώδικα κατά τον προγραμματισμό της
διάδρασης, ισχύει ότι η κατάλληλη γλώσσα είναι εκείνη που διευκολύνει τη
γρήγορη δημιουργία και επαναληπτική αλλαγή για πολλά εναλλακτικά
πρωτότυπα υψηλής πιστότητας.</p>
<p>Για την κατασκευή της διάδρασης, αυτό που έχει μεγαλύτερη σημασία από
την γλώσσα προγραμματισμού, είναι ο μεταφραστής αυτής της γλώσσας στο
τελικό εκτελέσιμο πρόγραμμα για κάποιον υπολογιστή. Ο προγραμματιστής
που έχει την κατανόηση και κυρίως τον έλεγχο του μεταφραστή είναι
ελεύθερος τόσο από την ίδια την γλώσσα προγραμματισμού όσο και από το
υλικό εκτέλεσης. Ιδανικά, ο προγραμματιστής που έχει και την κατανόηση
του πεδίου εφαρμογής, μπορεί να δημιουργήσει μια γλώσσα για αυτό ακριβώς
το πεδίο, έτσι ώστε το πρόγραμμα ως κείμενο να είναι πολύ κοντά στις
ιδιότητες αυτού του πεδίου. Για την υλοποίηση του μεταφραστή μιας νέας
γλώσσας μπορεί να χρησιμοποιηθεί μια ήδη υπάρχουσα γλώσσα και η ανάπτυξη
να γίνει σε διαφορετικό υπολογιστή από αυτόν της τελικής εκτέλεσης.
Εναλλακτικά, ένας μεταφραστής μπορεί να γραφτεί στην ίδια την γλώσσα που
μεταφράζει. Σε αυτήν την περίπτωση, η υλοποίηση μπορεί να ξεκινήσει από
ένα υποσύνολο της γλώσσας, η οποία υλοποιείται απευθείας στο χαρτί σε
συμβολική γλώσσα μηχανής. Για την την καλύτερη φορητότητα της γλώσσας, ο
προγραμματιστής μπορεί να ορίσει μια ενδιάμεση εικονική μηχανή, οπότε η
γλώσσα μπορεί να τρέξει και σε διαφορετικό υλικό από άλλους ή
μελλοντικά. Τα αυτόνομα συστήματα είναι δυσκολότερο να σχεδιαστούν
αρχικά, αλλά είναι περισσότερο προσαρμόσιμα σε διαφορετικές ανάγκες μέσω
των επεκτάσεων.</p>
<section id="footnotes" class="footnotes footnotes-end-of-section"
role="doc-endnotes">
<hr />
<ol start="7">
<li><div id="fn7">
<p><span class="citation" data-cites="olsen2009building">Olsen
(2009)</span><a href="#fnref7" class="footnote-back"
role="doc-backlink">↩︎</a></p>
</div></li>
<li><div id="fn8">
<p><span class="citation" data-cites="grudin1990computer">Grudin
(1990)</span><a href="#fnref8" class="footnote-back"
role="doc-backlink">↩︎</a></p>
</div></li>
<li><div id="fn9">
<p><span class="citation" data-cites="graham2004hackers">Graham
(2004)</span>, <span class="citation"
data-cites="mcconnell2004code">McConnell (2004)</span>, <span
class="citation" data-cites="thimbleby2007press">Thimbleby
(2007)</span><a href="#fnref9" class="footnote-back"
role="doc-backlink">↩︎</a></p>
</div></li>
<li><div id="fn10">
<p><span class="citation" data-cites="noble2009programming">Noble
(2009)</span><a href="#fnref10" class="footnote-back"
role="doc-backlink">↩︎</a></p>
</div></li>
<li><div id="fn11">
<p>fig:smalltalk<a href="#fnref11" class="footnote-back"
role="doc-backlink">↩︎</a></p>
</div></li>
<li><div id="fn12">
<p>fig:lilith-modula<a href="#fnref12" class="footnote-back"
role="doc-backlink">↩︎</a></p>
</div></li>
<li><div id="fn13">
<p><span class="citation" data-cites="andrew2000pragmatic">Andrew και
David (2000)</span><a href="#fnref13" class="footnote-back"
role="doc-backlink">↩︎</a></p>
</div></li>
<li><div id="fn14">
<p>fig:emacs-ide<a href="#fnref14" class="footnote-back"
role="doc-backlink">↩︎</a></p>
</div></li>
<li><div id="fn15">
<p>fig:vim-ide<a href="#fnref15" class="footnote-back"
role="doc-backlink">↩︎</a></p>
</div></li>
<li><div id="fn16">
<p><span class="citation" data-cites="reas2007processing">Reas και Fry
(2007)</span>, <span class="citation"
data-cites="victor2012learnable">Victor (2012)</span><a href="#fnref16"
class="footnote-back" role="doc-backlink">↩︎</a></p>
</div></li>
<li><div id="fn17">
<p>fig:android-emulator<a href="#fnref17" class="footnote-back"
role="doc-backlink">↩︎</a></p>
</div></li>
<li><div id="fn18">
<p>fig:geolocation-simulation<a href="#fnref18" class="footnote-back"
role="doc-backlink">↩︎</a></p>
</div></li>
<li><div id="fn19">
<p><span class="citation" data-cites="ingalls2020evolution">Ingalls
(2020)</span><a href="#fnref19" class="footnote-back"
role="doc-backlink">↩︎</a></p>
</div></li>
<li><div id="fn20">
<p>fig:pygmalion<a href="#fnref20" class="footnote-back"
role="doc-backlink">↩︎</a></p>
</div></li>
<li><div id="fn21">
<p>fig:programming-example<a href="#fnref21" class="footnote-back"
role="doc-backlink">↩︎</a></p>
</div></li>
</ol>
</section>
<h2 id="συνεργατική-κατασκευή-και-ιδιοκτησία">Συνεργατική κατασκευή και
ιδιοκτησία</h2>
<p>Σε αυτήν την ενότητα περιγράφουμε τις ιδιότητες που παρουσιάζει μια
γενιά οργανισμών που προσπαθούν να μεγιστοποιήσουν τους δεσμούς τους με
άλλους συγγενείς οργανισμούς. Το όραμά τους στηρίζεται σε μια
διαφορετική φιλοσοφία για την ιδιοκτησία και την αξία, ενώ ο
ακρογωνιαίος λίθος για αυτό το οικοδόμημα είναι η συνεργασία των
προγραμματιστών μεταξύ τους, καθώς και ο προγραμματισμός της διεπαφής
του προγραμματιστή, ο οποίος αποτελεί ειδική περίπτωση του
προγραμματισμού της διάδρασης με αποδέκτη έναν χρήστη -τον
προγραμματιστή.</p>
<p>Σε πολλά από τα δημοφιλή βιβλία προγραμματισμού και σχεδίασης
λογισμικού υπάρχει η εξειδανικευμένη εικόνα ότι η σχεδίαση ξεκινάει από
μια λευκή σελίδα. Στην πράξη αυτό είναι πολύ σπάνιο, μάλιστα στις
περισσότερες περιπτώσεις όπου η σχεδίαση ενός προγράμματος ξεκινάει από
μια λευκή σελίδα, συνήθως οδηγείται προς μια σχετικά ελλιπή εκδοχή ενός
προγράμματος που ήδη υπάρχει κάπου αλλού σε πολύ πιο βελτιωμένη μορφή.
Φυσικά υπάρχουν και οι εξαιρέσεις, όπου θα πρέπει να δημιουργηθεί μια
πραγματικά πρωτότυπη εφαρμογή στον υπολογιστή, αλλά στις περισσότερες
περιπτώσεις αυτό που βλέπουμε είναι παραλλαγές, ή ακόμη καλύτερα,
δημιουργικές συνθέσεις πάνω σε βασικά αρχέτυπα που ήδη υπάρχουν και τα
οποία αναφέρονται σε κάποιες ανθρώπινες ανάγκες και συνήθειες.</p>
<p>Στο πλαίσιο του διαμοιρασμού εργαλείων και τεχνικών, έχει
δημιουργηθεί μια ευρεία κίνηση από χομπίστες και ερευνητές οι οποίοι
συνεργάζονται, είτε σε ειδικές συναντήσεις είτε με τη βοήθεια του
δικτύου για τη σχεδίαση και κατασκευή νέων εργαλείων που διευκολύνουν τη
δουλειά τους ή απλώς για διασκέδαση, χωρίς να έχουν εξωτερικά κίνητρα. Η
κίνηση του Do-It-Yourself σίγουρα δεν είναι νέα, και δεν αφορά μόνο το
υλικό και λογισμικό, αλλά πλέον αναπτύσσεται και σε αυτόν τον τομέα πολύ
γρήγορα, και προσφέρει ιδέες που δεν θα βρούμε στο εμπόριο.</p>
<figure id="fig:xerox-colab">
<img src="../images/xerox-colab.jpg"
alt="Δύο δεκαετίες μετά την δημιουργία του επιτραπέζιου υπολογιστή γραφείου οι ερευνητές του Xerox PARC δημιουργούν λογισμικό που διευκολύνει την σύγχρονη συνεργασία δια ζώσης, όπου εκτός από τους προσωπικούς υπολογιστές προσθέτουν και τον ηλεκτρονικό πίνακα τοίχου." />
<figcaption aria-hidden="true">Δύο δεκαετίες μετά την δημιουργία του
επιτραπέζιου υπολογιστή γραφείου οι ερευνητές του Xerox PARC δημιουργούν
λογισμικό που διευκολύνει την σύγχρονη συνεργασία δια ζώσης, όπου εκτός
από τους προσωπικούς υπολογιστές προσθέτουν και τον ηλεκτρονικό πίνακα
τοίχου.</figcaption>
</figure>
<figure id="fig:makerspace">
<img src="../images/makerspace.jpg"
alt="Στα εργαστήρια τύπου hackerspace η τεχνολογική καινοτομία και η μάθηση αποτελούν βασικό στόχο, τον οποίο πετυχαίνουν μέσω της συνεργασίας και της πειραματικής εξερεύνησης. Με αυτόν τον τρόπο, εργαλεία και τεχνικές που στο παρελθόν κατείχαν μόνο μεγάλες εταιρείες, πλέον βρίσκονται στην διάθεση των τελικών χρηστών, οι οποίοι έχουν επίσης τους ρόλους του σχεδιαστή και του κατασκευαστή." />
<figcaption aria-hidden="true">Στα εργαστήρια τύπου hackerspace η
τεχνολογική καινοτομία και η μάθηση αποτελούν βασικό στόχο, τον οποίο
πετυχαίνουν μέσω της συνεργασίας και της πειραματικής εξερεύνησης. Με
αυτόν τον τρόπο, εργαλεία και τεχνικές που στο παρελθόν κατείχαν μόνο
μεγάλες εταιρείες, πλέον βρίσκονται στην διάθεση των τελικών χρηστών, οι
οποίοι έχουν επίσης τους ρόλους του σχεδιαστή και του
κατασκευαστή.</figcaption>
</figure>
<p>Η διαδικασία της συνεργατικής σχεδίασης έρχεται να ενισχύσει τον ήδη
σημαντικό ρόλο του χρήστη στον προγραμματισμό της διάδρασης. Ο ρόλος του
τελικού χρήστη ενός υπολογιστικού συστήματος είναι κεντρικός στη
διαδικασία της ανθρωποκεντρικής σχεδίασης, αφού με βάση τον χρήστη
καθορίζονται οι προδιαγραφές του συστήματος και γίνονται οι ενδιάμεσες
αξιολογήσεις της καταλληλότητάς του. Στη συνεργατική σχεδίαση ο χρήστης
κρατάει αυτόν τον κεντρικό ρόλο και επιπλέον αναλαμβάνει έναν ρόλο δίπλα
στους σχεδιαστές του συστήματος που πιθανώς να χρησιμοποιήσει στο μέλλον
είτε προσωπικά είτε στην εργασία του. To πρόγραμμα Apple Hypercard ήταν
από τα πρώτα εμπορικά λογισμικά ευρείας χρήσης που έδωσαν στους τελικούς
χρήστες πολλές δυνατότητες αλλαγής της συμπεριφοράς του, μια πρακτική
που συνεχίστηκε με τη δυνατότητα αυτοματοποίησης συχνών ενεργειών σε
επίπεδο λειτουργικού συστήματος (π.χ., Apple Scripts) ή εφαρμογών
γραφείου (π.χ., Microsoft Office Macros). Σταδιακά, η ενίσχυση του ρόλου
του χρήστη ως ισότιμου σχεδιαστή και κατασκευαστή του προγραμματισμού
της διάδρασης καλύπτει όχι μόνο το λογισμικό αλλά και το υλικό του
υπολογιστή, αφού με τη διάχυση των οικονομικών και ευέλικτων
μικρο-υπολογιστών (π.χ., Arduino, RaspberryPi, κτλ.) οι χρήστες μπορούν
να κατασκευάσουν αυτό που θέλουν. Με αυτόν τον τρόπο, στα αρχικά
κινήματα ανεξάρτητων κατασκευαστών βιντεοπαιχνιδιών, έρχονται να
προστεθούν τα ομότιμα εργαστήρια κατασκευής νέων τεχνολογιών διάδρασης,
τα οποία έγιναν γνωστά με ονόματα όπως makerlab, hackerspace. <a
href="#fn22" id="fnref22" class="footnote-ref"
role="doc-noteref"><sup>22</sup></a> <a href="#fn23" id="fnref23"
class="footnote-ref" role="doc-noteref"><sup>23</sup></a></p>
<p>Η ιδιοκτησία ενός συστήματος διάδρασης είναι ένα πολύπλοκο φαινόμενο,
γιατί ένα σύστημα διάδρασης είναι συνήθως μια σύνθεση από υλικό και
λογισμικό που απευθύνεται σε έναν άνθρωπο, στον χρήστη του. Από τη μια
πλευρά, το υλικό και το λογισμικό καλύπτονται από διαφορετική νομοθεσία
για την ιδιοκτησία, με το υλικό να καλύπτεται από δίπλωμα ευρεσιτεχνίας
(πατέντα, αγγλ. patent) ενώ το λογισμικό να θεωρείται κείμενο και να
καλύπτεται από την πνευματική ιδιοκτησία (copyright). Από την άλλη
πλευρά, η ανθρωποκεντρική διαδικασία ανάπτυξης ενός συστήματος διάδρασης
άπτεται της νομοθεσίας για την εργονομία, που αφορά κυρίως τις πατέντες.
Οι παραδοσιακές επιχειρήσεις στον χώρο του λογισμικού είναι
υπερπροστατευτικές με την πνευματική ιδιοκτησία τους και περιχαρακώνουν
την περιοχή που τους ανήκει. Αντιθέτως, οι επιχειρήσεις που βασίζονται
στις τεχνολογίες του υπολογισμού και του δικτύου προσπαθούν να είναι όσο
γίνεται περισσότερο ανοικτού κώδικα και ταυτόχρονα να δημιουργούν
συνέργειες με άλλες επιχειρήσεις. <a href="#fn24" id="fnref24"
class="footnote-ref" role="doc-noteref"><sup>24</sup></a> <a
href="#fn25" id="fnref25" class="footnote-ref"
role="doc-noteref"><sup>25</sup></a></p>
<figure id="fig:github-contributions">
<img src="../images/github-contributions.png"
alt="Η αναγνώριση της σχετικής συνεισφοράς σε ένα συνεργατικό έργο έχει μεγάλη σημασία γιατί τα περισσότερα έργα και επαγγελματικές δραστηριότητες της σύγχρονης οικονομίας είναι συνεργατικά. Eπομένως, οι ατομικές επιδόσεις σε επιμέρους μαθήματα δε δίνουν αντιπροσωπευτική εικόνα των δεξιοτήτων ενός εκπαιδευόμενου." />
<figcaption aria-hidden="true">Η αναγνώριση της σχετικής συνεισφοράς σε
ένα συνεργατικό έργο έχει μεγάλη σημασία γιατί τα περισσότερα έργα και
επαγγελματικές δραστηριότητες της σύγχρονης οικονομίας είναι
συνεργατικά. Eπομένως, οι ατομικές επιδόσεις σε επιμέρους μαθήματα δε
δίνουν αντιπροσωπευτική εικόνα των δεξιοτήτων ενός
εκπαιδευόμενου.</figcaption>
</figure>
<figure id="fig:github-profile">
<img src="../images/github-profile.png"
alt="Το προφίλ ενός χρήστη στο αποθετήριο πηγαίου κώδικα δίνει μια εποπτική εικόνα της ποιότητας και της ποσότητας της συνεισφοράς του σε συνεργατικά έργα, και μπορεί να αποτελέσει μοντέλο για τη βελτίωση της πιστοποίησης που δίνουν τα μαθήματα και οι σχολές." />
<figcaption aria-hidden="true">Το προφίλ ενός χρήστη στο αποθετήριο
πηγαίου κώδικα δίνει μια εποπτική εικόνα της ποιότητας και της ποσότητας
της συνεισφοράς του σε συνεργατικά έργα, και μπορεί να αποτελέσει
μοντέλο για τη βελτίωση της πιστοποίησης που δίνουν τα μαθήματα και οι
σχολές.</figcaption>
</figure>
<p>Στην πράξη, το νομικό πλαίσιο είναι τόσο ασαφές και πολύπλοκο
εξαιτίας της φύσης των συστημάτων διάδρασης, που οι εταιρείες
οχυρώνονται με όσες περισσότερες πατέντες μπορούν να αγοράσουν ή να
κατοχυρώσουν· κάνουν εκατέρωθεν μηνύσεις, και τελικά συμβιβάζονται
εξωδικαστικά. Για παράδειγμα, εταιρείες όπως η Microsoft ή η Apple, οι
οποίες αναπτύχθηκαν πολύ πριν τη διάχυση της δικτυακής κουλτούρας,
βασίζουν τη δραστηριότητά τους σε σχετικά κλειστά συστήματα, τα οποία
προστατεύουν με πολλούς τρόπους. Ένας τρόπος με τον οποίο προσπάθησαν οι
εταιρείες του χώρου να προστατέψουν το λογισμικό τους -ειδικά το τμήμα
της διεπαφής- είναι οι πατέντες. Η Apple στα τέλη της δεκαετίας του 1980
είχε κάνει μήνυση στη Microsoft για την ομοιότητα που παρουσίαζε η
διεπαφή των πρώτων εκδόσεων των Windows με το αντίστοιχο λειτουργικό
σύστημα του Macintosh. Μια δεκαετία αργότερα, η Amazon προσπάθησε να
κερδίσει πατέντα για τη δυνατότητα που έδινε στους αγοραστές να ψωνίζουν
με ένα μόνο κλικ (<em>one-click buying</em>) του ποντικιού ένα προϊόν
από το δικτυακό μαγαζί της.</p>
<p>Πολλοί επικριτές τους έχουν παρομοιάσει τις παραπάνω πατέντες με την
προσπάθεια να κερδίσει μια εταιρεία πατέντα για ένα εργαλείο όπως το
σφυρί: δεν υπάρχουν πολλοί τρόποι που να μπορεί ο άνθρωπος να κρατήσει
και να χρησιμοποιήσει ένα σφυρί, και αν κάποιος κατοχυρώσει αυτήν την
πατέντα αποκτά ένα ανταγωνιστικό πλεονέκτημα που τελικά δεν θα βοηθήσει
την κοινωνία συνολικά. Ενώ, λοιπόν, είναι αποδεκτό ότι η αποτελεσματική
προστασία της πνευματικής ιδιοκτησίας είναι σημαντικό κίνητρο για τους
δημιουργούς, ταυτόχρονα έχει γίνει κατανοητό ότι υπάρχει μια πολύ λεπτή
διαχωριστική γραμμή ανάμεσα στην καινοτομία που πρέπει να προστατευτεί
και στο προφανές που πρέπει να είναι διαθέσιμο σε όλους. Δυστυχώς, αυτή
η λεπτή διαχωριστική γραμμή δεν είναι ευδιάκριτη, ενώ με τη συνεχή
εξέλιξη της τεχνολογίας και των ανθρώπινων αναγκών είναι
μετακινούμενη.</p>
<p>Οι οργανισμοί και οι εταιρείες της οικονομίας του δικτύου εντοπίζουν
και ορίζουν την ταυτότητα και τον σκοπό τους όχι με βάση μια αγορά, αλλά
με βάση τους συνδέσμους συνεργασίας που έχουν με όλους τους παίκτες σε
μια αγορά. Για παράδειγμα, πάρα πολλά από τα δεδομένα του Google και του
Twitter είναι ελεύθερα διαθέσιμα, επειδή -αν και έτσι δίνουν πρόσβαση σε
αυτά και στους ανταγωνιστές τους- η αύξηση της χρήσης τους κάνει τις
ίδιες τις εταιρείες πιο σημαντικές. Με άλλα λόγια αυξάνει έμμεσα την
αγορά τους. Συνοπτικά, η πρώτη προσέγγιση βλέπει την αγορά σαν μια πίτα
σταθερού μεγέθους από την οποία προσπαθεί να πάρει το καλύτερο ή
μεγαλύτερο κομμάτι. Η δεύτερη προσέγγιση φαντάζεται μια πίτα που
μεγαλώνει συνέχεια. Την ενδιαφέρει να κρατήσει το κομμάτι που έχει, ενώ
δεν την πειράζει και να χάσει κάτι από αυτό, αρκεί η συνολική πίτα-αγορά
να μεγαλώνει και το δικό της κομμάτι να βρίσκεται σε ανάπτυξη. Αυτή η
μικρή φαινομενικά διαφορά αντιμετώπισης της αγοράς λογισμικού έχει πολύ
μεγάλες συνέπειες στην επιχειρηματική πρακτική και το ακριβές μείγμα της
μπορεί να υλοποιηθεί από τον τρόπο που ορίζει μια εταιρεία τη διεπαφή
του προγραμματιστή.</p>
<section id="footnotes" class="footnotes footnotes-end-of-section"
role="doc-endnotes">
<hr />
<ol start="22">
<li><div id="fn22">
<p>fig:xerox-colab<a href="#fnref22" class="footnote-back"
role="doc-backlink">↩︎</a></p>
</div></li>
<li><div id="fn23">
<p>fig:makerspace<a href="#fnref23" class="footnote-back"
role="doc-backlink">↩︎</a></p>
</div></li>
<li><div id="fn24">
<p>fig:github-contributions<a href="#fnref24" class="footnote-back"
role="doc-backlink">↩︎</a></p>
</div></li>
<li><div id="fn25">
<p>fig:github-profile<a href="#fnref25" class="footnote-back"
role="doc-backlink">↩︎</a></p>
</div></li>
</ol>
</section>
<h2 id="η-περίπτωση-του-arduino">Η περίπτωση του Arduino</h2>
<p>Το Arduino είναι ένας πολύ δημοφιλής μικροελεγκτής που φτιάχτηκε με
αρχικό σκοπό τον προγραμματισμό και την εκπαίδευση των φοιτητών της
διάδρασης ανθρώπου και υπολογιστή με συστήματα εισόδου-εξόδου, πέρα από
τα κλασικά πληκτρολόγιο, ποντίκι, και οθόνη που έχουμε στους
επιτραπέζιους ΗΥ. Πριν το Arduino, οι φοιτητές και οι ερευνητές που
ήθελαν να δημιουργήσουν και να πειραματιστούν με νέα συστήματα εισόδου
και εξόδου έπρεπε πρώτα να συνδέσουν στον επιτραπέζιο υπολογιστή
κάποιους αισθητήρες και ελεγκτές μέσω ενός εξωτερικού μικροεπεξεργαστή
που μεταφράζει τα αναλογικά σήματα σε ψηφιακά και αντίστροφα. Μεγάλο
μέρος αυτής της διαδικασίας είναι όμοιο ανεξάρτητα από το είδος του
αισθητήρα που συνδέουμε, επομένως, ένα σημαντικό μέρος της προ-εργασίας
που γινόταν ήταν απλά εμπόδιο και καθυστέρηση για τον βασικό στόχο, ενώ
ταυτόχρονα απαιτούσε και ειδικές δεξιότητες στην ηλεκτρονική και στους
μικροεπεξεργαστές, που πολλοί δημιουργικοί κατασκευαστές της διάδρασης
δεν είχαν. Αυτήν την ανάγκη ήρθε να καλύψει το Arduino που δημιουργήθηκε
από τους καθηγητές της μεταπτυχιακής σχολής διάδρασης ανθρώπου και
υπολογιστή στο Ινστιτούτο Ιβρέα της Ιταλίας.</p>
<figure id="fig:arduino-uno">
<img src="../images/arduino-uno.jpg"
alt="Υπάρχουν πάρα πολλά είδη Arduino τα οποία εξυπηρετούν διαφορετικές ανάγκες, ανάλογα με την υπολογιστική ισχύ και το μέγεθος, άλλα όλη η σειρά αυτών των μικροελεγκτών έχει σχεδιαστεί με βασικό στόχο την γρήγορη κατασκευή προτοτύπων διάδρασης που βασίζονται σε νέες καινοτόμες συσκευές εισόδου και εξόδου." />
<figcaption aria-hidden="true">Υπάρχουν πάρα πολλά είδη Arduino τα οποία
εξυπηρετούν διαφορετικές ανάγκες, ανάλογα με την υπολογιστική ισχύ και
το μέγεθος, άλλα όλη η σειρά αυτών των μικροελεγκτών έχει σχεδιαστεί με
βασικό στόχο την γρήγορη κατασκευή προτοτύπων διάδρασης που βασίζονται
σε νέες καινοτόμες συσκευές εισόδου και εξόδου.</figcaption>
</figure>
<figure id="fig:arduino-ide">
<img src="../images/arduino-ide.png"
alt="Ο προγραμματισμός νέων διεπαφών με τον χρήστη ήταν μια εξειδικευμένη εργασία που απαιτούσε γνώσεις τόσο υλικού όσο και λογισμικού υπολογιστών. Το ολοκληρωμένο περιβάλλον ανάπτυξης του Arduino περιλαμβάνει βιβλιοθήκες και γλώσσα προγραμματισμού που μοιάζουν με την δημοφιλή C, τα οποία κρύβουν τις λεπτομέρειες του υλικού και επιτρέπουν στον κατασκευαστή να εστιάσει στις νέες λειτουργίες που σχεδιάζει." />
<figcaption aria-hidden="true">Ο προγραμματισμός νέων διεπαφών με τον
χρήστη ήταν μια εξειδικευμένη εργασία που απαιτούσε γνώσεις τόσο υλικού
όσο και λογισμικού υπολογιστών. Το ολοκληρωμένο περιβάλλον ανάπτυξης του
Arduino περιλαμβάνει βιβλιοθήκες και γλώσσα προγραμματισμού που μοιάζουν
με την δημοφιλή C, τα οποία κρύβουν τις λεπτομέρειες του υλικού και
επιτρέπουν στον κατασκευαστή να εστιάσει στις νέες λειτουργίες που
σχεδιάζει.</figcaption>
</figure>
<p>Το βασικό μοντέλο Arduino Uno<a href="#fn26" id="fnref26"
class="footnote-ref" role="doc-noteref"><sup>26</sup></a> έρχεται με μια
θύρα USB η οποία αποτελεί το κύριο κανάλι δικτυακής επικοινωνίας με έναν
επιτραπέζιο ΗΥ. Η θύρα USB είναι πολύ χρήσιμη για να φορτώσουμε μια νέα
έκδοση της εφαρμογής μας, καθώς και για να δοκιμάσουμε μια εφαρμογή που
θα πρέπει να έχει πρόσβαση σε δεδομένα του ευρύτερου δικτύου του
επιτραπέζιου ΗΥ. Αν και αυτές οι δυνατότητες δικτυακής επικοινωνίας
είναι συνήθως αρκετές για τα περισσότερα εκπαιδευτικά και οικιακά έργα
που γίνονται με Arduino, είναι πολύ περιορισμένες για κάτι εμπορικό ή
για κάτι που είναι ανεξάρτητο από τον παραδοσιακό επιτραπέζιο ΗΥ. Για
αυτόν τον σκοπό οι σχεδιαστές του Arduino έχουν προβλέψει την τοποθέτηση
επεκτάσεων με έναν τυποποιημένο τρόπο που λέγεται shield.</p>
<p>Το Arduino έχει πολλές εισόδους, τόσο ψηφιακές όσο και αναλογικές,
που μπορούν να συνδεθούν με μια μεγάλη ποικιλία απλών αισθητήρων, αλλά
και με πιο πολύπλοκες κατασκευές. Ο ευκολότερος τρόπος για να δώσουμε
είσοδο στο Arduino είναι η απευθείας σύνδεση ενός αισθητήρα με τις
ψηφιακές/αναλογικές εισόδους του. Σε πιο πολύπλοκα συστήματα εισόδου ο
σχεδιαστής μπορεί να φτιάξει ένα ηλεκτρικό κύκλωμα στο συνοδευτικό
breadboard. Εκτός από τη δυνατότητα για είσοδο από εναλλακτικά
συστήματα, πέρα από το πληκτρολόγιο/ποντίκι, το Arduino σχεδιάστηκε για
να δίνει και έξοδο σε εναλλακτικά συστήματα, πέρα από την παραδοσιακή
οθόνη και τον εκτυπωτή. Φυσικά, όπως και στην περίπτωση των εισόδων, οι
χρήστες του Arduino έχουν βρει πολλές ακόμη εφαρμογές, οι περισσότερες
από τις οποίες εμπνέονται από τα συστήματα ελέγχου (π.χ., βιομηχανία,
ασφάλεια, κτλ.).</p>
<p>Το Arduino δεν ήταν η πρώτη προσπάθεια κατασκευής ενός μικροελεγκτή
που διασυνδέεται εύκολα με επιπλέον αισθητήρες, αφού στο παρελθόν είχαν
γίνει αντίστοιχες προσπάθειες τόσο από μεγάλα ερευνητικά έργα και
πανεπιστήμια όσο και από εταιρείες, αλλά κανένα δεν είχε την αποδοχή του
Arduino σε τόσο μικρό χρονικό διάστημα. Αν και δεν είναι εύκολο να
εντοπίσουμε όλες τις παραμέτρους που συνέβαλαν στην επιτυχία του,
σίγουρα μια από αυτές ήταν το γεγονός ότι το έργο βασιζόταν σε
τεχνολογία με ευέλικτη άδεια χρήσης, η οποία επέτρεψε σε άλλους
κατασκευαστές να φτιάξουν τις δικές του εκδοχές. Επιπλέον, η φύση του
ανοικτού κώδικα έδωσε την αυτοπεποίθηση σε πολλούς σχεδιαστές να το
επιλέξουν, αφού έτσι θα είχαν μεγαλύτερη ασφάλεια από πιθανές αλλαγές
που θα αποφάσιζε μονομερώς μια εταιρεία. Στα λίγα χρόνια της κυκλοφορίας
του, η αποδοχή και η ευελιξία του Arduino αποδείχτηκαν τόσο μεγάλες, που
δημιουργήθηκε μια αντίστοιχα μεγάλη και ενεργή κοινότητα χρηστών που
ασχολούνται με εφαρμογές πολύ πέρα από τους αρχικούς στόχους του
σχεδιασμού του.</p>
<p>Συνολικά, το Arduino δίνει την ελευθερία στον σχεδιαστή της διάδρασης
ανθρώπου και υπολογιστή να σκεφτεί και να κατασκευάσει σχετικά εύκολα
και οικονομικά εναλλακτικούς τρόπους διάδρασης, πέρα από τον επιτραπέζιο
ΗΥ.<a href="#fn27" id="fnref27" class="footnote-ref"
role="doc-noteref"><sup>27</sup></a> Όπως ακριβώς το Linux και το
Processing, το Arduino βασίζεται περισσότερο σε μια κοινότητα χρηστών
παρά σε μια ιεραρχικά οργανωμένη εταιρεία για την παροχή μιας σειράς
υπηρεσιών όπως η πώληση, η τεκμηρίωση και η υποστήριξη. Οι ομοιότητες
μεταξύ του Processing και του Arduino δε σταματούν στα κίνητρα και στην
ανοικτή κοινότητα ανάπτυξης, αλλά συνεχίζονται και στην υιοθέτηση του
περιβάλλοντος ανάπτυξης του Processing από το Arduino.<a href="#fn28"
id="fnref28" class="footnote-ref" role="doc-noteref"><sup>28</sup></a>
Βλέπουμε, λοιπόν, ότι ένα απλό περιβάλλον ανάπτυξης που βασίζεται στις
συνεχείς αλλαγές του κώδικα και στον γρήγορο έλεγχο του αποτελέσματος
είναι βασική προϋπόθεση για τον προγραμματισμό της διάδρασης ανεξάρτητα
από το τεχνολογικό πλαίσιο (π.χ., πολυμέσα, επιτραπέζιος, διάχυτος
υπολογισμός).</p>
<section id="footnotes" class="footnotes footnotes-end-of-section"
role="doc-endnotes">
<hr />
<ol start="26">
<li><div id="fn26">
<p>fig:arduino-uno<a href="#fnref26" class="footnote-back"
role="doc-backlink">↩︎</a></p>
</div></li>
<li><div id="fn27">
<p><span class="citation" data-cites="banzi2014getting">Banzi και Shiloh
(2014)</span><a href="#fnref27" class="footnote-back"
role="doc-backlink">↩︎</a></p>
</div></li>
<li><div id="fn28">
<p>fig:arduino-ide<a href="#fnref28" class="footnote-back"
role="doc-backlink">↩︎</a></p>
</div></li>
</ol>
</section>
<h2 id="η-περίπτωση-του-reactable">Η περίπτωση του Reactable</h2>
<p>Το Reactable είναι ένα ψηφιακό μουσικό σύστημα που βασίζεται στη
διάδραση με την αφή και με απτά αντικείμενα.<a href="#fn29" id="fnref29"
class="footnote-ref" role="doc-noteref"><sup>29</sup></a> Εκτός από την
εκθεσιακή του εγκατάσταση και την πειραματική του χρήση, έχει
χρησιμοποιηθεί σε συναυλίες από γνωστά συγκροτήματα και μουσικούς, όπως
οι Coldplay και η Bjork. Το σύστημα -που είναι πλέον εμπορικό- ξεκίνησε
από ένα ερευνητικό έργο σε πανεπιστήμιο και οι δημιουργοί του έκαναν
διαθέσιμο μεγάλο μέρος από το λογισμικό και τις οδηγίες για την
κατασκευή του υλικού, έτσι ώστε να μπορούν περισσότεροι χρήστες να το
φτιάξουν και να το τροποποιήσουν.</p>
<p>Το υλικό του Reactable βασίζεται σε έναν βίντεο-προβολέα και μία
κάμερα, που λειτουργούν ως συσκευές άμεσης εισόδου και εξόδου πάνω σε
μια οριζόντια επιφάνεια, η οποία έχει τη μορφή ενός στρογγυλού
τραπεζιού. Η επιφάνεια διάδρασης μπορεί και αναγνωρίζει την αφή σε
πολλαπλά σημεία και την τοποθέτηση αντικειμένων τα οποία έχουν ένα είδος
γραμμοκώδικα (fiducials). Το μεγάλο μέγεθος της οθόνης σε συνδυασμό με
τη δυνατότητα αναγνώρισης πολλαπλών σημείων αφής και πολλών αντικειμένων
επιτρέπει την ταυτόχρονη και συνεργατική διάδραση πολλών χρηστών, καθώς
και την κατασκευή σύνθετων αναπαραστάσεων που στην περίπτωση του
Reactable είναι φίλτρα ηλεκτρονικής μουσικής. Φυσικά, τίποτα δεν
εμποδίζει έναν κατασκευαστή να χρησιμοποιήσει τα αρχέτυπα διάδρασης του
Reactable (πολυαπτικό, απτά αντικείμενα) για να αναπτύξει εφαρμογές σε
άλλα πεδία, όπως π.χ. στην εκπαίδευση και τις καλιτεχνικές
βιντεοεγκαταστάσεις.<a href="#fn30" id="fnref30" class="footnote-ref"
role="doc-noteref"><sup>30</sup></a></p>
<p>Από τη σκοπιά των εργαλείων και της διαδικασίας ανάπτυξης, το πιο
ενδιαφέρον τμήμα του λογισμικού ReacTIVision που χρησιμοποιείται στο
σύστημα Reactable είναι το υποσύστημα της προσομοίωσης. Η δοκιμή για
νέες χειρονομίες, για συνεργατικές εφαρμογές σε πολυαπτική οθόνη, μπορεί
να ξεκινήσει από τον προσομοιωτή που εκτελείται πάνω στον επιτραπέζιο
υπολογιστή και επιτρέπει στον κατασκευαστή να εξερευνήσει σχετικά άμεσα,
μέσα από γρήγορη δοκιμή και επανάληψη, πιθανές εναλλακτικές. Στη
συνέχεια, βέβαια, θα πρέπει να έχει στη διάθεσή του και την αντίστοιχη
πραγματική πολυαπτική επιφάνεια, αφού είναι διαφορετικό για τους χρήστες
να χειρίζονται απτά αντικείμενα και τα δάκτυλά τους, από το να
προσομοιώνουν όλες αυτές τις κινήσεις μέσω του ποντικιού.</p>
<p>Συνοπτικά, βλέπουμε ότι η περίπτωση του προγραμματισμού της διάδρασης
για το Reactable, που αντιπροσωπεύει ένα νέο σύστημα διάδρασης, απαιτεί
πολλές δεξιότητες πέρα από τη γλώσσα προγραμματισμού. Αρχικά, οι
κατασκευαστές του Reactable είχαν ως στόχο να ικανοποιήσουν τις ανάγκες
μιας πολύ συγκεκριμένης ομάδας χρηστών, των μουσικών που παίζουν ζωντανά
ηλεκτρονική μουσική. Με αφετηρία τις ειδικές ανάγκες αυτής της ομάδας
σχεδίασαν και κατασκεύασαν τόσο το υλικό όσο και το λογισμικό για τη νέα
συσκευή διάδρασης. Σε αυτήν την προσπάθεια δε χρειάστηκε να επανεφεύρουν
τον τροχό. Αντιθέτως, ενσωμάτωσαν όσα περισσότερα έτοιμα στοιχεία
μπορούσαν από σχετικά έργα (π.χ., πολυαπτική οθόνη προβολής, αναγνώριση
εικόνας, πρωτόκολλο μετάδοσης δεδομένων). Σε αναλογία με την περίπτωση
της γραφικής επιφάνειας εργασίας του επιτραπέζιου υπολογιστή, η οποία
στόχευε να διευκολύνει την εργασία στο γραφείο, οι κατασκευαστές του
Reactable οδηγήθηκαν σε μια νέα συσκευή διάδρασης που εξυπηρετεί τις
ανάγκες της ζωντανής ηλεκτρονικής μουσικής με έναν νέο τρόπο, ο οποίος
όμως βασίζεται σε στοιχεία από προηγούμενη έρευνα και ταυτόχρονα έχει
την ευελιξία να εξυπηρετεί και σχετικές ομάδες χρηστών.</p>
<figure id="fig:reactable-music">
<img src="../images/reactable-music.jpg"
alt="Το ηλεκτρονικό μουσικό όργανο Reactable βασίζεται σε μια δημιουργική σύνθεση υλικού και λογισμικού που είναι εύκολα διαθέσιμη και παρότι ξεκίνησε ως ερευνητικό έργο σε πανεπιστήμιο δεν άργησε να βρει αποδοχή από τη μουσική αγορά." />
<figcaption aria-hidden="true">Το ηλεκτρονικό μουσικό όργανο Reactable
βασίζεται σε μια δημιουργική σύνθεση υλικού και λογισμικού που είναι
εύκολα διαθέσιμη και παρότι ξεκίνησε ως ερευνητικό έργο σε πανεπιστήμιο
δεν άργησε να βρει αποδοχή από τη μουσική αγορά.</figcaption>
</figure>
<figure id="fig:reactable-fountain">
<img src="../images/reactable-fountain.jpg"
alt="Το διαφορετικό πλαίσιο χρήσης και οι διαφορετικές ανάγκες των χρηστών του Reactable οδήγησαν τους σχεδιαστές στην κατασκευή ενός προσομοιωτή για μια νέα κατηγορία εφαρμογών όπου εκτός από τη μουσική χρησιμοποιείται και αλλού, όπως στον έλεγχο της ροής του νερού και των φωτιστικών εφέ για ένα συντριβάνι στην Βαρκελώνη." />
<figcaption aria-hidden="true">Το διαφορετικό πλαίσιο χρήσης και οι
διαφορετικές ανάγκες των χρηστών του Reactable οδήγησαν τους σχεδιαστές
στην κατασκευή ενός προσομοιωτή για μια νέα κατηγορία εφαρμογών όπου
εκτός από τη μουσική χρησιμοποιείται και αλλού, όπως στον έλεγχο της
ροής του νερού και των φωτιστικών εφέ για ένα συντριβάνι στην
Βαρκελώνη.</figcaption>
</figure>
<section id="footnotes" class="footnotes footnotes-end-of-section"
role="doc-endnotes">
<hr />
<ol start="29">
<li><div id="fn29">
<p>fig:reactable-music<a href="#fnref29" class="footnote-back"
role="doc-backlink">↩︎</a></p>
</div></li>
<li><div id="fn30">
<p>fig:reactable-fountain<a href="#fnref30" class="footnote-back"
role="doc-backlink">↩︎</a></p>
</div></li>
</ol>
</section>
<h2 id="σύντομη-βιογραφία-του-bill-atkinson">Σύντομη βιογραφία του Bill
Atkinson</h2>
<figure id="fig:atkinson-profile">
<img src="../images/atkinson-profile.jpg"
alt="Ο Bill Atkinson ήταν βασικός συντελεστής σε σημαντικά προϊόντα όπως τα Apple Lisa και Macintosh, καθώς και το Apple Paint, όπου κατασκεύασε την διάδραση με τα μενού και τις παλέτες εργαλείων. Η συνεισφορά του αποτυπώνεται καλύτερα στο Hypercard το οποίο έδωσε για πρώτη φορά την δυνατότητα σε απλούς χρήστες να φτιάξουν τις δικές του εφαρμογές πολύμεσων και υπερκειμένου." />
<figcaption aria-hidden="true">Ο Bill Atkinson ήταν βασικός συντελεστής
σε σημαντικά προϊόντα όπως τα Apple Lisa και Macintosh, καθώς και το
Apple Paint, όπου κατασκεύασε την διάδραση με τα μενού και τις παλέτες
εργαλείων. Η συνεισφορά του αποτυπώνεται καλύτερα στο Hypercard το οποίο
έδωσε για πρώτη φορά την δυνατότητα σε απλούς χρήστες να φτιάξουν τις
δικές του εφαρμογές πολύμεσων και υπερκειμένου.</figcaption>
</figure>
<figure id="fig:macpaint-prototype">
<img src="../images/macpaint-prototype.jpg"
alt="Πριν ακόμη κατασκευαστεί το γραφικό περιβάλλον με τα παράθυρα, ο Bill Atkinson ανάπτυξε το λογισμικό ψηφιακής επεξεργασίας εικόνας Sketchpad, το οποίο τρέχει στον αρχικό εξομοιωτή και βοήθησε στον διαχωρισμό του λειτουργικού συστήματος από τις εφαρμογές, αλλά και στην σχεδίαση στοιχείων του μελλοντικού γραφικού περιβάλλοντος." />
<figcaption aria-hidden="true">Πριν ακόμη κατασκευαστεί το γραφικό
περιβάλλον με τα παράθυρα, ο Bill Atkinson ανάπτυξε το λογισμικό
ψηφιακής επεξεργασίας εικόνας Sketchpad, το οποίο τρέχει στον αρχικό
εξομοιωτή και βοήθησε στον διαχωρισμό του λειτουργικού συστήματος από
τις εφαρμογές, αλλά και στην σχεδίαση στοιχείων του μελλοντικού γραφικού
περιβάλλοντος.</figcaption>
</figure>
<p>Το πιο δημοφιλές λογισμικό που δημιούργησε ο Bill Atkinson ήταν η
γραφική διεπαφή χρήστη για την επιφάνεια εργασίας του πρώτου Apple
Macintosh,<a href="#fn31" id="fnref31" class="footnote-ref"
role="doc-noteref"><sup>31</sup></a> όπου καθόρισε την λειτουργία των
μενού που τραβιούνται προς τα κάτω και το διπλό κλικ. Με αφετηρία έναν
εξομοιωτή για τον υπολογιστή Liza που έτρεχε στον Apple II σταδιακά
κατασκεύασε την διάδραση για το παραθυρικό περιβάλλον, καθώς και την
εφαρμογή MacPaint,<a href="#fn32" id="fnref32" class="footnote-ref"
role="doc-noteref"><sup>32</sup></a> ως παράδειγμα για το νέο είδος
φιλικών και δημιουργικών εφαρμογών που θα αναπτύσονταν μελλοντικά πάνω
σε αυτήν την πλατφόρμα.</p>
<p>Εκτός από το ευρέως γνωστό λογισμικό διάδρασης της πλατφόρμας του
Macintosh, δημιούργησε την εφαρμογή Hypercard, η οποία έδωσε σημαντικές
δυνατότητες ανάπτυξης νέων εφαρμογών σε χρήστες που δεν είχαν γνώσεις
προγραμματισμού. Το Hypercard έδωσε πίσω στους χρήστες της γραφικής
επιφάνειας εργασίας έναν μικρό τουλάχιστον έλεγχο των διαθέσιμων
εφαρμογών, ενώ παράλληλα αποτέλεσε το βασικό συγγραφικό εργαλείο για μια
νέα κατηγορία πολυμεσικών εφαρμογών. Με την εφαρμογή Hypercard, οι
χρήστες μπορούσαν να πλοηγούνται σε υπερμεσικό περιεχόμενο και την ίδια
στιγμή να επεξεργάζονται την πληροφορία, δυνατότητες που θα χαθούν σε
μεταγενέστερα συστήματα.</p>
<p>Η έμφαση στην εικόνα, στην δημιουργία, και στην ενδυνάμωση τους μέσω
της τεχνολογίας δεν είναι τυχαία. Ο Bill Atkinson μεγάλωσε με χόμπυ την
φωτογραφία, που συνέχισε να υπηρετεί σε όλη του την ζωή και επηρέασε
λιγότερο ή περισσότερο άμεσα το λογισμικό που δημιούργησε. Εκτός από τα
QuickDraw, MacPaint, Hypercard, ως απάντηση στο ανερχόμενο Instagram
κατασκεύασε την κινητή εφαρμογή PhotoCard, η οποία χρησιμοποιεί τις
δυνατότητες του έξυπνου κινητού ώστε να δώσει νέα ζωή στις παραδοσιακές
κάρτ ποστάλ. Για την κατασκευή του λογισμικού διάδρασης χρησιμοποιεί
πάντα μεταφορές από τον φυσικό κόσμο, ενώ προτιμάει να εργάζεται σε
απόλυτη συγκέντρωση στο σπίτι και επισκέπτεται την εταιρία για να κάνει
δοκιμές με τους χρήστες.</p>
<p>Η πολυμεσική επικοινωνία ήταν επίσης το αντικείμενο της εταιρίας
General Magic, η οποία με το λογισμικό Magic Cap ήταν η πρώτη που
προσπάθησε να μεταφέρει τις δυνατότητες του επιτραπέζιου προσωπικού
υπολογιστή σε μια μικρή φορετή συσκευή χεριού. Αν και η εταιρία αυτή δεν
πέτυχε, η τεχνογνωσία που ανέπτυξαν οι συντελεστές της μεταφέρθηκε στους
νεότερους υπαλλήλους της και οδήγησε τελικά στην δημιουργία των iPhone
και Android που κυριάρχησαν δύο δεκαετίες αργότερα. Αυτό που διατρέχει
την δουλειά του διαχρονικά είναι η έμφαση στην σημασία του
προγραμματισμού που βρίσκεται στην υπηρεσία της ανθρώπινης έκφρασης και
δημιουργικότητας.</p>
<section id="footnotes" class="footnotes footnotes-end-of-section"
role="doc-endnotes">
<hr />
<ol start="31">
<li><div id="fn31">
<p>fig:atkinson-profile<a href="#fnref31" class="footnote-back"
role="doc-backlink">↩︎</a></p>
</div></li>
<li><div id="fn32">
<p>fig:macpaint-prototype<a href="#fnref32" class="footnote-back"
role="doc-backlink">↩︎</a></p>
</div></li>
</ol>
</section>
<h2 class="unnumbered" id="βιβλιογραφία">Βιβλιογραφία</h2>
<div id="refs" class="references csl-bib-body hanging-indent"
role="list">
<div id="ref-andrew2000pragmatic" class="csl-entry" role="listitem">
Andrew, Hunt, και Thomas David. 2000. <span>‘The Pragmatic Programmer:
From Journeyman to Master’</span>. Addison Wesley Longman, Redwood City.
</div>
<div id="ref-banzi2014getting" class="csl-entry" role="listitem">
Banzi, Massimo, και Michael Shiloh. 2014. <em>Getting started with
Arduino: the open source electronics prototyping platform</em>. Maker
Media, Inc.
</div>
<div id="ref-graham2004hackers" class="csl-entry" role="listitem">
Graham, Paul. 2004. <em>Hackers &amp; painters: big ideas from the
computer age</em>. " O’Reilly Media, Inc.".
</div>
<div id="ref-grudin1990computer" class="csl-entry" role="listitem">
Grudin, Jonathan. 1990. <span>‘The computer reaches out: the historical
continuity of interface design’</span>. Στο <em>Proceedings of the
SIGCHI conference on Human factors in computing systems</em>, 261–68.
ACM.
</div>
<div id="ref-ingalls2020evolution" class="csl-entry" role="listitem">
Ingalls, Daniel. 2020. <span>‘The evolution of Smalltalk: from
Smalltalk-72 through Squeak’</span>. <em>Proceedings of the ACM on
Programming Languages</em> 4 (HOPL): 1–101.
</div>
<div id="ref-markoff2005dormouse" class="csl-entry" role="listitem">
Markoff, John. 2005. <em>What the dormouse said: How the sixties
counterculture shaped the personal computer industry</em>. Penguin.
</div>
<div id="ref-mcconnell2004code" class="csl-entry" role="listitem">
McConnell, Steve. 2004. <em>Code complete</em>. Pearson Education.
</div>
<div id="ref-noble2009programming" class="csl-entry" role="listitem">
Noble, Joshua. 2009. <em>Programming interactivity: a designer’s guide
to Processing, Arduino, and OpenFrameworks</em>. " O’Reilly Media,
Inc.".
</div>
<div id="ref-olsen2009building" class="csl-entry" role="listitem">
Olsen, Dan. 2009. <em>Building interactive systems: principles for
human-computer interaction</em>. Cengage Learning.
</div>
<div id="ref-reas2007processing" class="csl-entry" role="listitem">
Reas, Casey, και Ben Fry. 2007. <em>Processing: a programming handbook
for visual designers and artists</em>. 6812. Mit Press.
</div>
<div id="ref-thimbleby2007press" class="csl-entry" role="listitem">
Thimbleby, H. 2007. <em>press on: Principles of Interaction
Programming</em>. MIT Press, Cambridge.
</div>
<div id="ref-victor2012learnable" class="csl-entry" role="listitem">
Victor, Bret. 2012. <span>‘Learnable programming: Designing a
programming system for understanding programs’</span>. 2012. <a
href="http://worrydream.com/LearnableProgramming">http://worrydream.com/LearnableProgramming</a>.
</div>
</div>
<h1 id="μοντέλα">Μοντέλα</h1>
<blockquote>
<p>Το σπουδαίο έργο του Einstein είχε προέλθει από φυσική διαίσθηση και
όταν ο Einstein σταμάτησε να δημιουργεί, ήταν επειδή έπαψε να σκέφτεται
με συγκεκριμένες φυσικές εικόνες και έγινε χειριστής εξισώσεων. Freeman
Dyson</p>
</blockquote>
<h3 id="περίληψη">Περίληψη</h3>
<p>Η αρχική αντίληψη που είχαν οι περισσότεροι για τη διάδραση του
υπολογιστή με τον άνθρωπο είναι ότι ο υπολογιστής είναι κυρίως ένα
εργαλείο. Ένα εργαλείο που δημιουργήθηκε και χρησιμοποιείται από τον
άνθρωπο για να βελτιώσει τις δραστηριότητές του σε διάφορους τομείς της
ζωής και κυρίως στην εργασία. Για παράδειγμα, στη διάδραση ανθρώπου και
υπολογιστή μια από τις πιο δημοφιλείς εφαρμογές είναι η ψηφιακή
επεξεργασία κειμένου. Στην επεξεργασία κειμένου ο ρόλος του υπολογιστή
ως εργαλείου είναι η βελτίωση της εργασίας που μέχρι τότε γινόταν με
εργαλείο τη γραφομηχανή, και ακόμη παλιότερα με την πένα. Στην πορεία, η
ευελιξία που έχει ο υπολογιστής στην εκτέλεση διαφορετικών προγραμμάτων
χρήστη και η εφεύρεση νέων στυλ διάδρασης, πέρα από την εισαγωγή
κειμένου πάνω στο πληκτρολόγιο, επέτρεψαν στη διάδραση να έχει
περισσότερους ρόλους πέρα από αυτόν του εργαλείου. Επιπλέον, τα νέα
μοντέλα διάδρασης δίνουν μεγαλύτερη σημασία σε αξίες πέρα από τη
γνωστική επεξεργασία της πληροφορίας, όπως τα συναισθήματα, η κοινωνική
διάσταση, καθώς και η συνολική παρουσία του ανθρώπινου σώματος στον
χώρο.</p>
<p>Καθώς προχωράμε σε νέα μοντέλα διάδρασης δε σημαίνει ότι τα
προηγούμενα βασικά μοντέλα της διάδρασης χάνονται. Αντίθετα, τα βασικά
μοντέλα της διάδρασης συνεχίζουν να έχουν σημαντικό ρόλο ως συστατικά
στοιχεία σε πιο σύνθετα συστήματα. Για παράδειγμα, ένα σύστημα συζήτησης
εξ αποστάσεως έχει ως βασικό στοιχείο του το κοινωνικό μοντέλο
διάδρασης, όπου ο υπολογιστής μεσολαβεί στην επικοινωνία και συνεργασία
δύο ή περισσότερων ανθρώπων, αλλά μπορεί να περιέχει και το εργαλείο της
ανάκτησης πληροφορίας από παλιότερες συζητήσεις. Επιπλέον, το ίδιο
σύστημα μπορεί να επεκταθεί με το μοντέλο του πράκτορα διάδρασης, ο
οποίος παρακολουθεί εκ μέρους του χρήστη τις συζητήσεις που γίνονται και
τον ενημερώνει όταν υπάρχει κάτι που τον ενδιαφέρει ή κάνει παρεμβάσεις
εκ μέρους του. Επίσης, το παραπάνω σύστημα συνεργασίας μπορεί να
επεκταθεί με τη χρήση διάχυτων συσκευών διάδρασης, οι οποίες μπορούν να
μεταφέρουν και τη μη λεκτική επικοινωνία. Στα επόμενα, περιγράφουμε την
ιστορική εξέλιξη των μοντέλων διάδρασης καθώς και τη θεωρία για καθένα
ξεχωριστά, ενώ στο επόμενο κεφάλαιο θα δούμε τη σύνθεσή τους.</p>
<h2 id="ο-υπολογιστής-ως-εταίρος">Ο υπολογιστής ως εταίρος</h2>
<figure id="fig:eliza-chat-bot">
<img src="../images/eliza-chat-bot.jpg"
alt="Το διαδραστικο σύστημα ELIZA βασίζεται σε διάλογο με τον χρήστη σε φυσική γλώσσα και έγινε πολύ δημοφιλές με ένα σενάριο, όπου ο υπολογιστής παριστάνει τον ψυχολόγο. Αν και δημιουργήθηκε για να δείξει τους περιορισμούς στην κατανόηση φυσικής γλώσσας από τους υπολογιστές, πολλοί χρήστες προτίμησαν να πιστέψουν ότι μιλάνε με κάποιον που τους καταλαβαίνει." />
<figcaption aria-hidden="true">Το διαδραστικο σύστημα ELIZA βασίζεται σε
διάλογο με τον χρήστη σε φυσική γλώσσα και έγινε πολύ δημοφιλές με ένα
σενάριο, όπου ο υπολογιστής παριστάνει τον ψυχολόγο. Αν και
δημιουργήθηκε για να δείξει τους περιορισμούς στην κατανόηση φυσικής
γλώσσας από τους υπολογιστές, πολλοί χρήστες προτίμησαν να πιστέψουν ότι
μιλάνε με κάποιον που τους καταλαβαίνει.</figcaption>
</figure>
<figure id="fig:microsoft-bob">
<img src="../images/microsoft-bob.jpg"
alt="Παράλληλα με την ανάπτυξη της επιφάνειας εργασίας, γίνονται προσπάθειες για την ανάπτυξη μιας διαλογικής διάδρασης. Η περίπτωση του Microsoft Bob δείνει ότι το αποτέλεσμα της ανθρωποκεντρικής σχεδίασης και των κανόνων σχεδίασης εξαρτάται και από το πλαίσιο χρήσης." />
<figcaption aria-hidden="true">Παράλληλα με την ανάπτυξη της επιφάνειας
εργασίας, γίνονται προσπάθειες για την ανάπτυξη μιας διαλογικής
διάδρασης. Η περίπτωση του Microsoft Bob δείνει ότι το αποτέλεσμα της
ανθρωποκεντρικής σχεδίασης και των κανόνων σχεδίασης εξαρτάται και από
το πλαίσιο χρήσης.</figcaption>
</figure>
<p>Το όραμα για διεπαφές φυσικής γλώσσας έχει διατυπωθεί από πολύ νωρίς
με μια υπόθεση στην τελευταία δημοσίευση του Alan Turing, όπου η
ανταλλαγή μηνυμάτων με έναν υπολογιστή μπορεί να καθορίσει το επίπεδο
νοημοσύνης του δεύτερου. Εξίσου πιθανό βέβαια είναι ο χρήστης να
συμπεριφέρεται έτσι ώστε η δικιά του νοημοσύνη να φαίνεται λιγότερη από
αυτήν του υπολογιστή. Για παράδειγμα, το δημοφιλές ρομπότ ψυχανάλυσης
ELIZA λειτουργεί σε ένα μικρό πεδίο συζήτησης και μπορεί να πείσει τους
χρήστες να μιλήσουν για τα προσωπικά τους σε μια μηχανή και τελικά να
νοιώσουν καλύτερα. Αυτό δεν αποδικνύει τόσο την δυνατότητα να έχουμε
έξυπνους υπολογιστές, όσο την δυνατότητα ή την ευκολία να πιστέψουμε
αυτήν την ιδέα. Παράλληλα με την ανάπτυξη των τεχνολογιών διάδρασης,
αναπτύσεται με πολύ μεγαλύτερους ρυθμούς, ο κλάδος της Τεχνητής
Νοημοσύνης, στον οποίο η διάδραση δεν έχει μεγάλη σημασία, αφού τα
συστήματα αυτά σχεδιάζονται με συμβολικούς τρόπους ή με την μηχανική
μάθηση ώστε να λειτουργούν αυτόνομα. Οι τεχνικές που έχει αναπτύξει ο
κλάδος της Τεχνητής Νοημοσύνης είναι μερικές φορές χρήσιμες ως
υποσυστήματα διάδρασης, αλλά γίνονται λιγότερο χρήσιμες μέχρι και
άγονες, όταν παρουσιάζονται με την τεχνική του ανθρωπομορφισμού. <a
href="#fn1" id="fnref1" class="footnote-ref"
role="doc-noteref"><sup>1</sup></a> <a href="#fn2" id="fnref2"
class="footnote-ref" role="doc-noteref"><sup>2</sup></a></p>
<p>Η αντίληψη του υπολογιστή ως μιας έξυπνης και αυτόνομης οντότητας
εμφανίστηκε για πρώτη φορά στη λογοτεχνία και στις ταινίες επιστημονικής
φαντασίας όπου οι δημιουργοί φαντάζονταν έναν υπολογιστή με ανθρώπινα
στοιχεία διάδρασης. Αυτός ο ανθρωπομορφισμός της διάδρασης ανθρώπου και
υπολογιστή μπορεί να πάρει διάφορες μορφές ή χαρακτηριστικά που
συνδέουμε με την ανθρώπινη παρουσία, όπως πρόσωπο, ομιλία, σώμα,
συναίσθημα, κοινή λογική. Η περιοχή της Τεχνητής Νοημοσύνης προσπάθησε
να δώσει πρακτικές λύσεις στα παραπάνω, αλλά τα αποτελέσματά της έχουν
μόνο περιορισμένη χρησιμότητα και σε πολύ καλά ορισμένες εφαρμογές. Για
παράδειγμα, η αναγνώριση γραφής και ομιλίας είναι πλέον εμπορικά
διαθέσιμες ύστερα από περισσότερα από σαράντα χρόνια έρευνας και
αποτυχημένων εμπορικών προϊόντων. Στην πράξη, όμως, δεν είναι όσο
χρήσιμη τη φαντάστηκαν οι δημιουργοί της επιστημονικής φαντασίας, ούτε
τόσο πρακτική όσο τη σχεδίασαν οι επιστήμονες της Τεχνητής Νοημοσύνης,
αφού στις περισσότερες περιπτώσεις η διάδραση γίνεται με συσκευές
εισόδου και επιπλέον διεπαφές που πρέπει να μάθει να χρησιμοποιεί ο
χρήστης.</p>
<p>Ο αυτοματισμός είναι μια εκδοχή της διάδρασης ανθρώπου και υπολογιστή
όπου οι ενέργειες του χρήστη, η διεπαφή του υπολογιστή ή ακόμη και οι
ανάγκες του χρήστη εξάγονται δυναμικά από τον υπολογιστή, ο οποίος
μπορεί επιπλέον να λαμβάνει αποφάσεις με βάση ορισμένους κανόνες. Ο
αυτοματισμός που προσφέρει ένας υπολογιστής μπορεί να διευκολύνει και τη
διάδραση με τον άνθρωπο. Για παράδειγμα, μια λίστα με εφαρμογές μπορεί
να ταξινομηθεί ανάλογα με το ποιες χρησιμοποιούμε συχνότερα. Φυσικά,
αυτό σημαίνει ότι το αντίστοιχο μενού θα είναι πιθανόν διαφορετικό κάθε
φορά που το ζητάει ο χρήστης, πράγμα που ίσως δημιουργεί, εκτός από
διευκόλυνση, και μια ασυνέπεια απέναντι στη συνήθεια του να βρίσκουμε τα
πράγματα εκεί που τα αφήσαμε. <a href="#fn3" id="fnref3"
class="footnote-ref" role="doc-noteref"><sup>3</sup></a> Αν και ο
αυτοματισμός έχει αποδειχτεί πολύ χρήσιμος σε πολλές εφαρμογές των
υπολογιστών, στην περίπτωση της διάδρασης η χρήση του αυτοματισμού θέλει
προσοχή, κυρίως επειδή θα πρέπει να αξιολογηθεί απέναντι στον χρήστη,
και όχι μόνο απέναντι σε κάποιες λειτουργικές και φαινομενικά
αντικειμενικές προδιαγραφές.</p>
<p>Παράλληλα με τους ερευνητές της Τεχνητής Νοημοσύνης που προσπαθούν να
κωδικοποιήσουν την ανθρώπινη λογική και συμπεριφορά σε έναν υπολογιστή,
οι ερευνητές της Ανθρώπινης Επικοινωνίας διαπιστώνουν ότι στην πράξη οι
ανθρώπινες αντιδράσεις κατά τη διάδραση με υπολογιστές και μέσα
επικοινωνίας δεν έχουν διαφορά από τις αντιδράσεις κατά τη διάδραση με
άλλους ανθρώπους και φυσικά αντικείμενα. Η διαπίστωση αυτή δημιούργησε
μια σειρά από ερευνητικές και εμπορικές απόπειρες στην κατεύθυνση του
ανθρωπομορφισμού (anthropomorphism) και του σκευομορφισμού
(skeuomorphism) κατά τον προγραμματισμό της διάδρασης. Το αρχικό κίνητρο
σε όλες αυτές τις προσπάθειες είναι η δημιουργία μιας περισσότερο
οικείας και “φιλικής” διάδρασης με τον άνθρωπο. Στην πορεία, η “φιλική
διεπαφή” της δεκαετίας του 1990 έδωσε τη θέση της στην “πειστική
διεπαφή” της δεκαετίας του 2000, όταν οι σχεδιαστές προσπάθησαν να
δημιουργήσουν διεπαφές που θα βοηθούσαν τους χρήστες να αλλάξουν
συμπεριφορά.<a href="#fn4" id="fnref4" class="footnote-ref"
role="doc-noteref"><sup>4</sup></a> Για παράδειγμα, μια εφαρμογή που
καταγράφει τα βήματα και την απόσταση που διανύουμε καθημερινά με τα
πόδια, μπορεί να περιέχει τη στατιστική αποτύπωση των επιδόσεών μας και
επιπλέον μια ανθρωπόμορφη διεπαφή που να μας παροτρύνει ή ακόμη και να
μας επικρίνει (ανάλογα με το ψυχολογικό προφίλ του χρήστη) για τις
επιδόσεις μας, έτσι ακριβώς όπως θα έκανε ένας φίλος ή ένας προσωπικός
γυμναστής. <a href="#fn5" id="fnref5" class="footnote-ref"
role="doc-noteref"><sup>5</sup></a></p>
<figure id="fig:adaptive-menus">
<img src="../images/adaptive-menus.png"
alt="Οι χρήστες προτιμούν τα στατικά μενού ή τα μενού που μπορούν να αλλάξουν μόνοι τους, ενώ δεν προτιμούν ούτε έχουν καλή επίδοση με ένα μενού που αλλάζει αυτόματα ανάλογα με τη συχνότητα χρήσης." />
<figcaption aria-hidden="true">Οι χρήστες προτιμούν τα στατικά μενού ή
τα μενού που μπορούν να αλλάξουν μόνοι τους, ενώ δεν προτιμούν ούτε
έχουν καλή επίδοση με ένα μενού που αλλάζει αυτόματα ανάλογα με τη
συχνότητα χρήσης.</figcaption>
</figure>
<figure id="fig:relational-agent">
<img src="../images/relational-agent.jpg"
alt="Ο ανθρωπομορφισμός αρχικά χρησιμοποιήθηκε για να βελτιώσει τη φιλικότητα της διάδρασης με τον υπολογιστή. Στην πορεία δοκιμάστηκε και ως ένας τρόπος να αυξηθεί η πειστικότητα των συμβουλών του υπολογιστή προς έναν χρήστη που θέλει να βελτιώσει τον τρόπο ζωής του." />
<figcaption aria-hidden="true">Ο ανθρωπομορφισμός αρχικά χρησιμοποιήθηκε
για να βελτιώσει τη φιλικότητα της διάδρασης με τον υπολογιστή. Στην
πορεία δοκιμάστηκε και ως ένας τρόπος να αυξηθεί η πειστικότητα των
συμβουλών του υπολογιστή προς έναν χρήστη που θέλει να βελτιώσει τον
τρόπο ζωής του.</figcaption>
</figure>
<p>Ίσως μία από τις πιο αποτυχημένες εισαγωγές νέου προϊόντος διάδρασης
ανθρώπου και υπολογιστή να ήταν η προσπάθεια της Microsoft να δώσει μια
πιο “φιλική” διάδραση στις εφαρμογές της με το Microsoft Bob, και το
σχετικό Microsoft Office Clip. Αν και η ιδέα του ανθρωπομορφισμού
βασιζόταν ήδη σε πολυετή επιστημονική έρευνα<a href="#fn6" id="fnref6"
class="footnote-ref" role="doc-noteref"><sup>6</sup></a> και παρά το ότι
είχαν γίνει πολλές δοκιμές με χρήστες στα αρχικά στάδια του προϊόντος,
τελικά η αποδοχή από το ευρύ κοινό ήταν από μικρή έως αρνητική.</p>
<p>Εκ των υστέρων, μια πιθανή εξήγηση αυτής της έλλειψης αποδοχής είναι
ότι τουλάχιστον στη δεκαετία του 1990 οι περισσότεροι επιτραπέζιοι
υπολογιστές χρησιμοποιούνταν ακόμη κυρίως στην εργασία και γι’ αυτό η
έννοια της “φιλικότητας” μέσω του ανθρωπομορφισμού δεν είχε μεγάλη
σημασία για τους χρήστες τους. Μπορεί να τους φαινόταν ακόμη και
ενοχλητική, καθώς προσπαθούσαν να συγκεντρωθούν για να εργαστούν στον
επεξεργαστή κειμένου και ξαφνικά, στην οθόνη του τερματικού τους, τους
έπιανε κουβέντα ένας σκύλος! Σε δεύτερη ανάγνωση, η ιστορία του
Microsoft Bob είναι και μία προειδοποίηση ότι οι τεχνικές της
ανθρωποκεντρικής σχεδίασης δεν είναι ασφαλείς, όχι επειδή είναι λάθος
τεχνικές, αλλά κυρίως επειδή έχουν ως στόχο να ικανοποιήσουν ανθρώπινες
ανάγκες που είναι από ασαφείς μέχρι ρευστές.</p>
<p>Οι έξυπνοι πράκτορες είναι μια αυτοματοποιημένη εκδοχή της διάδρασης
με τον υπολογιστή. Ένας τρόπος να οριστούν οι έξυπνοι πράκτορες είναι ως
το συμπλήρωμα του απευθείας χειρισμού. Όπως δηλαδή έχουμε τον απευθείας
χειρισμό για να εκτελέσουμε μια διεργασία στον υπολογιστή, έτσι έχουμε
και τους έξυπνους πράκτορες που μπορούν να εκτελέσουν αυτήν τη διεργασία
για λογαριασμό μας. Από τη μια πλευρά, ο απευθείας χειρισμός δίνει στον
χρήστη τη δυνατότητα να πάρει αποφάσεις, αλλά από την άλλη πλευρά
υπάρχει ένα όριο στην πληροφορία που μπορεί να επεξεργαστεί ο χρήστης.
Επιπλέον, σίγουρα υπάρχουν πολλές αποφάσεις που ως παρόμοιες ή
τουλάχιστον έχοντας κάποιες ιδιότητες που είναι παρόμοιες, θα μπορούσαν
να λαμβάνονται από έναν έξυπνο πράκτορα που να εκπροσωπεί τον χρήστη. Αν
και σε πρώτη ανάγνωση φαίνεται ότι οι έξυπνοι πράκτορες είναι το
αντίθετο του απευθείας χειρισμού, εντούτοις είναι περισσότερο γόνιμο να
αντιμετωπίζουμε αυτές τις δύο βασικές φιλοσοφίες διάδρασης ως
συμπληρωματικές. Για παράδειγμα, ο χρήστης με απευθείας χειρισμό δείχνει
στον υπολογιστή ότι κάποια από τα ηλεκτρονικά μηνύματα του είναι άχρηστα
ενώ άλλα είναι χρήσιμα για την εργασία του, έτσι ο έξυπνος πράκτορας την
επόμενη φορά που θα δει ένα μήνυμα θα μπορέσει να το μεταφέρει στον
σωστό φάκελο χωρίς επιπλέον ενέργειες από την πλευρά του χρήστη. Στην
πράξη, αυτά τα συστήματα έχουν βελτιωθεί πάρα πολύ και στις περισσότερες
περιπτώσεις κάνουν λιγότερα λάθη από τον άνθρωπο, όμως σε κάθε περίπτωση
για όποια λάθη κάνουν δεν φέρουν ευθύνη, κι αυτό μπορεί να είναι
σημαντικό σε κάποιες εφαρμογές.</p>
<p>Όταν η μεταφορά γίνεται ιδιαίτερα αναπαραστατική σε ένα γραφικό
περιβάλλον, τότε μιλάμε για σκευομορφισμό, όπως για παράδειγμα πολλές
εφαρμογές στις πρώτες εκδόσεις του iPhone οι οποίες μοιάζουν με
αντικείμενα (π.χ., μικρόφωνο για την εγγραφή ηχητικών σημειώσεων) ή
προσομοιώνουν οπτικά την υφή υλικών, όπως π.χ., μέταλλο, ύφασμα, κτλ. Αν
και το αρχικό iPhone (iOS) ήταν από τις πιο δημοφιλείς συσκευές με
τεχνικές σκευομορφισμού στην έξοδο προς τον χρήστη, σίγουρα δεν ήταν η
πρώτη. Στη δεκαετία του 1990, η σταδιακή μετατροπή και διανομή της
μουσικής με συμπιεσμένα αρχεία τύπου MP3 δημιούργησε την ανάγκη για
ευέλικτες εφαρμογές εκτέλεσης των αρχείων MP3 στον υπολογιστή και
ανάμεσα σε αυτές οι πιο δημοφιλείς ήταν εκείνες που επέτρεπαν στον
χρήστη να αλλάξει την εμφάνιση της εφαρμογής (skinning), με πιο
αντιπροσωπευτικό παράδειγμα την εφαρμογή Winamp. Η χρήση της μεταφοράς
και του σκευομορφισμού δεν έχει από μόνη της πάντα θετικά αποτελέσματα.
Για παράδειγμα, στις αρχές της δεκαετίας του 1990 το λειτουργικό σύστημα
Magic Cap για τον κινητό υπολογισμό εμφάνιζε στην οθόνη ένα γραφείο με
οικεία αντικείμενα, όπως το τηλέφωνο-φαξ, το ημερολόγιο, το
σημειωματάριο, η λίστα επαφών, τα εισερχόμενα/εξερχόμενα, το αρχείο,
κτλ. Η χρήση της μεταφοράς στην περίπτωση του Magic Cap δεν σταματούσε
στο γραφείο, αλλά συνεχιζόταν με τη μετακίνηση του χρήστη σε δωμάτια από
τα οποία είχε πρόσβαση σε διαφορετικές λειτουργίες. Αν και είναι
δύσκολο, έως αδύνατο, να διακρίνουμε τα προβλήματα, καμία από τις
παραπάνω μορφές της διεπαφής με τον χρήστη δεν είχε την αποδοχή των
χρηστών, παρόλο που εφάρμοζαν κάποιους από τους κανόνες της “φιλικής”
για τον άνθρωπο σχεδίασης, όπως είναι η μεταφορά και ο
σκευομορφισμός.</p>
<p>Επιπλέον, με την ανάπτυξη του κινητού και διάχυτου υπολογισμού, στις
αρχές της δεκαετίας του 2000, η διάδραση έκανε το μεγάλο βήμα πέρα από
το πλαίσιο της εργασίας και του γραφείου. Ειδικά για την περίπτωση του
διάχυτου υπολογισμού, όπου έχουμε πολλούς υπολογιστές διαφόρων μορφών
φορετών στον χρήστη ή διάχυτων στο περιβάλλον, η νέα θεώρηση της
διάδρασης βασίστηκε στις φιλοσοφικές θεωρίες για την ενσάρκωση
(embodiment), οι οποίες περιγράφουν την ανθρώπινη σκέψη, την αντίληψη
και τη δράση ως έννοιες στενά δεμένες με την ύπαρξη και τις ιδιότητες
του ανθρώπινου σώματος. Οι υπολογιστές, πλέον, εκτός από την κινητή
μορφή τους, μπορούν να φορεθούν και καταγράψουν βιομετρικά στοιχεία του
χρήστη τους, όπως κινήσεις και σφυγμό. Παράλληλα με τη σταδιακή έμφαση
στη συνολική φύση του ανθρώπου, μια μεγάλη μερίδα του επιστημονικού και
εμπορικού κόσμου συνεχίζει να αναζητεί τη χρησιμότητα του υπολογιστή
στον αυτοματισμό, όπου η διάδραση γίνεται αντιληπτή ως επικοινωνία με
έναν έξυπνο βοηθό.</p>
<section id="footnotes" class="footnotes footnotes-end-of-section"
role="doc-endnotes">
<hr />
<ol>
<li><div id="fn1">
<p>fig:eliza-chat-bot<a href="#fnref1" class="footnote-back"
role="doc-backlink">↩︎</a></p>
</div></li>
<li><div id="fn2">
<p>fig:microsoft-bob<a href="#fnref2" class="footnote-back"
role="doc-backlink">↩︎</a></p>
</div></li>
<li><div id="fn3">
<p>fig:adaptive-menus<a href="#fnref3" class="footnote-back"
role="doc-backlink">↩︎</a></p>
</div></li>
<li><div id="fn4">
<p><span class="citation" data-cites="fogg2003persuasive">Fogg
(2003)</span><a href="#fnref4" class="footnote-back"
role="doc-backlink">↩︎</a></p>
</div></li>
<li><div id="fn5">
<p>fig:relational-agent<a href="#fnref5" class="footnote-back"
role="doc-backlink">↩︎</a></p>
</div></li>
<li><div id="fn6">
<p><span class="citation" data-cites="reeves1996media">Reeves και Nass
(1996)</span><a href="#fnref6" class="footnote-back"
role="doc-backlink">↩︎</a></p>
</div></li>
</ol>
</section>
<h2 id="εργαλείο">Εργαλείο</h2>
<figure id="fig:superpaint-toolbox">
<img src="../images/superpaint-toolbox.jpg"
alt="Ένα από τα πρώτα προγράμματα επεξεργασίας εικόνας βασίζεται στην είσοδο και έξοδο βίντεο για την αποθήκευση και προβολή των εικόνων, οι οποίες ψηφιοποιούνται και μπορούν να επεξεργαστούν με την παλέτα εργαλείων που εμφανίζεται σε μια δεύτερη οθόνη. Η εφαρμογή των εργαλείων από την δεύτερη οθόνη στην εικόνα γίνεται με έμμεση διάδραση από μια πένα σε μια ταμπλέτα. Η τεχνολογία αυτή αναπτύχθηκε παράλληλα με τα γραφικά περιβάλλοντα και οδήγησε σε εφαρμογές ψηφιακής τέχνης και ψηφιακής κινηματογραφίας." />
<figcaption aria-hidden="true">Ένα από τα πρώτα προγράμματα επεξεργασίας
εικόνας βασίζεται στην είσοδο και έξοδο βίντεο για την αποθήκευση και
προβολή των εικόνων, οι οποίες ψηφιοποιούνται και μπορούν να
επεξεργαστούν με την παλέτα εργαλείων που εμφανίζεται σε μια δεύτερη
οθόνη. Η εφαρμογή των εργαλείων από την δεύτερη οθόνη στην εικόνα
γίνεται με έμμεση διάδραση από μια πένα σε μια ταμπλέτα. Η τεχνολογία
αυτή αναπτύχθηκε παράλληλα με τα γραφικά περιβάλλοντα και οδήγησε σε
εφαρμογές ψηφιακής τέχνης και ψηφιακής κινηματογραφίας.</figcaption>
</figure>
<figure id="fig:macpaint">
<img src="../images/macpaint.jpg"
alt="Η εφαρμογή ψηφιακής επεξεργασίας εικόνας MacPaint χρησιμοποιήθηκε για να διαφημίσει την φιλικότητα του Apple Macintosh, καθώς και για να τονίσει την νέα κατεύθυνση των υπολογιστών πέρα από τα εργαλεία και ως μέσα δημιουργικής έκφρασης. Αν και δεν έγινε ευρέως διαθέσιμη σε δημοφιλείς υπολογιστές εκείνης της εποχής, έλαβε άριστες κριτικές και οδήγησε στην δημιουργία εφαρμογών όπως το Photoshop." />
<figcaption aria-hidden="true">Η εφαρμογή ψηφιακής επεξεργασίας εικόνας
MacPaint χρησιμοποιήθηκε για να διαφημίσει την φιλικότητα του Apple
Macintosh, καθώς και για να τονίσει την νέα κατεύθυνση των υπολογιστών
πέρα από τα εργαλεία και ως μέσα δημιουργικής έκφρασης. Αν και δεν έγινε
ευρέως διαθέσιμη σε δημοφιλείς υπολογιστές εκείνης της εποχής, έλαβε
άριστες κριτικές και οδήγησε στην δημιουργία εφαρμογών όπως το
Photoshop.</figcaption>
</figure>
<p>Αρχικά, τόσο οι πρώτοι κεντρικοί- και μίκρο-υπολογιστές όσο και ο
επιτραπέζιος υπολογιστής θεωρήθηκαν εργαλεία για τη διευκόλυνση των
ανθρώπινων εργασιών. Για παράδειγμα, ο υπολογιστής μπορούσε να βοηθήσει
τον χρήστη στον υπολογισμό της τροχιάς ενός διαστημοπλοίου, στη σύνταξη
μιας γραπτής αναφοράς, στη σχεδίαση μιας κατασκευής,<a href="#fn7"
id="fnref7" class="footnote-ref" role="doc-noteref"><sup>7</sup></a>
στην επεξεργασία εικόνας. <a href="#fn8" id="fnref8"
class="footnote-ref" role="doc-noteref"><sup>8</sup></a> <a href="#fn9"
id="fnref9" class="footnote-ref" role="doc-noteref"><sup>9</sup></a> Με
τη διάδοση του δικτύου Internet και την αύξηση της ισχύος (ταχύτητα,
μνήμη, γραφικά) σε προσιτούς οικονομικά υπολογιστές αλλά και σε νέες
μορφές (π.χ., φορητός, παιχνιδομηχανή, έξυπνο κινητό τηλέφωνο, κτλ.) μια
νέα γενιά εφαρμογών διασκέδασης και επικοινωνίας ήρθε στο προσκήνιο, η
οποία απαιτούσε μια διαφορετική θεώρηση της διάδρασης πέρα από τη
χρησιμότητα και την ευχρηστία. Για παράδειγμα, ψυχαγωγικές εφαρμογές
όπως τα βιντεοπαιχνίδια έχουν σκοπό να διασκεδάσουν τον χρήστη και σε
πολλές περιπτώσεις ο στόχος είναι να δυσκολέψουν τον χρήστη παρά να τον
διευκολύνουν, αφού αυτή η προσέγγιση (στις σωστές δόσεις) θα ενισχύσει
την εμβύθιση στην ψυχαγωγική δραστηριότητα.</p>
<p>Η αρχική εφαρμογή της τεχνολογίας των υπολογιστών ήταν στην
αυτοματοποίηση της ανθρώπινης εργασίας υπολογισμού πινάκων για την
τροχιά πυραύλων, κάτι που άλλαξε με τον χρονοδιαμοιρασμό. Αυτή η
θεμελίωση της περιοχής δημιούργησε την αντίστοιχη κατεύθυνση και θεώρηση
των υπολογιστών ως μηχανές δεδομένων που βοηθάνε στην διαδικασία
παραγωγής λογαριθμικών πινάκων. Σύμφωνα με την αρχική θεώρηση, οι
υπολογιστές είναι μηχανές, σαν αυτές που υπάρχουν σε άλλες παραγωγικές
διαδικασίες. Οι μηχανές αυτές αφού κατασκευαστούν πολύ προσεκτικά στην
συνέχεια απαιτούν περιστασιακή μόνο παρέμβαση από τον άνθρωπο κυρίως σε
περίπτωση δυσλειτουργίας. Ο ρόλος μιας υπολογιστικής μηχανής είναι να
λαμβάνει μια είσοδο δεδομένων και να δίνει μια έξοδο δεδομένων, μέσα από
μια αυστηρά προγραμματισμένη διεργασία, σε αναλογία με τις βιομηχανικές
που μετασχηματίζουν υλικά. Οι κεντρικοί πρωταγωνιστές αυτής της θεώρησης
είναι η IBM καθώς και μια ομάδα ανθρώπων στο MIT μέχρι την δεκαετία του
1960. Η IBM θεωρεί τον υπολογισμό ως μια βιομηχανική υπηρεσία που
τιμολογείται με τον χρόνο εκτέλεσης ενός προγράμματος το οποίο λαμβάνει
μια είσοδο δεδομένων και μετά την εκτέλη μιας δέσμης προγραμμάτων δίνει
μια έξοδο δεδομένων χωρίς την ενδιάμεση παρέμβαση κάποιου χειριστή. Σε
σχέση με αυτό το μοντέλο λειτουργίας, η ιδέα ότι ένας χρήστης ή ακόμη
και ένα σύνολο χρηστών, αλληλεπιδρούν, χωρίς να υπάρχει ένα δεδομένο
πλάνο, σε πραγματικό χρόνο, με ένα τόσο ακριβό μηχάνημα, είναι πολύ
μεγάλη σπατάλη. Πράγματι, ακόμη και οι ίδιοι οι υποστηρικτές του
χρονοδιαμοιρασμού βασίζονται στην παραδοχή ότι κατά μέσο όρο κάθε
χρονική στιγμή ελάχιστοι χρήστες θα κάνουν ενεργή χρήση των
υπολογιστικών πόρων.</p>
<p>Οι υποστηρικτές του χρονοδιαμοιρασμού βασιζόμενοι στον νόμο του Moore
που προβλέπει την μείωση του κόστους και κυρίως στον μετασχηματισμό από
τον υπολογισμό δεδομένων προς την κατεύθυνση της διάδρασης με την
πληροφορία για τις δουλειές του γραφείου θεώρησαν τον υπολογιστή ως
εργαλείο στην διάθεση του κάθε χρήστη. Η εμφάνιση του Sketchpad από τον
Ivan Sutherland και των πρώτων λειτουργικών συστημάτων
χρονοδιαμοιρασμού, όπως το CTSS κατά την δεκαετία του 1960, έδωσε ώθηση
στην θεώρηση των υπολογιστών ως εργαλεία που επεκτείνουν την δυνατότητα
των ανθρώπων να εργάζονται με την πληροφορία. Πράγματι, ένας υπολογιστής
χρονοδιαμοιρασμού, επιτρέπει την διάδραση σε πραγματικό χρόνο με πολλούς
χρήστες, οι οποίοι ενδέχεται να εκτελούν διαφορετικά προγράμματα. Ο
J.C.R. Licklider ήταν ο βασικός ενορχηστρωτής αυτής της προσπάθειας
μετασχηματισμού των υπολογιστών από μηχανές παραγωγής σε διαδραστικά
εργαλεία. Για αυτόν τον σκοπό, χρηματοδότησε μια σειρά από έρευνες με
κεντρικό ρόλο τον χρονοδιαμοιρασμό και την δικτύωση. Αυτά που μετά το
2000 θεωρούνται θεμελιώδη για τις περισσότερες εφαρμογές των
υπολογιστών, εκείνη την εποχή, συνάντησαν δυσκολίες μέχρι και την άρνηση
ομάδων και οργανισμών. Ειδικά η IBM, χρειάστηκε να πιεστεί από τους
πελάτες και τους ανταγωνιστές της όπως η DEC με την δημοφιλή σειρά PDP
για να προσφέρει και αυτή ένα σύστημα χρονοδιαμοιρασμού αφού στο
επιχειρηματικό της μοντέλο δεν υπήρχε η έννοια του χρήστη που
αλληλεπιδρά σε πραγματικό χρόνο. Ακόμη και μετά από είκοσι χρόνια, στις
αρχές της δεκεατίας του 1980, όταν η ΙΒΜ αναγκάζεται, υπό την πίεση των
δημοφιλών μικροϋπολογιστών και των νέων εφαρμογών γραφείου όπως το
VisiCalc, να δημιουργήσει τον προσωπικό της υπολογιστή, θα αναθέσει σε
εξωτερικούς προμηθευτές την ανάπτυξη του λογισμικού, αφού η διάδραση σε
πραγματικό χρόνο είναι κάτι ξένο.</p>
<figure id="fig:vi-editor">
<img src="../images/vi-editor.png"
alt="Ο επεξεργαστής κειμένου VI δημιουργήθηκε για το λειτουργικό σύστημα UNIX για τερματικά χρήστη που βασίζονται στην οθόνη και το πληκτρολόγιο. Θεωρείται ο πρώτος δημοφιλής επεξεργαστής κειμένου που έφυγε από την διάδραση γραμμής και πέρασε στην διάδραση με την οθόνη και επειδή είναι σχετικά απλός, παρά την τροπική λειτουργία του, χρησιμοποιείται ευρέως κυρίως από διαχειριστές συστήματος." />
<figcaption aria-hidden="true">Ο επεξεργαστής κειμένου VI δημιουργήθηκε
για το λειτουργικό σύστημα UNIX για τερματικά χρήστη που βασίζονται στην
οθόνη και το πληκτρολόγιο. Θεωρείται ο πρώτος δημοφιλής επεξεργαστής
κειμένου που έφυγε από την διάδραση γραμμής και πέρασε στην διάδραση με
την οθόνη και επειδή είναι σχετικά απλός, παρά την τροπική λειτουργία
του, χρησιμοποιείται ευρέως κυρίως από διαχειριστές
συστήματος.</figcaption>
</figure>
<figure id="fig:unreal-blueprints">
<img src="../images/unreal-blueprints.png"
alt="Η κατασκευή της διάδρασης σε ένα βιντεοπαιχνίδι απαιτεί πολλές διαφορετικές δεξιότητες, όπως κώδικα, γραφικά, ήχο, κίνηση. Για την διευκόλυνση της δημιουργικής διαδικασίας οι σχεδιαστές βασίζονται σε έτοιμα μοτίβα, τα οποία μπορούν να παραμετροποιήσουν και να διασυνδέσουν σε διαγράμματα ροής." />
<figcaption aria-hidden="true">Η κατασκευή της διάδρασης σε ένα
βιντεοπαιχνίδι απαιτεί πολλές διαφορετικές δεξιότητες, όπως κώδικα,
γραφικά, ήχο, κίνηση. Για την διευκόλυνση της δημιουργικής διαδικασίας
οι σχεδιαστές βασίζονται σε έτοιμα μοτίβα, τα οποία μπορούν να
παραμετροποιήσουν και να διασυνδέσουν σε διαγράμματα ροής.</figcaption>
</figure>
<p>Οι άνθρωποι έμαθαν από τα πρώτα στάδια του επιτραπέζιου υπολογιστή με
γραφική διεπαφή την δεκαετία του 1980 να τον βλέπουν ως εργαλείο και
αυτή η αντίληψη παραμένει ισχυρή και σήμερα κατά τη χρήση του σε
εργασιακά περιβάλλοντα. Ως εξελιγμένο εργαλείο, ο ΗΥ με επεξεργαστή
κειμένου επιτρέπει στον χρήστη να προετοιμάσει ένα κείμενο σε ψηφιακή
μορφή, η οποία είναι πιο ευέλικτη στις αλλαγές, στην αποθήκευση, και στη
μεταφορά σε σχέση με μια φυσική σελίδα που τυπώνεται στην παραδοσιακή
γραφομηχανή ή που γράφεται με ένα μολύβι. Φυσικά υπάρχουν και σύνθετες
περιπτώσεις όπου πολλά εργαλεία συμπληρώνουν το ένα το άλλο για να
επιτελέσουν μια πολύπλοκη δραστηριότητα. Για παράδειγμα, ο
προγραμματισμός υπολογιστών βασίζεται συνήθως στη χρήση ενός απλού
επεξεργαστή κειμένου και μιας σειράς από βοηθητικά προγράμματα
υπολογιστή που υποστηρίζουν την προετοιμασία, τον έλεγχο και την τελική
εκτέλεση του νέου προγράμματος. Ο προγραμματιστής του υπολογιστή
αντιλαμβάνεται και χρησιμοποιεί τα παραπάνω ως εργαλεία για να κάνει τη
δουλειά του, που είναι η κατασκευή ή η επισκευή ενός προγράμματος στον
υπολογιστή. <a href="#fn10" id="fnref10" class="footnote-ref"
role="doc-noteref"><sup>10</sup></a> <a href="#fn11" id="fnref11"
class="footnote-ref" role="doc-noteref"><sup>11</sup></a></p>
<p>Η πρωταρχική -και για πολλά χρόνια κυρίαρχη- αντίληψη του υπολογιστή
ως εργαλείου μπορεί να εντοπιστεί στα πρώτα στάδια της δημιουργίας και
εξέλιξης της γραφικής επιτραπέζιας επιφάνειας εργασίας από την
ερευνητική ομάδα του Xerox PARC. Η ανθρωποκεντρική μελέτη των διεργασιών
του χρήστη βασίστηκε στην παρατήρηση, στις συνεντεύξεις, και στην
ανάλυση της εργασίας που πραγματοποιείται στους εκδοτικούς οργανισμούς,
οι οποίοι ήταν οι βασικοί πελάτες της εταιρείας Xerox κατά τη δεκαετία
του 1970. Οι διεργασίες που εκτελεί αυτή η πολύ καλά ορισμένη ομάδα
χρηστών (π.χ., γλωσσική επιμέλεια, γραφικά, σελιδοποίηση, διαχείριση της
παραγωγής του εντύπου) αποτέλεσαν το σημείο αναφοράς για τον
προγραμματισμό της διάδρασης, ο οποίος οργανώθηκε πάνω στη γραφική
επιφάνεια εργασίας (π.χ., φάκελοι, εργαλεία, καλάθι αχρήστων, κτλ.), ως
βασική μεταφορά της εργασίας που κάνουν οι χρήστες. <a href="#fn12"
id="fnref12" class="footnote-ref" role="doc-noteref"><sup>12</sup></a>
<a href="#fn13" id="fnref13" class="footnote-ref"
role="doc-noteref"><sup>13</sup></a> Αν και η επιφάνεια εργασίας
αποδείχθηκε στην πορεία εξαιρετικά ευέλικτη και προσαρμόσιμη στις
τεχνολογικές εξελίξεις, ταυτόχρονα αυτό το αρχικό πλαίσιο δημιουργίας
της (ως εργαλείο για εκδοτικές εργασίες) παρέμεινε βασικός περιορισμός
που δημιουργεί την ανάγκη για μια διαφορετική αντίληψη του
προγραμματισμού της διάδρασης, τουλάχιστον σε διαφορετικά πλαίσια
ανθρώπινης δραστηριότητας (π.χ., ψυχαγωγία).</p>
<p>Εκτός από τις διεργασίες της προετοιμασίας και της σελιδοποίησης μιας
γραπτής αναφοράς, που γίνονται τόσο από ερασιτέχνες όσο και από
επαγγελματίες χρήστες ΗΥ, μια ακόμη δημοφιλής εφαρμογή της διάδρασης
είναι η διαδικασία της σχεδίασης που εφαρμόζουν οι μηχανικοί. Από τις
αρχές της δεκαετίας του 1980 όλες οι κατηγορίες μηχανικών άρχισαν να
χρησιμοποιούν τον υπολογιστή αντί του σχεδιαστηρίου για να ετοιμάσουν
κτίρια, δρόμους, γέφυρες, αεροσκάφη, μηχανές, αντικείμενα, και ηλεκτρικά
κυκλώματα. Στην πράξη, η σχεδίαση με υπολογιστή είναι πολύ πιο
αποδοτική, ειδικά για τη σχεδίαση αντικειμένων που είναι παρόμοια με
άλλα υπάρχοντα ή μοιράζονται κάποια κοινά μοτίβα. Επιπλέον, το βασικό
πλεονέκτημα είναι ότι η χρήση ΗΥ επιτρέπει τη γρήγορη αναίρεση μιας
αλλαγής και την ασφαλή εξερεύνηση εναλλακτικών κατευθύνσεων. Επίσης, ένα
ακόμη πλεονέκτημα της διαδραστικής σχεδίασης είναι ότι επιτρέπει την
εύκολη αποθήκευση και τον διαμοιρασμό, στοιχεία απαραίτητα στις
περισσότερες συνεργατικές δραστηριότητες σχεδίασης. Από την άλλη πλευρά,
από τη στιγμή που η διαδραστική σχεδίαση λειτουργεί μόνο στο στενό και
καλά ορισμένο πλαίσιο ενός προγράμματος διάδρασης στον υπολογιστή,
δυσκολεύει τη σχεδίαση αντικειμένων που δεν έχουν υπάρξει ακόμη. Ως προς
τον αυτοσχεδιασμό και τη φαντασία, η διαδραστική σχεδίαση είναι ακόμα
ένα περιοριστικό εργαλείο, αν τη συγκρίνει κανείς με το μολύβι και το
χαρτί στα χέρια ενός έμπειρου χρήστη.</p>
<figure id="fig:xerox-gypsy">
<img src="../images/xerox-gypsy.png"
alt="Η εφαρμογή Gypsy ήταν ο πρώτος επεξεργαστής κειμένου με μή-τροπικό χειρισμό και λειτουργούσε στον υπολογιστή Xerox Alto. Για τον σκοπό αυτο, το πληκτρολόγιο ήταν μόνο για την είσοδο χαρακτήρων, ενώ το ποντίκι και τα πλήκτρα του έκαναν την επιλογές των εντολών, όπως αντιγραφή και επικόληση." />
<figcaption aria-hidden="true">Η εφαρμογή Gypsy ήταν ο πρώτος
επεξεργαστής κειμένου με μή-τροπικό χειρισμό και λειτουργούσε στον
υπολογιστή Xerox Alto. Για τον σκοπό αυτο, το πληκτρολόγιο ήταν μόνο για
την είσοδο χαρακτήρων, ενώ το ποντίκι και τα πλήκτρα του έκαναν την
επιλογές των εντολών, όπως αντιγραφή και επικόληση.</figcaption>
</figure>
<figure id="fig:desktop">
<img src="../images/desktop.jpg"
alt="Ο επιτραπέζιος υπολογιστής καθορίζει έμμεσα με τη μορφή του ένα συγκεκριμένο πλαίσιο χρήσης και αντίστοιχα τις εφαρμογές και τις διαδικασίες του χρήστη, που συνήθως σχετίζονται με το περιβάλλον του γραφείου και την αξία της παραγωγικότητας." />
<figcaption aria-hidden="true">Ο επιτραπέζιος υπολογιστής καθορίζει
έμμεσα με τη μορφή του ένα συγκεκριμένο πλαίσιο χρήσης και αντίστοιχα
τις εφαρμογές και τις διαδικασίες του χρήστη, που συνήθως σχετίζονται με
το περιβάλλον του γραφείου και την αξία της
παραγωγικότητας.</figcaption>
</figure>
<p>Η εμπορική σημασία του υπολογιστή ως εργαλείο φαίνεται στην περίπτωση
του ηλεκτρονικού εμπορίου, που σε πολύ σύντομο χρονικό διάστημα άλλαξε
τον τρόπο πώλησης και διανομής πολλών κατηγοριών τυποποιημένων προϊόντων
και κυρίως υπηρεσιών. Η πανάρχαια συνήθεια της μετάβασης στην αγορά για
την προμήθεια προϊόντων και υπηρεσιών μετασχηματίζεται σε μια
διαδραστική εμπειρία στον υπολογιστή. Ο υπολογιστής ως εργαλείο επιλογής
προϊόντων και ως εργαλείο πληρωμής μειώνει τη σημασία του τυπωμένου
χρήματος, καθώς η συναλλαγή πραγματοποιείται λογιστικά ανάμεσα στους
λογαριασμούς του προμηθευτή και του πελάτη. Οι επιπτώσεις αυτές είναι
πολύ σημαντικές ειδικά στην περίπτωση που τα ίδια τα αγαθά είναι
ψηφιακά, όπως είναι η μουσική και οι ταινίες.</p>
<p>Η προτίμηση που δείχνουν οι χρήστες διαδραστικών συστημάτων στην
ηλεκτρονική μορφή αγοράς και χρηματικής συναλλαγής δημιουργεί μια σειρά
από πρωτοφανείς επιπτώσεις. Ειδικά στην περίπτωση της παροχής υπηρεσιών
χωρίς τη μεταβίβαση κάποιου απτού προϊόντος (π.χ., αγορά αεροπορικών
εισιτηρίων, κράτηση σε ξενοδοχείο, ψηφιακό ψυχαγωγικό περιεχόμενο, όπως
μουσική, ταινίες, παιχνίδια), το ηλεκτρονικό εμπόριο αποδείχτηκε πιο
αποτελεσματικό από το φυσικό, τόσο για τους χρήστες όσο και για τους
παρόχους της υπηρεσίας. Στις περιπτώσεις όπου η μετάβαση στο ηλεκτρονικό
εμπόριο υπήρξε καθολική, το αποτέλεσμα ήταν η καταστροφή πολλών
επιμέρους ενδιάμεσων (π.χ., δισκοπωλεία, τουριστικοί πράκτορες, κ.ά.).
Επομένως, βλέπουμε ότι η χρήση του υπολογιστή ως εργαλείου μπορεί να
είναι μια απλή βελτιστοποίηση μιας διεργασίας που ήδη κάνουμε (π.χ.,
συγγραφή κειμένου), αλλά μπορεί και να έχει σημαντικές επιπτώσεις σε
επαγγέλματα και ανθρώπινες δραστηριότητες που παύουν να υπάρχουν,
επειδή, δε χρειάζονται πλέον, αφού γίνονται πολύ πιο αποτελεσματικά με
τον προγραμματισμό της διάδρασης ανθρώπου και υπολογιστή (π.χ., αγορά
αεροπορικού εισιτηρίου).</p>
<p>Η αντίληψη του υπολογιστή ως εργαλείο παραμένει κυρίαρχη και στην
εποχή της μετάβασης από τον επιτραπέζιο στον κινητό και διάχυτο
υπολογισμό. Για παράδειγμα, ένα έξυπνο κινητό τηλέφωνο συνοδεύεται
συνήθως από μια ψηφιακή φωτογραφική μηχανή, δηλαδή από ένα εργαλείο
αποτύπωσης εικόνων. Οι ψηφιακές φωτογραφικές μηχανές των έξυπνων κινητών
τηλεφώνων επικράτησαν επειδή εκτός από την οικειότητα που έχουμε
αναπτύξει στη χρήση των βασικών λειτουργιών των έξυπνων κινητών και την
ευχέρεια του να τα έχουμε πάντα μαζί μας, παρέχουν μια σειρά από
επιπλέον λειτουργίες χάρη στις δυνατότητες του έξυπνου κινητού τηλεφώνου
(π.χ., αισθητήρας θέσης, κίνησης, φίλτρα, δικτύωση, κτλ.). Αυτές οι
δυνατότητες κάνουν την ενσωματωμένη φωτογραφική μηχανή ακόμη πιο χρήσιμη
και εύχρηστη (π.χ., για τη δημιουργία πανοραμικής φωτογραφίας). Όπως με
τα κινητά τηλέφωνα που έχουν και φωτογραφική μηχανή, έτσι και οι φορετοί
υπολογιστές και τα έξυπνα ρολόγια που περιέχουν αισθητήρες κίνησης και
βιομετρικών στοιχείων, μετατρέπουν ένα εργαλείο που έδινε ρυθμό με βάση
τον κοινώς αποδεκτό χρόνο της Γης, σε εργαλείο που μετράει περισσότερες
παραμέτρους (π.χ., ώρες ύπνου, βήματα, κτλ.) και μπορεί να δώσει ρυθμό
με βάση το βιολογικό σύστημα του κάθε ανθρώπου χωριστά. Συμπερασματικά,
η αντίληψη του υπολογιστή ως εργαλείου παραμένει δημοφιλής (ίσως
περισσότερο από ποτέ), καθώς η χρήση του διαχέεται σε όλο και πιο πολλές
ανθρώπινες δραστηριότητες. Ταυτόχρονα, ο υπολογιστής αποκτά νέους
ρόλους. Πέρα από εργαλείο, γίνεται και μέσο επικοινωνίας, και αυτός ο
νέος ρόλος του ίσως να είναι και ο πιο σημαντικός από την πλευρά του
ατόμου ως μέρους μια κοινότητας ανθρώπων.</p>
<section id="footnotes" class="footnotes footnotes-end-of-section"
role="doc-endnotes">
<hr />
<ol start="7">
<li><div id="fn7">
<p><span class="citation"
data-cites="mccullough1998abstracting">McCullough (1998)</span><a
href="#fnref7" class="footnote-back" role="doc-backlink">↩︎</a></p>
</div></li>
<li><div id="fn8">
<p>fig:superpaint-toolbox<a href="#fnref8" class="footnote-back"
role="doc-backlink">↩︎</a></p>
</div></li>
<li><div id="fn9">
<p>fig:macpaint<a href="#fnref9" class="footnote-back"
role="doc-backlink">↩︎</a></p>
</div></li>
<li><div id="fn10">
<p>fig:vi-editor<a href="#fnref10" class="footnote-back"
role="doc-backlink">↩︎</a></p>
</div></li>
<li><div id="fn11">
<p>fig:unreal-blueprints<a href="#fnref11" class="footnote-back"
role="doc-backlink">↩︎</a></p>
</div></li>
<li><div id="fn12">
<p>fig:xerox-gypsy<a href="#fnref12" class="footnote-back"
role="doc-backlink">↩︎</a></p>
</div></li>
<li><div id="fn13">
<p>fig:desktop<a href="#fnref13" class="footnote-back"
role="doc-backlink">↩︎</a></p>
</div></li>
</ol>
</section>
<h2 id="μέσο-επικοινωνίας">Μέσο επικοινωνίας</h2>
<figure id="fig:bbs">
<img src="../images/bbs.png"
alt="Τα δημοφιλή συστήματα συνεργασίας των χρηστών μέσω υπολογιστή είναι τόσο παλιά όσο και οι πρώτοι οικιακοί ΗΥ με δυνατότητα δικτύωσης μέσω τηλεφώνου όπου η συνεργασία γινόταν με τα BBS." />
<figcaption aria-hidden="true">Τα δημοφιλή συστήματα συνεργασίας των
χρηστών μέσω υπολογιστή είναι τόσο παλιά όσο και οι πρώτοι οικιακοί ΗΥ
με δυνατότητα δικτύωσης μέσω τηλεφώνου όπου η συνεργασία γινόταν με τα
BBS.</figcaption>
</figure>
<figure id="fig:xerox-portholes">
<img src="../images/xerox-portholes.png"
alt="Σε έναν οργανισμό που λειτουργεί κατανεμημένα σε διαφορετικές γεωγραφικές περιοχές υπάρχει η ανάγκη για μια ήπια επαφή μεταξύ των συνεργατών, αντίστοιχη με αυτή που υπάρχει σε έναν μεγάλο ενιαίο χώρο εργασίας. Η ανάγκη αυτή μελετήθηκε με το σύστημα επίγνωσης πλαισίου απομακρυσμένου συνεργάτη Portholes του Xerox PARC που μοιράζει ασύγχρονα στιγμιότυπα από κάμερες που βρίσκονται στα γραφεία, έτσι ώστε να υπάρχει κατανόηση της δραστηριότητας σε διαφορετικές τοποθεσίες." />
<figcaption aria-hidden="true">Σε έναν οργανισμό που λειτουργεί
κατανεμημένα σε διαφορετικές γεωγραφικές περιοχές υπάρχει η ανάγκη για
μια ήπια επαφή μεταξύ των συνεργατών, αντίστοιχη με αυτή που υπάρχει σε
έναν μεγάλο ενιαίο χώρο εργασίας. Η ανάγκη αυτή μελετήθηκε με το σύστημα
επίγνωσης πλαισίου απομακρυσμένου συνεργάτη Portholes του Xerox PARC που
μοιράζει ασύγχρονα στιγμιότυπα από κάμερες που βρίσκονται στα γραφεία,
έτσι ώστε να υπάρχει κατανόηση της δραστηριότητας σε διαφορετικές
τοποθεσίες.</figcaption>
</figure>
<p>Οι εφαρμογές επικοινωνίας και συνεργασίας μέσω υπολογιστή είναι μια
μεγάλη περιοχή την οποία ερευνά το πεδίο των κοινωνικών και συνεργατικών
συστημάτων. Ειδικά οι εφαρμογές επικοινωνίας μέσω υπολογιστή απέκτησαν
μεγάλη σημασία τόσο στην εργασία (π.χ., email) όσο και στην καθημερινή
ζωή και τη διασκέδαση (π.χ., forum συζητήσεων, online multiplayer
games). Αυτό το βήμα συνοδεύτηκε από την ανάγκη για μια νέα θεώρηση της
φιλοσοφίας της διάδρασης ως μέσου επικοινωνίας.<a href="#fn14"
id="fnref14" class="footnote-ref" role="doc-noteref"><sup>14</sup></a>
Επιπλέον, η θεώρηση της διάδρασης ως μέσου επικοινωνίας δίνει έμφαση στη
συμμετοχή των χρηστών στην παραγωγή περιεχομένου και υπηρεσιών, τα οποία
κατά τη δεκαετία του 2000 έγιναν ο κυρίαρχος τρόπος διάδρασης με τους
υπολογιστές, ειδικά στο διαδίκτυο. Η σημασία των υπολογιστών ως μέσου
επικοινωνίας γίνεται ακόμη πιο εμφανής κατά τη δεκαετία του 2010, όταν
το κοινωνικό δίκτυο Facebook καθώς και τα έξυπνα κινητά τηλέφωνα
γίνονται το πρώτο -και πολλές φορές το μόνο- σημείο επαφής των
περισσότερων χρηστών με τους υπολογιστές. <a href="#fn15" id="fnref15"
class="footnote-ref" role="doc-noteref"><sup>15</sup></a> <a
href="#fn16" id="fnref16" class="footnote-ref"
role="doc-noteref"><sup>16</sup></a></p>
<p>Η ανθρωπιστική θεώρηση της διάδρασης δεν έχει καθιερωθεί, αλλά έχει
υποδεχθεί στην ομάδα της πολλές συμπληρωματικές συνεισφορές, που την
έχουν επεκτείνει προς την κοινωνική διάδραση. Μια από τις σημαντικές
θεωρήσεις της διάδρασης εμπνέεται από το θέατρο, όπου οι άνθρωποι
παίζουν ρόλους και συνεργάζονται. Με αυτόν τον τρόπο, ένα σύστημα
διάδρασης μπορεί να θεωρηθεί ως μια συνεργατική αναπαράσταση. <a
href="#fn17" id="fnref17" class="footnote-ref"
role="doc-noteref"><sup>17</sup></a> Και σε αυτήν τη περίπτωση, όπως
στην απλή διάδραση, η έμφαση βρίσκεται περισσότερο στην επαύξηση της
συλλογικής νοημοσύνης παρά στην προσομοίωση της φυσικής συνεργασίας.
Στην πράξη όμως, φαίνεται πως έχει επικρατήσει η αντίληψη πως οι
άνθρωποι πρέπει να επικοινωνούν και να συνεργάζονται μέσω των
υπολογιστών, όπως το κάνουν και στην πραγματικότητα. Το αποτέλεσμα είναι
πως οι αντίστοιχες εφαρμογές συνεργασίας εστιάζουν μόνο στην μεταφορά
του προσώπου και της φωνής, όπως ακριβώς η επεξεργασία ενός εγγράφου
εστιάζει μόνο στο πως θα φαίνεται όταν θα τυπωθεί στο φυσικό χαρτί. Μια
περισσότερο ανθρωπιστική σχεδίαση της επικοινωνίας θα μπορούσε να
προσθέτει νέες δυνατότητες αντίληψης, αντί για την ψηφιακή προσομοίωση
των φυσικών καναλιών επικοινωνίας.</p>
<figure id="fig:videoplace">
<img src="../images/videoplace.png"
alt="Το ερευνητικό σύστημα Videoplace του Myron Krueger τοποθετεί τη σιλουέτα του χρήστη μέσα σε ένα συμμετοχικό διαδραστικό περιβάλλον, όπου δεν υπάρχει διάκριση ανάμεσα σε χρήστες και γραφικά, με τη χρήση κάμερας σε πραγματικό χρόνο και χωρίς να μεσολαβεί κάποια συσκευή έμμεσης διάδρασης. Σε αντιδιαστολή με τα πρώτα συστήματα εικονικής πραγματικότητας εκείνης της περιόδου, αυτό το σύστημα χαρακτηρίζεται από τον δημιουργό του ως τεχνητή πραγματικότητα, η οποία αρχικά υλοποιήθηκε με αναλογικά φίλτρα και κινηματογραφικές τεχνικές πριν περάσει σε τεχνολογίες υπολογιστικής όρασης." />
<figcaption aria-hidden="true">Το ερευνητικό σύστημα Videoplace του
Myron Krueger τοποθετεί τη σιλουέτα του χρήστη μέσα σε ένα συμμετοχικό
διαδραστικό περιβάλλον, όπου δεν υπάρχει διάκριση ανάμεσα σε χρήστες και
γραφικά, με τη χρήση κάμερας σε πραγματικό χρόνο και χωρίς να μεσολαβεί
κάποια συσκευή έμμεσης διάδρασης. Σε αντιδιαστολή με τα πρώτα συστήματα
εικονικής πραγματικότητας εκείνης της περιόδου, αυτό το σύστημα
χαρακτηρίζεται από τον δημιουργό του ως τεχνητή πραγματικότητα, η οποία
αρχικά υλοποιήθηκε με αναλογικά φίλτρα και κινηματογραφικές τεχνικές
πριν περάσει σε τεχνολογίες υπολογιστικής όρασης.</figcaption>
</figure>
<figure id="fig:media-space">
<img src="../images/media-space.jpg"
alt="Το ερευνητικό πρόγραμμα Media Space ήταν μια από τις πρώτες προσπάθειες ανθρώπινης συνεργασίας από απόσταση μέσω υπολογιστή, το οποίο χρησιμοποιούσε ζωντανή εικόνα βίντεο." />
<figcaption aria-hidden="true">Το ερευνητικό πρόγραμμα Media Space ήταν
μια από τις πρώτες προσπάθειες ανθρώπινης συνεργασίας από απόσταση μέσω
υπολογιστή, το οποίο χρησιμοποιούσε ζωντανή εικόνα βίντεο.</figcaption>
</figure>
<p>Μια από τις πιο δημοφιλείς εφαρμογές των πρώτων συστημάτων
χρονοδιαμοιρασμού ήταν η ηλεκτρονική αλληλογραφία. Οι περισσότεροι
χρήστες ήταν συνδεμένοι ταυτόχρονα ή με μικρή χρονική διαφορά σε
τηλέτυπους με τους οποίους μπορούσαν να επικοινωνούν ασύγχρονα, αλλά
πυκνά. Αν και αυτοί οι χρήστες ήταν συνήθως σε σχετικά κοντινή
γεωγραφική απόσταση, επέλεγαν να επικοινωνήσουν με αυτόν τον τρόπο,
γιατί είχε το πλεονέκτημα της ασύγχρονης επικοινωνίας, και όχι γιατί
ήταν μια ανάγκη που δεν είχε εναλλακτική. Η ηλεκτρονική αλληλογραφία
έγινε ακόμη πιο δημοφιλής στα τέλη της δεκαετίας του 1960, όταν το
ARPANET άρχισε να συνδέει τους λίγους διαθέσιμους υπολογιστές μεταξύ
τους. Η διάδραση με τον υπολογιστή αποκτάει έναν νέο χαρακτήρα, ο οποίος
εκτός από εργαλείο γίνεται και μέσο επικοινωνίας. <a href="#fn18"
id="fnref18" class="footnote-ref" role="doc-noteref"><sup>18</sup></a> Ο
τεχνολογικός μετασχηματισμός προς την δικτύωση και την διάδραση σε
μεγαλύτερη κλίμακα δεν ήταν προτεραιότητα για όλους. Για παράδειγμα, οι
ομάδα της τεχνητής νοημοσύνης στο ΜΙΤ δεν έβλεπε την σημασία της
ευρύτερης δικτύωσης, αφού ο σκοπός της δεν ήταν να μιλάνε οι άνθρωποι
μεταξύ τους αλλά με έξυπνες μηχανές. Από την άλλη πλευρά, η ίδια ομάδα
δημιουργήσε την ιδέα του ανοιχτού διαμοιρασμού, κυρίως ως αντίδραση στο
σχετικά πολύπλοκο λόγω ασφάλειας MULTICS. Στα τέλη της δεκαετίας του
1960, δημιούργησαν ένα απλό σύστημα χρονοδιαμοιρασμού το ITS το οποίο
αρχικά δεν έκανε έλεγχο πρόσβασης χρήστη και αποτέλεσε την φιλοσοφική
πλατφόρμα για τις μελλοντικές κοινότητες ανοιχτού λογισμικού.<a
href="#fn19" id="fnref19" class="footnote-ref"
role="doc-noteref"><sup>19</sup></a></p>
<p>Οι καλλιτέχνες ήταν από τους πρώτους που χρησιμοποίησαν τον
υπολογιστή ως εργαλείο για να δημιουργήσουν. Όμως η πιο σημαντική
συνεισφορά τους στην εξέλιξη της χρήσης του υπολογιστή ήταν ότι τον
χρησιμοποίησαν ως μέσο για το έργο τους. Για παράδειγμα, η Brenda Laurel
με υπόβαθρο στις θεατρικές σπουδές αναγνωρίζει τη δυνατότητα των
υπολογιστών να λειτουργούν ως σκηνή όπου οι χρήστες μπορούν να παίζουν
ρόλους και να αυτοσχεδιάζουν. Αυτή η αντίληψη έρχεται να συμπληρώσει την
αντίληψη του υπολογιστή ως εργαλείου που σχεδιάζεται με στόχο να
ικανοποιήσει καλά ορισμένες ανθρώπινες ανάγκες και δραστηριότητες.
Επίσης, ο Myron Krueger κατασκεύασε για πρώτη φορά, στα μέσα της
δεκαετίας του 1970, τη διάδραση ανθρώπου και υπολογιστή με έμφαση στην
παρουσία του ανθρώπινου σώματος. Με αυτόν τον τρόπο η κατανόηση της
διάδρασης με τον υπολογιστή απελευθερώνεται από τη μέχρι τότε αντίληψή
της ως εργαλείου και αρχίζει να γίνεται αντιληπτή και ως μέσο
επικοινωνίας που συνδέει τους ανθρώπους είτε άμεσα μεταξύ τους, είτε
έμμεσα από την πληροφορία που μπορούμε συλλογικά να αναπαραστήσουμε στον
υπολογιστή. Για παράδειγμα, το σύστημα Videoplace <a href="#fn20"
id="fnref20" class="footnote-ref" role="doc-noteref"><sup>20</sup></a>
χρησιμοποιεί κάμερες και προβολείς, έτσι ώστε να μεταφέρει ολόκληρο το
ανθρώπινο σώμα μέσα σε ένα περιβάλλον τεχνητής πραγματικότητας. <a
href="#fn21" id="fnref21" class="footnote-ref"
role="doc-noteref"><sup>21</sup></a></p>
<figure id="fig:skype-video-call">
<img src="../images/skype-video-call.png"
alt="Τα συστήματα επικοινωνίας και τηλεδιάσκεψης μέσω υπολογιστή (π.χ., Skype) συνιστούν μια διαφορετική θεώρηση του υπολογιστή σε σχέση με την κλασική θεώρηση του εργαλείου. Οι χρήστες επικοινωνούν μέσω κειμένου, ήχου, βίντεο και οι εφαρμογές αφορούν την εργασία, την καθημερινότητα, τη διασκέδαση και την εκπαίδευση." />
<figcaption aria-hidden="true">Τα συστήματα επικοινωνίας και
τηλεδιάσκεψης μέσω υπολογιστή (π.χ., Skype) συνιστούν μια διαφορετική
θεώρηση του υπολογιστή σε σχέση με την κλασική θεώρηση του εργαλείου. Οι
χρήστες επικοινωνούν μέσω κειμένου, ήχου, βίντεο και οι εφαρμογές
αφορούν την εργασία, την καθημερινότητα, τη διασκέδαση και την
εκπαίδευση.</figcaption>
</figure>
<figure id="fig:second-life">
<img src="../images/second-life.jpg"
alt="Οι φωτορεαλιστικοί εικονικοί κόσμοι έγιναν δημοφιλείς αρχικά σε εφαρμογές ψυχαγωγίας και πολιτισμού, και στην συνέχεια επεκτάθηκαν σε γενικές εφαρμογές επικοινωνίας όπως το Second Life." />
<figcaption aria-hidden="true">Οι φωτορεαλιστικοί εικονικοί κόσμοι
έγιναν δημοφιλείς αρχικά σε εφαρμογές ψυχαγωγίας και πολιτισμού, και
στην συνέχεια επεκτάθηκαν σε γενικές εφαρμογές επικοινωνίας όπως το
Second Life.</figcaption>
</figure>
<p>Η αρχική αντίληψη που έχουν οι περισσότεροι άνθρωποι για τη διάδραση
-και η οποία στη συνέχεια καθορίζει έμμεσα μια σειρά από άλλες
αντιλήψεις και σχεδιαστικές επιλογές- είναι αυτή της ‘ένας-προς-έναν’
επικοινωνίας ανάμεσα σε άνθρωπο και υπολογιστή. Αν και η
‘ένας-προς-έναν’ διάδραση ανθρώπου και υπολογιστή αποτελεί βασικό
συστατικό κάθε σύνθετης μορφής διάδρασης, δε βρίσκεται πάντα στο
επίκεντρο του ενδιαφέροντος. Στον επιτραπέζιο υπολογιστή, όπου έχουμε
ένα πληκτρολόγιο και ένα ποντίκι, η διάδραση ανάμεσα στον άνθρωπο και
τον υπολογιστή είναι ‘ένας-προς-έναν’. Σε αυτό το πλαίσιο έχει
δημιουργηθεί και έχει ωριμάσει η περιοχή της διάδρασης ανθρώπου και
υπολογιστή. Καθώς, όμως, οι υπολογιστές άρχισαν να δικτυώνονται, είτε
στον ίδιο χώρο είτε σε μεγάλες γεωγραφικές αποστάσεις και διαφορετικές
χρονικές ζώνες, δημιουργήθηκε η ανάγκη να μελετήσουμε και να
προγραμματίσουμε τη διάδραση που συμβαίνει ανάμεσα σε ανθρώπους που
συνεργάζονται από απόσταση και σε διάφορους τομείς, όπως στην εργασία,
τη διασκέδαση, την εκπαίδευση και την καθημερινή ζωή. <a href="#fn22"
id="fnref22" class="footnote-ref" role="doc-noteref"><sup>22</sup></a>
<a href="#fn23" id="fnref23" class="footnote-ref"
role="doc-noteref"><sup>23</sup></a></p>
<p>Τα Συνεργατικά Συστήματα (Collaborative Systems) έγιναν γνωστά ως
επιστημονική περιοχή στα τέλη της δεκαετίας του 1980, αλλά η συνεργασία
και η επικοινωνία μέσω υπολογιστή είχε ήδη ξεκινήσει. Στα τέλη της
δεκαετίας του 1970, η μεγάλη διάδοση των πρώτων οικονομικών προσωπικών
υπολογιστών και των μόντεμ που επέτρεπαν την ψηφιακή μετάδοση δεδομένων
μέσα από τις αναλογικές τηλεφωνικές γραμμές, δημιούργησε τα πρώτα
Bulletin Board Systems (BBS). Τα BBS ήταν ένα είδος φόρουμ (forum), όπου
οι χρήστες μπορούσαν να έχουν μια σύγχρονη ή ασύγχρονη συζήτηση, να
αναρτήσουν ανακοινώσεις, και να μοιραστούν αρχεία. Την ίδια περίοδο,
αντίστοιχα συστήματα συνεργατικού λογισμικού, βασισμένα σε
μικρο-υπολογιστές (micro-computers) και κεντρικούς υπολογιστές
(mainframe computers), αναπτύχθηκαν για εταιρείες με σκοπό τη
διευκόλυνση της επαγγελματικής συνεργασίας.</p>
<p>Η ερευνητική περιοχή της Συνεργασίας Ανθρώπων μέσω Υπολογιστών
θεωρείται η πρώτη (και ίσως η πιο σημαντική) συγγενής περιοχή της
Διάδρασης ανθρώπου και υπολογιστή. Επομένως, ένα μεγάλο μέρος της
θεωρίας, των μεθόδων και των τεχνικών που χρησιμοποιούν είναι κοινές ή
έστω παρόμοιες. Υπάρχει, όμως, τουλάχιστον μία σημαντική διαφορά που
επιβάλλει την αντιμετώπιση των Κοινωνικών και Συνεργατικών Συστημάτων ως
ξεχωριστή περιοχή. Ενώ στη διάδραση ανθρώπου και υπολογιστή εστιάζουμε
συνήθως την προσοχή μας (κατά τον προγραμματισμό και την αξιολόγηση του
συστήματος) στη διάδραση ανάμεσα σε έναν άνθρωπο και έναν υπολογιστή,
στα Κοινωνικά και Συνεργατικά Συστήματα η βασική μονάδα ανάλυσης είναι η
διάδραση ανάμεσα σε μια ομάδα (τουλάχιστον δύο) ανθρώπων, που συμβαίνει
μέσω ενός τουλάχιστον υπολογιστή. Το πιο απλό και δημοφιλές παράδειγμα
από την περιοχή των Συνεργατικών Συστημάτων είναι το Facebook, ένα
σύστημα που επιτρέπει την επικοινωνία και τη συνεργασία ομάδων
ανθρώπων.</p>
<p>Η σημασία των Κοινωνικών και Συνεργατικών συστημάτων πέρασε από τις
εταιρείες στην ευρύτερη κοινωνία, και από την εργασία στην
καθημερινότητα, με την ανάπτυξη των κοινωνικών δικτύων μετά τα μισά της
δεκαετίας του 2000. Εκείνη την περίοδο δημιουργήθηκαν πολλά κοινωνικά
δίκτυα, όπου ο κάθε χρήστης περιέγραφε την προσωπικότητα και τις
προτιμήσεις του και έκανε εικονικούς δεσμούς φιλίας με άλλους χρήστες.
Ανάμεσα στα πολλά κοινωνικά δίκτυα, το Facebook ήταν εκείνο που γνώρισε
τη μεγαλύτερη αποδοχή, με περισσότερο από ένα δισεκατομμύριο
εγγεγραμμένους χρήστες στις αρχές της δεκαετίας του 2010. Οι βασικές
δραστηριότητες των χρηστών του Facebook είναι η ενημέρωση της τρέχουσας
κατάστασής τους, η δημόσια ή ιδιωτική συζήτηση, και η ανάρτηση
φωτογραφιών. Καθώς ο κύριος όγκος της δραστηριότητας στο διαδίκτυο
μετατοπίστηκε από την υπηρεσία του ιστού και την ανάρτηση ιστοσελίδων
στα δίκτυα κοινωνικής δικτύωσης, αντίστοιχα παρατηρούμε και μια μεταβολή
στο είδος της διάδρασης των νέων εφαρμογών, οι οποίες επιβάλλεται να
έχουν πλέον και μια κοινωνική διάσταση.</p>
<section id="footnotes" class="footnotes footnotes-end-of-section"
role="doc-endnotes">
<hr />
<ol start="14">
<li><div id="fn14">
<p><span class="citation" data-cites="rheingold2000virtual">Rheingold
(2000)</span><a href="#fnref14" class="footnote-back"
role="doc-backlink">↩︎</a></p>
</div></li>
<li><div id="fn15">
<p>fig:bbs<a href="#fnref15" class="footnote-back"
role="doc-backlink">↩︎</a></p>
</div></li>
<li><div id="fn16">
<p>fig:xerox-portholes<a href="#fnref16" class="footnote-back"
role="doc-backlink">↩︎</a></p>
</div></li>
<li><div id="fn17">
<p><span class="citation" data-cites="laurel2013computers">Laurel
(2013)</span><a href="#fnref17" class="footnote-back"
role="doc-backlink">↩︎</a></p>
</div></li>
<li><div id="fn18">
<p>fig:media-space<a href="#fnref18" class="footnote-back"
role="doc-backlink">↩︎</a></p>
</div></li>
<li><div id="fn19">
<p><span class="citation" data-cites="markoff2005dormouse">Markoff
(2005)</span><a href="#fnref19" class="footnote-back"
role="doc-backlink">↩︎</a></p>
</div></li>
<li><div id="fn20">
<p>fig:videoplace<a href="#fnref20" class="footnote-back"
role="doc-backlink">↩︎</a></p>
</div></li>
<li><div id="fn21">
<p><span class="citation" data-cites="krueger1991artificial">Krueger
(1991)</span><a href="#fnref21" class="footnote-back"
role="doc-backlink">↩︎</a></p>
</div></li>
<li><div id="fn22">
<p>fig:skype-video-call<a href="#fnref22" class="footnote-back"
role="doc-backlink">↩︎</a></p>
</div></li>
<li><div id="fn23">
<p>fig:second-life<a href="#fnref23" class="footnote-back"
role="doc-backlink">↩︎</a></p>
</div></li>
</ol>
</section>
<h2 id="η-περίπτωση-του-facebook">Η περίπτωση του Facebook</h2>
<figure id="fig:facebook1">
<img src="../images/facebook1.jpg"
alt="Μία από τις αρχικές εκδοχές είχε διαφορετικό όνομα (thefacebook) και δεν διέφερε πολύ από ένα απλό σύστημα βάσης δεδομένων με προφίλ χρηστών." />
<figcaption aria-hidden="true">Μία από τις αρχικές εκδοχές είχε
διαφορετικό όνομα (thefacebook) και δεν διέφερε πολύ από ένα απλό
σύστημα βάσης δεδομένων με προφίλ χρηστών.</figcaption>
</figure>
<figure id="fig:lifestreams">
<img src="../images/lifestreams.jpg"
alt="Η οργάνωση και η αλληλεπίδραση με την πληροφορία σε χρονολογική σειρά παρουσιάστηκε σε μια διεπαφή με τίτλο Lifestreams περισσότερο από μια δεκαετία πριν γίνει ο βασικός τρόπος διάδρασης στα ψηφιακά κοινωνικά μέσα όπως τα Twitter, Facebook." />
<figcaption aria-hidden="true">Η οργάνωση και η αλληλεπίδραση με την
πληροφορία σε χρονολογική σειρά παρουσιάστηκε σε μια διεπαφή με τίτλο
Lifestreams περισσότερο από μια δεκαετία πριν γίνει ο βασικός τρόπος
διάδρασης στα ψηφιακά κοινωνικά μέσα όπως τα Twitter,
Facebook.</figcaption>
</figure>
<p>Η ιστορία του κοινωνικού δικτύου Facebook έχει πολλές ενδιαφέρουσες
πλευρές, κάποιες από αυτές αξίζει να ανακτήσει κανείς συνοπτικά και
ευχάριστα στη σχετική ταινία “The Social Network” (Fincher, 2010). Σε
αυτήν την ενότητα θα εστιάσουμε στα στοιχεία του κοινωνικού δικτύου που
άπτονται του προγραμματισμού της διάδρασης. Δεν υπάρχει καλύτερο σημείο
για να ξεκινήσουμε αυτήν την περιγραφή από τη διαδικασία και τα στάδια
ανάπτυξης του κοινωνικού δικτύου Facebook. Τόσο οι λειτουργίες όσο και η
εμφάνιση του συστήματος δεν προέκυψαν από ένα λεπτομερές συμβόλαιο ή ένα
ξεκάθαρο όραμα, αλλά ήταν κυρίως το αποτέλεσμα συνεχούς επανάληψης και
δοκιμών. Μάλιστα, δεν ήταν λίγες οι φορές στην ιστορία του Facebook που
πολλοί χρήστες ενοχλήθηκαν ή αντέδρασαν, ακόμα και κλείνοντας τον
λογαριασμό τους, όταν έγιναν αλλαγές που δεν τους άρεσαν. Ανεξάρτητα από
τη μελλοντική αποδοχή του φαινομένου του Facebook, σίγουρα η επίδρασή
του στον τρόπο που αναπτύσσονται και λειτουργούν οι διαδραστικές
εφαρμογές θα είναι διαχρονική, καθώς μια σειρά από εφαρμογές σε
διαφορετικά πεδία (π.χ., Tweeter, LinkedIn, ResearchGate, GitHub, Uber,
AirBnB, κτλ.) στηρίζονται στις βασικές λειτουργίες του κοινωνικού
δικτύου.</p>
<p>Στα πρώιμα στάδια του Facebook, η “ομάδα ανάπτυξης” ήταν δύο
συγκάτοικοι στη φοιτητική εστία του πανεπιστήμιου που ξεκίνησαν να
φτιάξουν μια σελίδα με τις φωτογραφίες των φοιτητών από όλες τις
επιμέρους εστίες του πανεπιστήμιου. Οι φωτογραφίες και τα βασικά προφίλ
ήταν διαθέσιμα στις επιμέρους εστίες, αλλά το πανεπιστήμιο δεν πρόσφερε
ένα ολοκληρωμένο σύστημα παρουσίασής τους. Η ομάδα ανάπτυξης ανέκτησε
τις φωτογραφίες από τις επιμέρους εστίες και τις πρόβαλε συγκριτικά, με
έναν πολύ δημοφιλή τρόπο, που όμως θεωρήθηκε παράνομος από τις
πανεπιστημιακές αρχές. Αν και η αρχική προσπάθεια έπαψε να λειτουργεί
μέσα σε λίγες μέρες, υπήρξε τόσο δημοφιλής που η επόμενη έκδοση -που
βασίστηκε στην εθελοντική συμμετοχή- ετοιμάστηκε και συγκέντρωσε χρήστες
από όλο το πανεπιστήμιο πολύ γρήγορα.<a href="#fn24" id="fnref24"
class="footnote-ref" role="doc-noteref"><sup>24</sup></a> Η έκδοση
εκείνη δεν πρόσφερε τίποτα διαφορετικό, μάλλον είχε λιγότερα στοιχεία,
από τα αντίστοιχα κοινωνικά δίκτυα της εποχής (π.χ., το Friendster).
Είχε, όμως, ένα βασικό πλεονέκτημα που θα έπαιζε σπουδαίο ρόλο στη
συνέχεια: η υπηρεσία του Facebook είχε μεγάλη συμμετοχή από μια συμπαγή
και ομοιόμορφη ομάδα χρηστών, της οποίας η ομάδα ανάπτυξης
παρακολουθούσε κάθε διάδραση, και έτσι μπόρεσε να προσφέρει νέες
λειτουργίες που να καλύπτουν τις ανάγκες των χρηστών της. Η πιο
σημαντική λειτουργία είναι η διεπαφή χρονολογικής εμφάνισης των
αναρτήσεων<a href="#fn25" id="fnref25" class="footnote-ref"
role="doc-noteref"><sup>25</sup></a> που είναι και η μεγαλύτερη μέχρι
τότε απομάκρυνση από το ιεραρχικό σύστημα αρχείων.</p>
<p>Βλέπουμε, λοιπόν, ότι η εμπορική επιτυχία του κοινωνικού δικτύου
μπορεί να εξηγηθεί περισσότερο από την ανθρωποκεντρική του διάσταση
-κυρίως λόγω της συμμετοχής των τελικών χρηστών στην παραγωγή του
περιεχομένου- παρά από την προσφορά νέων καινοτόμων λειτουργιών που δεν
έχουν οι ανταγωνιστές. Το κοινωνικό δίκτυο Facebook πολύ γρήγορα πέρασε
από το πανεπιστημιακό ίδρυμα των δημιουργών του σε όλα τα πανεπιστημιακά
ιδρύματα των ΗΠΑ, και από εκεί έγινε διαθέσιμο στον υπόλοιπο κόσμο με
την προσθήκη λειτουργιών και αλλαγές αντίστοιχων της κάθε περιόδου
λειτουργίας του. Η σταδιακή αυτή βελτίωση επέτρεψε στους κατασκευαστές
να παράσχουν στους χρήστες τα στοιχεία της διάδρασης που είχαν ανάγκη
κάθε φορά, και όχι κάτι που είχαν από μόνοι τους προαποφασίσει στο
σχεδιαστικό τραπέζι. Για παράδειγμα, η γρήγορη και μεγάλη αποδοχή του
συστήματος οδήγησε στη βελτιστοποίηση της απόκρισης των σελίδων, ενώ η
μετάβαση των χρηστών στα κινητά μέσα επέβαλε την εξαγορά εταιρειών με
σχετική εξειδίκευση (π.χ., Ιnstagram) και την κατασκευή της κινητής
εφαρμογής του Facebook, ώστε να έχουν πρόσβαση σε αυτό όσο γίνεται
περισσότεροι χρήστες και από όσο γίνεται περισσότερες συσκευές.</p>
<p>Από την πλευρά της σχεδίασης της διάδρασης, το κοινωνικό δίκτυο
Facebook καθιέρωσε μια σειρά από νέα μοτίβα, τα οποία έχουν ανάλογη
αποδοχή με τα μοτίβα της γραφικής επιφάνειας εργασίας. Ανεξάρτητα από το
αν μια εφαρμογή είναι κοινωνικό δίκτυο ή όχι, πολλές φορές δίνει τη
δυνατότητα στους χρήστες της να μοιραστούν απευθείας το περιεχόμενό τους
(share) ή τη δραστηριότητά τους στα κοινωνικά δίκτυα. Επίσης, δίνει τη
δυνατότητα να σχολιάσουν (comment) και να δηλώσουν την αποδοχή τους
(like) για το περιεχόμενο που εμφανίζεται. Επιπλέον, η μαζική χρήση του
κοινωνικού δικτύου (Τον Αύγουστο του 2015 το Facebook αριθμεί 1,5 δις
μέλη) και για πολλές διαφορετικές δραστηριότητες, έχει επιτρέψει και την
εκτέλεση μαζικών πειραμάτων στο πεδίο ακόμα και ερήμην των χρηστών του,
στα οποία μελετήθηκε αν η εμφάνιση διαφορετικού περιεχομένου (π.χ.,
θετικό, αρνητικό περιεχόμενο), μπορεί να επηρεάσει αντίστοιχα τη
συμπεριφορά των χρηστών.</p>
<p>Από την πλευρά της κατασκευής και της επιλογής των τεχνολογικών
εργαλείων της διάδρασης, το Facebook έχει υλοποιηθεί αρχικά και κατά ένα
μεγάλο μέρος του στην PHP, παρότι υπάρχουν πολλές άλλες επιλογές που
θεωρούνται περισσότερο κατάλληλες. Στην πράξη, οι κατασκευαστές του
Facebook διάλεξαν ένα οικείο εργαλείο και όταν βρέθηκαν μπροστά σε
θέματα απόδοσης, αντί να ξαναγράψουν το σύστημα, επέλεξαν να φτιάξουν
έναν μεταφραστή (compiler) που μετατρέπει την PHP σε C++, η οποία μπορεί
να εκτελεστεί γρηγορότερα. Τέλος, εκτός από την επίδραση που είχε το
Facebook στον τρόπο που αναπτύσσονται όλες οι διαδραστικές εφαρμογές,
είχε επιπλέον σημαντική επίδραση στον τρόπο που ορίζουμε το διαδίκτυο,
καθώς μειώθηκε η σημασία του WWW.</p>
<section id="footnotes" class="footnotes footnotes-end-of-section"
role="doc-endnotes">
<hr />
<ol start="24">
<li><div id="fn24">
<p>fig:facebook1<a href="#fnref24" class="footnote-back"
role="doc-backlink">↩︎</a></p>
</div></li>
<li><div id="fn25">
<p>fig:lifestreams<a href="#fnref25" class="footnote-back"
role="doc-backlink">↩︎</a></p>
</div></li>
</ol>
</section>
<h2 id="η-περίπτωση-της-συναισθηματικής-ευχρηστίας">Η περίπτωση της
συναισθηματικής ευχρηστίας</h2>
<figure id="fig:atm-affective">
<img src="../images/atm-affective.png"
alt="Τα πειράματα με εναλλακτικές διαρρυθμίσεις των πλήκτρων σε ένα απλό τραπεζικό ATM έδειξαν ότι ακόμη και αν δεν υπάρχει ουσιαστική διαφορά στην πραγματική απόδοση της διάδρασης, οι χρήστες αντιλαμβάνονται κάποια διαφορά, η οποία μπορεί να ερμηνευθεί από τη σκοπιά της αισθητικής." />
<figcaption aria-hidden="true">Τα πειράματα με εναλλακτικές
διαρρυθμίσεις των πλήκτρων σε ένα απλό τραπεζικό ATM έδειξαν ότι ακόμη
και αν δεν υπάρχει ουσιαστική διαφορά στην πραγματική απόδοση της
διάδρασης, οι χρήστες αντιλαμβάνονται κάποια διαφορά, η οποία μπορεί να
ερμηνευθεί από τη σκοπιά της αισθητικής.</figcaption>
</figure>
<figure id="fig:winamp">
<img src="../images/winamp.jpg"
alt="Το Winamp επιτρέπει στους χρήστες του να χρησιμοποιήσουν εναλλακτικές εμφανίσεις (skins) και επιπλέον, τους παρέχει ένα καλά τεκμηριωμένο τρόπο για να φτιάξουν τις δικές τους, με αποτέλεσμα να έχει δημιουργηθεί μια πολύ μεγάλη συλλογή από εμφανίσεις, με τις περισσότερες από αυτές να δίνουν έμφαση στη μορφή και να υιοθετούν ένα σκευομορφικό στυλ διάδρασης." />
<figcaption aria-hidden="true">Το Winamp επιτρέπει στους χρήστες του να
χρησιμοποιήσουν εναλλακτικές εμφανίσεις (skins) και επιπλέον, τους
παρέχει ένα καλά τεκμηριωμένο τρόπο για να φτιάξουν τις δικές τους, με
αποτέλεσμα να έχει δημιουργηθεί μια πολύ μεγάλη συλλογή από εμφανίσεις,
με τις περισσότερες από αυτές να δίνουν έμφαση στη μορφή και να
υιοθετούν ένα σκευομορφικό στυλ διάδρασης.</figcaption>
</figure>
<p>Η αρχική θεωρητική θεμελίωση της περιοχής της διάδρασης ανθρώπου και
υπολογιστή βασίστηκε στην τρέχουσα για την εποχή αντίληψη της διάδρασης,
που με τη σειρά της βασιζόταν στον επιτραπέζιο υπολογιστή, στη γραφική
επιφάνεια εργασίας, και στο πλαίσιο των εφαρμογών γραφείου και
παραγωγικότητας. Αντίστοιχα, η αρχική θεώρηση της διάδρασης έδωσε έμφαση
στην επεξεργασία της πληροφορίας από τον άνθρωπο, καθώς και στον έλεγχο
και στην απεικόνιση της πληροφορίας στο τερματικό του χρήστη. Οι
θεμελιωτές της αρχικής θεωρίας προσπάθησαν να δημιουργήσουν ένα
αναλυτικό πλαίσιο και τα αντίστοιχα μοντέλα, που να εκφράζουν τον τρόπο
που ο άνθρωπος αντιλαμβάνεται, επεξεργάζεται και ελέγχει την πληροφορία.
Σε ορισμένες περιπτώσεις, όπως στην πρόβλεψη της απόδοσης της συσκευής
εισόδου ‘ποντίκι’, η αναλυτική αυτή προσέγγιση είχε άριστα και
διαχρονικά αποτελέσματα.</p>
<p>Από την άλλη πλευρά όμως, καθώς περάσαμε στον κινητό και διάχυτο
υπολογιστή, και καθώς οι υπολογιστές έγιναν μέρος δραστηριοτήτων με
αξίες πέρα από την παραγωγικότητα, η ποιότητα της διάδρασης άρχισε να
αποκτά και άλλες διαστάσεις πέρα από εκείνη της βασικής ευχρηστίας. Στα
τέλη της δεκαετίας του 1990, μια σειρά από πειράματα διάδρασης με
διεπαφές που είχαν μεταξύ τους διαφορές μόνο στην αισθητική (και όχι
στην ευχρηστία τους) οδήγησε στο συμπέρασμα ότι η ευχρηστία δεν είναι ο
μόνος παράγοντας που καθορίζει την αποδοχή μιας διεπαφής.<a href="#fn26"
id="fnref26" class="footnote-ref" role="doc-noteref"><sup>26</sup></a>
Τα πειράματα έγιναν με πολλές διαφορετικές διεπαφές, με τραπεζικά ATM,<a
href="#fn27" id="fnref27" class="footnote-ref"
role="doc-noteref"><sup>27</sup></a> μουσικές συσκευές,<a href="#fn28"
id="fnref28" class="footnote-ref" role="doc-noteref"><sup>28</sup></a>
συστήματα προσομοίωσης βιομηχανικών διαδικασιών και με ηλεκτρονικά
καταστήματα, έτσι ώστε να εξεταστεί η έκταση του φαινομένου.
Διαπιστώθηκε, μάλιστα, ότι οι χρήστες θεωρούσαν περισσότερο εύχρηστες
τις διεπαφές που είχαν καλύτερη αισθητική.</p>
<p>Για να μελετήσουν την επίδραση της αισθητικής μιας διεπαφής στην
αντίληψη του χρήστη για την ευχρηστία ενός συστήματος, οι ερευνητές
προχώρησαν στην εκτέλεση ενός πειράματος. Ο σχεδιασμός του πειράματος
περιλάμβανε ότι διαφορετικές ομάδες χρηστών θα αξιολογούσαν αναφορικά
τόσο με την εμφάνιση και την ευχρηστία αλλά και τη συμπεριφορά,
διαφορετικά επίπεδα αισθητικής και ευχρηστίας μιας βασικής διεπαφής
μηχανήματος από Αυτόματη Ταμειακή Μηχανή (ΑΤΜ) τράπεζας.</p>
<p>Για τον σκοπό αυτό οι ερευνητές κατασκεύασαν μια προσομοίωση του ΑΤΜ
για διαφορετικές εκδοχές διαρρύθμισης των κουμπιών, και ζήτησαν από τους
χρήστες να τα βαθμολογήσουν αναφορικά με την αισθητική και την ευχρηστία
τους. Αμέσως μετά τους ζήτησαν να εκτελέσουν μια σειρά από τυπικές
διεργασίες (π.χ., ανάληψη χρημάτων, ερώτηση υπολοίπου λογαριασμού) με τα
οποία βαθμολόγησαν τις εναλλακτικές διεπαφές. Με αυτόν τον τρόπο, η
ανάλυση των αποτελεσμάτων έδωσε τη συσχέτιση ανάμεσα στην αισθητική και
την ευχρηστία που υπήρχε στα ΑΤΜ. Εκτός από την παραπάνω μεθοδολογία του
πειράματος, ιδιαίτερο ενδιαφέρον παρουσιάζει επίσης η χρήση του
λογισμικού διάδρασης το οποίο προσομοίωνε τα ΑΤΜ, αφού αντίστοιχο
λογισμικό χρησιμοποιήθηκε προηγούμενα και για την κατασκευή εναλλακτικών
συσκευών εισόδου ‘ποντίκι’.</p>
<p>Τα αποτελέσματα σε αυτό το επιστημονικό άρθρο ήρθαν να συμπληρώσουν
τα κομμάτια που έλειπαν σε ένα παζλ από ευρήματα προηγούμενων εργασιών.
Από τις αρχές της δεκαετίας του 1990 είχε αρχίσει να γίνεται φανερό ότι
σε πολλές περιπτώσεις διάδρασης διαφέρει η αντικειμενική απόδοση του
χρήστη από την υποκειμενική αντίληψη που έχει ο ίδιος ο χρήστης για την
απόδοσή του. Για παράδειγμα, υπάρχουν περιπτώσεις όπου ο χρήστης θα
κάνει περισσότερο χρόνο να ολοκληρώσει μια διεργασία που απαιτεί
διάδραση με τον υπολογιστή και παρ’ όλα αυτά θα τη θεωρεί πιο εύχρηστη
από κάποια άλλη που απαιτεί λιγότερο χρόνο. Αυτές οι περιπτώσεις
έρχονται σε αντίθεση με τον αρχικό ορισμό της ευχρηστίας, η οποία έχει
ως βασική διάσταση την απόδοση ή αλλιώς την ταχύτητα με την οποία ο
χρήστης ολοκληρώνει μια διεργασία. Βλέπουμε, λοιπόν, για μια ακόμη φορά
την ιδιαιτερότητα που έχει η περιοχή του προγραμματισμού της διάδρασης,
όπου η αντικειμενική απόδοση ενός συστήματος ανθρώπου και υπολογιστή
μπορεί να μην είναι αρκετή για να χαρακτηρίσει την ποιότητά του.
Απαιτείται και η σύμφωνη γνώμη του χρήστη, η οποία όμως είναι εξ΄
ορισμού υποκειμενική και μέσα σε ένα πλήθος ερευνητικών δεδομένων, η
γνώμη των διαφόρων χρηστών μπορεί να έχει μεγάλη διακύμανση.</p>
<section id="footnotes" class="footnotes footnotes-end-of-section"
role="doc-endnotes">
<hr />
<ol start="26">
<li><div id="fn26">
<p><span class="citation" data-cites="norman2004emotional">D. A. Norman
(2004)</span><a href="#fnref26" class="footnote-back"
role="doc-backlink">↩︎</a></p>
</div></li>
<li><div id="fn27">
<p>fig:atm-affective<a href="#fnref27" class="footnote-back"
role="doc-backlink">↩︎</a></p>
</div></li>
<li><div id="fn28">
<p>fig:winamp<a href="#fnref28" class="footnote-back"
role="doc-backlink">↩︎</a></p>
</div></li>
</ol>
</section>
<h2 id="σύντομη-βιογραφία-του-jaron-lanier">Σύντομη βιογραφία του Jaron
Lanier</h2>
<p>Ο Jaron Lanier έγινε ευρύτερα γνωστός για τον προβληματισμό σχετικά
με τα κοινωνικά μέσα και τους μηχανισμούς εξατομίκευσης που
χρησιμοποιούν. Ηταν ήδη όμως πολύ γνωστός σε έναν μικρότερο κύκλο
ανθρώπων από την δεκαετιά του 1980 για τα πρώτα εμπορικά συστήματα
εικονικής πραγματικότητας που απευθύνονταν κυρίως στην βιομηχανία. Τα
προϊόντα της εταιρείας του VPL βασίζονταν σε μάσκα και γάντι εικονικής
πραγματικότητας<a href="#fn29" id="fnref29" class="footnote-ref"
role="doc-noteref"><sup>29</sup></a> με τα οποία μπορούσε να γίνει ο
σχεδιασμός της καμπίνας ενός αυτοκινήτου ή η προετοιμασία για ένα
δύσκολο χειρουργείο.<a href="#fn30" id="fnref30" class="footnote-ref"
role="doc-noteref"><sup>30</sup></a></p>
<figure id="fig:lanier-profile">
<img src="../images/lanier-profile.jpg"
alt="Ο Jaron Lanier κατασκεύασε τα πρώτα εμπορικά συστήματα εικονικής πραγματικότητας με στόχο να εξερευνήσει την ανθρώπινη συνείδηση σε φαντασιακά περιβάλλοντα και σε διάδραση με άλλους χρήστες. Εκτός από την θεμελίωση μιας σημαντικής περιοχής έχει συμβάλει στην διάδοση μιας ανθρωποκεντρικής τεχνολογικής φιλοσοφίας που έρχεται σε αντίθεση με το κυρίαρχο αφήγημα της Τεχνητής Νοημοσύνης." />
<figcaption aria-hidden="true">Ο Jaron Lanier κατασκεύασε τα πρώτα
εμπορικά συστήματα εικονικής πραγματικότητας με στόχο να εξερευνήσει την
ανθρώπινη συνείδηση σε φαντασιακά περιβάλλοντα και σε διάδραση με άλλους
χρήστες. Εκτός από την θεμελίωση μιας σημαντικής περιοχής έχει συμβάλει
στην διάδοση μιας ανθρωποκεντρικής τεχνολογικής φιλοσοφίας που έρχεται
σε αντίθεση με το κυρίαρχο αφήγημα της Τεχνητής Νοημοσύνης.</figcaption>
</figure>
<figure id="fig:vpl-virtual-reality">
<img src="../images/vpl-virtual-reality.jpg"
alt="Το γάντι δεδομένων περιέχει αισθητήρες που καταγράφουν την θέση του χεριού και τις κινήσεις των δακτύλων, έτσι ώστε να υπάρχει λεπτομερής χειρισμός στο περιβάλλον εικονικής πραγματικότητας που απεικονίζεται στην μάσκα. Η δυνατότητα του χρήστη όχι μόνο να πλοηγηθεί, αλλά κυρίως να εκφραστεί σωματικά και να χειριστεί με μεγάλη ακρίβεια τον εικονικό εαυτό και περιβάλλον του, στο οποίο συνεργάζεται και με άλλους χρήστες, ήταν τα θεμέλια στο πρώτο εμπορικό σύστημα εικονικής πραγματικότητας." />
<figcaption aria-hidden="true">Το γάντι δεδομένων περιέχει αισθητήρες
που καταγράφουν την θέση του χεριού και τις κινήσεις των δακτύλων, έτσι
ώστε να υπάρχει λεπτομερής χειρισμός στο περιβάλλον εικονικής
πραγματικότητας που απεικονίζεται στην μάσκα. Η δυνατότητα του χρήστη
όχι μόνο να πλοηγηθεί, αλλά κυρίως να εκφραστεί σωματικά και να
χειριστεί με μεγάλη ακρίβεια τον εικονικό εαυτό και περιβάλλον του, στο
οποίο συνεργάζεται και με άλλους χρήστες, ήταν τα θεμέλια στο πρώτο
εμπορικό σύστημα εικονικής πραγματικότητας.</figcaption>
</figure>
<p>Η εικονική πραγματικότητα έγινε περισσότερο δημοφιλής τις επόμενες
δεκαετίας με σημαντικές βελτιώσεις στην ποιότητα των γραφικών και στο
κόστος του κράνους, αλλά χωρίς την αντίστοιχη βελτίωση στην διάδραση με
τον χρήστη. Πράγματι, ο Jaron Lanier θεωρεί την διάδραση του χρήστη με
τον εικονικό κόσμο ή ακόμη καλύτερα με άλλες αναπαραστάσεις ανθρώπων
περισσότερο σημαντική από την ανάλυση των γραφικών. Για τον σκοπό αυτό,
το γάντι εικονικής πραγματικότητας προσφέρει μεγάλη λεπτομέρεια στον
χειρισμό εικονικών αντικειμένων ή του χαρακτήρα, ο οποίος δεν είναι
αναγκαίο να αναπαριστά κάποιον άνθρωπο.</p>
<p>Αυτή η έμφαση στην διάδραση με εξειδικευμένες διεπαφές όπως το γάντι
καθώς και η επέκταση της ανθρώπινης εμπειρίας με εναλλακτικές εικονικές
αναπαραστάσεις βασίζονται στην μουσική. O Jaron Lanier ασχολείται από
πολύ μικρός με την μουσική και είναι συλλέκτης μουσικών οργάνων. Όπως οι
Alan Kay και Ted Nelson θεωρούν ότι ο υπολογιστής μπορεί να γίνει ένα
προηγμένο μέσο επικοινωνίας για μια νέα λογοτεχνία, αντίστοιχα και ο
Jaron Lanier θεωρεί πως ο υπολογιστής μπορεί να γίνει ένα νέο είδος
μουσικού οργάνου με απεριόριστες οπτικο-ακουστικές δυνατότητες.</p>
<p>Περισσότερο σημαντική από την πολύ σπουδαία τεχνολογική συνεισφορά
του παραμένει η ανθρωποκεντρική έμφαση στην δουλειά του. Για παράδειγμα,
η διαμεσολαβούμενη κοινωνική διάδραση είναι θεμελιώδης στους εικονικούς
κόσμους που δημιούργησε, αλλά βασίζεται στην ενεργή πρωτοβουλία και
ελευθερία του κάθε ανθρώπου και όχι σε εξωτερικά συμφέροντα, όπως αυτά
μιας πλατφόρμας ή ενός διαφημιζόμενου. Με αυτόν τον τρόπο, οι
υπολογιστές μπορούν να γίνουν τόσο ένα νέο μέσο έκφρασης, αλλά και ένα
μέσο οικονομικής ανεξαρτησίας, αφού η αξία κατανέμεται στους ανθρώπους
και στις δράσεις τους, αντί να αναλύεται και να συγκεντρώνεται
κεντρικά.</p>
<section id="footnotes" class="footnotes footnotes-end-of-section"
role="doc-endnotes">
<hr />
<ol start="29">
<li><div id="fn29">
<p>fig:lanier-profile<a href="#fnref29" class="footnote-back"
role="doc-backlink">↩︎</a></p>
</div></li>
<li><div id="fn30">
<p>fig:vpl-virtual-reality<a href="#fnref30" class="footnote-back"
role="doc-backlink">↩︎</a></p>
</div></li>
</ol>
</section>
<h2 class="unnumbered" id="βιβλιογραφία">Βιβλιογραφία</h2>
<div id="refs" class="references csl-bib-body hanging-indent"
role="list">
<div id="ref-fogg2003persuasive" class="csl-entry" role="listitem">
Fogg, BJ. 2003. <em>Persuasive Technology: Using Computers to Change
What We Think and Do</em>. Morgan Kaufmann.
</div>
<div id="ref-kaptelinin2007beyond" class="csl-entry" role="listitem">
Kaptelinin, Victor, και Mary Czerwinski. 2007. <em>Beyond the desktop
metaphor: designing integrated digital work environments</em>. Τ. 1. The
MIT Press.
</div>
<div id="ref-krueger1991artificial" class="csl-entry" role="listitem">
Krueger, M. W. 1991. <em>Artificial Reality II</em>. Addison-Wesley.
</div>
<div id="ref-laurel2013computers" class="csl-entry" role="listitem">
Laurel, Brenda. 2013. <em>Computers as theatre</em>. Addison-Wesley.
</div>
<div id="ref-levy1984hackers" class="csl-entry" role="listitem">
Levy, Steven. 1984. <em>Hackers: Heroes of the computer revolution</em>.
Τ. 14. Anchor Press/Doubleday Garden City, NY.
</div>
<div id="ref-markoff2005dormouse" class="csl-entry" role="listitem">
Markoff, John. 2005. <em>What the dormouse said: How the sixties
counterculture shaped the personal computer industry</em>. Penguin.
</div>
<div id="ref-mccullough1998abstracting" class="csl-entry"
role="listitem">
McCullough, Malcolm. 1998. <em>Abstracting craft: The practiced digital
hand</em>. MIT press.
</div>
<div id="ref-norman2014things" class="csl-entry" role="listitem">
Norman, Don. 2014. <em>Things that make us smart: Defending human
attributes in the age of the machine</em>. Diversion Books.
</div>
<div id="ref-norman2004emotional" class="csl-entry" role="listitem">
Norman, Donald A. 2004. <em>Emotional design: Why we love (or hate)
everyday things</em>. Basic Civitas Books.
</div>
<div id="ref-reeves1996media" class="csl-entry" role="listitem">
Reeves, Byron, και Clifford Ivar Nass. 1996. <em>The media equation: How
people treat computers, television, and new media like real people and
places.</em> Cambridge university press.
</div>
<div id="ref-rheingold2000virtual" class="csl-entry" role="listitem">
Rheingold, Howard. 2000. <em>The Virtual Community: Homesteading on the
Electronic Frontier</em>. MIT press.
</div>
<div id="ref-weizenbaum1976computer" class="csl-entry" role="listitem">
Weizenbaum, Joseph. 1976. <em>Computer power and human reason: From
judgment to calculation.</em> WH Freeman &amp; Co.
</div>
</div>
<h1 id="σύνθεση">Σύνθεση</h1>
<blockquote>
<p>Ελπίζουμε ότι, σε όχι πάρα πολλά χρόνια, τα ανθρώπινα μυαλά και οι
υπολογιστικές μηχανές θα συνδεθούν πολύ στενά μεταξύ τους, και ότι η
συνεργασία που θα προκύψει θα σκέφτεται όπως δεν έχει σκεφτεί ποτέ ο
ανθρώπινος εγκέφαλος και θα επεξεργάζεται τα δεδομένα με τρόπο που δεν
έχουν πλησιάσει οι μηχανές διαχείρισης της πληροφορίας που γνωρίζουμε
σήμερα. J. C. R. Licklider</p>
</blockquote>
<h3 id="περίληψη">Περίληψη</h3>
<p>Η μελέτη του προγραμματισμού της διάδρασης για την περίπτωση των
συνεργατικών συστημάτων -καθώς και για συστήματα που είναι σύνθεση
επιμέρους συστημάτων- απαιτεί επιπλέον μεθόδους και τεχνικές από εκείνες
που είδαμε στο δεύτερο κεφάλαιο. Επίσης, ο βαθμός συμμετοχής των χρηστών
στη διαδικασία της σχεδίασης, της ανάπτυξης, της εισαγωγής και της
ενημέρωσης ενός συστήματος απαιτεί μια διαφορετική αντιμετώπιση.
Συμπληρωματικά, στην περιοχή της διάδρασης ανθρώπου και υπολογιστή,
έχουμε περιοχές όπως τα κοινωνικά και συνεργατικά συστήματα καθώς και τα
πληροφοριακά συστήματα διοίκησης που αναλύουν φαινόμενα διάδρασης, τα
οποία συμβαίνουν σε σύνθετα κοινωνικά και τεχνολογικά συστήματα, και
μπορεί να λειτουργούν σε πολύ μεγαλύτερη κλίμακα από αυτήν της διάδρασης
ενός ανθρώπου με έναν υπολογιστή. Τόσο η σύνθεση, όσο και η κλίμακα ενός
συστήματος διάδρασης απαιτούν μια διαφορετική προσέγγιση στη μεθοδολογία
της σχεδίασης από εκείνη που καλύπτει τη βασική περίπτωση ανθρώπου και
υπολογιστή.</p>
<h2 id="πλοήγηση-στην-πληροφορία">Πλοήγηση στην πληροφορία</h2>
<p>Σε αυτήν την ενότητα θα μελετήσουμε τα είδη της διάδρασης, τα
στοιχεία που τη συνθέτουν, καθώς και το φυσικό, το κοινωνικό και το
οργανωσιακό πλαίσιο μέσα στο οποίο μπορεί να συντελεστεί. Ακόμη, θα
εξετάσουμε πόσο καλά μπορούν να υποστηρίξουν τις ανθρώπινες διαδικασίες
τα διαφορετικά είδη της διάδρασης. Με αυτές τις γνώσεις σε αυτήν την
ενότητα μπορούμε να μελετήσουμε πώς ο άνθρωπος χρησιμοποιεί τις συσκευές
κυρίως ως εργαλεία για την πλοήγηση και ανάκτηση της πληροφορίας <a
href="#fn1" id="fnref1" class="footnote-ref"
role="doc-noteref"><sup>1</sup></a> <a href="#fn2" id="fnref2"
class="footnote-ref" role="doc-noteref"><sup>2</sup></a> αλλά και ως
μέσα επικοινωνίας, ψυχαγωγίας και συνεργασίας.</p>
<p>Τα συνεργατικά συστήματα είναι από τις σημαντικότερες και πιο γρήγορα
αναπτυσσόμενες υποπεριοχές της διάδρασης ανθρώπου και υπολογιστή, πράγμα
αναμενόμενο, αφού ασχολείται με τα πολύ σημαντικά ζητούμενα της
συνεργασίας και της επικοινωνίας μεταξύ ανθρώπων όταν αυτές γίνονται
μέσω υπολογιστή. Στην πιο κλασική ταξινόμησή τους, οι συνεργατικές
εφαρμογές διακρίνονται βάσει των διαστάσεων της απόστασης και του
χρόνου. Οι πιο δημοφιλείς είναι οι εφαρμογές επικοινωνίας και
συνεργασίας (είτε σύγχρονης είτε ασύγχρονης) από απόσταση, όπου το
ζητούμενο είναι ο συντονισμός ομάδων χρηστών. Αναφορικά με την
τροπικότητά τους, οι εφαρμογές συνεργασίας βασίζονται συνήθως, σε
κείμενο, εικόνα, ήχο, ενώ τα συστήματα υπερμέσων, όπως ο παγκόσμιος
ιστός<a href="#fn3" id="fnref3" class="footnote-ref"
role="doc-noteref"><sup>3</sup></a> διευκολύνουν τη σύνθεση συστημάτων
σε μεγάλη κλίμακα για την εξυπηρέτηση πολλών χρηστών.</p>
<figure id="fig:hypercard-layout">
<img src="../images/hypercard-layout.png"
alt="Το πρόγραμμα Hypercard της Apple χρησιμοποιούσε την απλή μεταφορά της στοίβας με κάρτες, και των αντικειμένων πάνω σε αυτές, και περιλάμβανε πολλές δυνατότητες σε απλή μορφή (όπως πολυμέσα, υπερμέσα, και μια γλώσσα προγραμματισμού χρήστη), οι οποίες επέτρεψαν την ευέλικτη προσαρμογή του από τους τελικούς χρήστες σε πολλά πεδία, όπως σε παρουσιάσεις, στην κατασκευή διαδραστικών πρωτοτύπων, σε βίντεο παιχνίδια." />
<figcaption aria-hidden="true">Το πρόγραμμα Hypercard της Apple
χρησιμοποιούσε την απλή μεταφορά της στοίβας με κάρτες, και των
αντικειμένων πάνω σε αυτές, και περιλάμβανε πολλές δυνατότητες σε απλή
μορφή (όπως πολυμέσα, υπερμέσα, και μια γλώσσα προγραμματισμού χρήστη),
οι οποίες επέτρεψαν την ευέλικτη προσαρμογή του από τους τελικούς
χρήστες σε πολλά πεδία, όπως σε παρουσιάσεις, στην κατασκευή
διαδραστικών πρωτοτύπων, σε βίντεο παιχνίδια.</figcaption>
</figure>
<figure id="fig:web-search">
<img src="../images/web-search.png"
alt="Ανεξάρτητα από την μορφή του υπολογιστή (επιτραπέζιος, κινητός), για περισσότερο από δύο δεκαετίες, η ανάκτηση πληροφορίας και η διάδραση με το σύστημα των ιστοσελίδων είναι τόσο τεχνολογικά όσο και συμπεριφορικά ο πιο διαχρονικός και δημοφιλής τρόπος διάδρασης ανθρώπου και υπολογιστή." />
<figcaption aria-hidden="true">Ανεξάρτητα από την μορφή του υπολογιστή
(επιτραπέζιος, κινητός), για περισσότερο από δύο δεκαετίες, η ανάκτηση
πληροφορίας και η διάδραση με το σύστημα των ιστοσελίδων είναι τόσο
τεχνολογικά όσο και συμπεριφορικά ο πιο διαχρονικός και δημοφιλής τρόπος
διάδρασης ανθρώπου και υπολογιστή.</figcaption>
</figure>
<p>Ενώ προχωράμε σε όλο και πιο σύνθετες μορφές διάδρασης, δεν σημαίνει
ότι οι προηγούμενες βασικές μορφές χάνονται. Αντίθετα, οι βασικές μορφές
διάδρασης συνεχίζουν να παίζουν σημαντικό ρόλο ως συστατικά στοιχεία των
πιο σύνθετων συστημάτων. Για παράδειγμα, ένα ηλεκτρονικό κατάστημα
περιέχει πολλές χρήσιμες λειτουργίες, όπως το εικονικό καλάθι αγορών στο
οποίο ο χρήστης-καταναλωτής συγκεντρώνει τα προϊόντα που θέλει να
αγοράσει. Το ηλεκτρονικό καλάθι αγορών (εκτός από οικεία μεταφορά του
καλαθιού από τον πραγματικό κόσμο) είναι ένα εργαλείο που διευκολύνει τη
διάδραση με το εικονικό κατάστημα. Επιπλέον, ένα σύγχρονο ηλεκτρονικό
κατάστημα περιλαμβάνει και κάποια συνεργατικά στοιχεία, όπως την
επικοινωνία με ηλεκτρονικούς πωλητές ή την ανάγνωση και συγγραφή σχολίων
για τα προϊόντα. Επομένως, τα πιο χρήσιμα συστήματα αποτελούν σύνθεση
από επιμέρους ιδέες, τεχνολογίες και πρακτικές, που θα πρέπει να
ολοκληρωθούν σε μεγάλη κλίμακα, ούτως ώστε να εξυπηρετήσουν πολλούς και
διαφορετικούς χρήστες.</p>
<p>Η περιοχή της επικοινωνίας ανθρώπου και υπολογιστή έδωσε αρχικά
έμφαση στη διάδραση με εφαρμογές γραφείου, αναφερόμενη στην αξία της
απόδοσης και της παραγωγικότητας. Είναι χαρακτηριστικό ότι ο Licklider,
στη δεκαετία του 1950, δημιούργησε τις προδιαγραφές που πρέπει να
ικανοποιεί η διάδραση του ανθρώπου με τον υπολογιστή, μελετώντας τις
εργασίες που έκανε ο ίδιος κατά τη διάρκεια μιας τυπικής ημέρας του.
Διαπίστωσε ότι τον περισσότερο χρόνο του τον αφιέρωνε στην ανάκτηση
πληροφορίας, καθώς και στην επεξεργασία και στην οπτικοποίηση της
πληροφορίας, ενώ αφιέρωνε ελάχιστο μόνο χρόνο στην κατανόηση της
πληροφορίας και στη λήψη αποφάσεων, που ήταν και πιο σημαντικά για τον
άνθρωπο. Λίγο καιρό αργότερα, από τη θέση του υπεύθυνου χρηματοδότησης,
στήριξε την έρευνα του Engelbart που οδήγησε στη δημιουργία της συσκευής
εισόδου ‘ποντίκι’, καθώς και σε μια σειρά από τεχνολογίες που
χρησιμοποιούνται σήμερα σε όλα τα γραφεία. Από τη μια πλευρά βλέπουμε
ότι το αρχικό όραμα πήρε πάρα πολύ καιρό μέχρι να γίνει μέρος της
καθημερινότητας, αλλά από την άλλη πλευρά το μεγαλύτερο μέρος της
προσπάθειας ξεκίνησε με κίνητρο να βελτιώσει ένα πολύ συγκεκριμένο (αν
και σίγουρα όχι το σημαντικότερο) πεδίο της ανθρώπινης δραστηριότητας
(αυτό της εργασίας).</p>
<p>Ταυτόχρονα με την ανάπτυξη των υπολογιστών που διευκολύνουν την
εργασία, αυξάνουν την παραγωγικότητα και κερδίζουν χρόνο για τον
άνθρωπο, δημιουργούνται νέες εφαρμογές σε πεδία, όπως στην εκπαίδευση
και στην ψυχαγωγία. Οι εκπαιδευτικές και ψυχαγωγικές εφαρμογές -αν και
σε πολλές περιπτώσεις εκτελούνται σε υλικό και λογισμικό παρόμοιο με
εκείνο των εφαρμογών γραφείου- έχουν πολύ διαφορετικές απαιτήσεις στον
προγραμματισμό της διάδρασης με τον χρήστη.<a href="#fn4" id="fnref4"
class="footnote-ref" role="doc-noteref"><sup>4</sup></a> Ειδικά οι
ψυχαγωγικές εφαρμογές, αλλά και πολλές εκπαιδευτικές εφαρμογές που στόχο
έχουν να κεντρίσουν το ενδιαφέρον του χρήστη, δίνουν χαμηλή
προτεραιότητα στην απόδοση της διεργασίας και στον χρόνο που αυτή
παίρνει, ενώ δίνουν έμφαση στην ευχάριστη διάδραση. Για να το πετύχουν
αυτό χρησιμοποιούν τεχνικές όπως τα πολυμέσα, η αφήγηση, η συμμετοχή
πολλών χρηστών, και επιπλέον κάνουν χρήση συσκευών διάδρασης, που
διευκολύνουν την εμβύθιση του χρήστη σε ένα εικονικό ή επαυξημένο
περιβάλλον.<a href="#fn5" id="fnref5" class="footnote-ref"
role="doc-noteref"><sup>5</sup></a> Η εμβύθιση του χρήστη
μεγιστοποιείται με τη χρήση συσκευών διάδρασης εικονικής
πραγματικότητας, ενώ η μεγιστοποίηση της προσβασιμότητας στην πληροφορία
(από διαφορετικούς χρήστες και σε διαφορετικά πλαίσια χρήσης)
επιτυγχάνεται με τις τεχνικές της πολυτροπικής διάδρασης, η οποία δίνει
έμφαση σε συσκευές διάδρασης πέρα από το πληκτρολόγιο και το
ποντίκι.</p>
<p>Η χρησιμότητα των υπερμέσων μπορεί να θεωρείται δεδομένη, αφού έγινε
δημοφιλής με την ανάπτυξη του παγκόσμιου ιστού, αλλά η αρχική ιδέα ήταν
του Ted Nelson από το 1965 και περιλαμβάνει επιπλέον λειτουργίες, όπως η
σημασιολογία (semantics) και το αρχείο αλλαγών, με σκοπό να ενθαρρύνει
τη μη-γραμμική ανάγνωση καθώς και την ενεργή συμμετοχή των χρηστών ως
συγγραφέων και όχι μόνο ως αναγνωστών. Η χρησιμότητα των υπερμέσων,
αρχικά έγινε αισθητή στους χρήστες με το Hypercard, και λίγο αργότερα με
τον παγκόσμιο ιστό (WWW) που επέτρεψε τη διασύνδεση αντικειμένων που
βρίσκονταν σε απομακρυσμένους δικτυωμένους υπολογιστές.<a href="#fn6"
id="fnref6" class="footnote-ref" role="doc-noteref"><sup>6</sup></a></p>
<figure id="fig:we-feel-fine">
<img src="../images/we-feel-fine.jpg"
alt="Η ανάκτηση της πληροφορίας μπορεί να ξεκίνησε από την αναζήτηση σε κείμενο στις μεγάλες ψηφιακές βιβλιοθήκες, αλλά γρήγορα βρήκε εφαρμογή στις νέες δραστηριότητες των ανθρώπων, όπως είναι η ανάκτηση πληροφορίας σχετικής με το συναίσθημα (π.χ., We Feel Fine) από ιστολόγια που συνήθως χρησιμοποιούνται από τους χρήστες τους ως προσωπικά ημερολόγια." />
<figcaption aria-hidden="true">Η ανάκτηση της πληροφορίας μπορεί να
ξεκίνησε από την αναζήτηση σε κείμενο στις μεγάλες ψηφιακές βιβλιοθήκες,
αλλά γρήγορα βρήκε εφαρμογή στις νέες δραστηριότητες των ανθρώπων, όπως
είναι η ανάκτηση πληροφορίας σχετικής με το συναίσθημα (π.χ., We Feel
Fine) από ιστολόγια που συνήθως χρησιμοποιούνται από τους χρήστες τους
ως προσωπικά ημερολόγια.</figcaption>
</figure>
<figure id="fig:tenbyten">
<img src="../images/tenbyten.png"
alt="Η πληθώρα και η πολυπλοκότητα της διαθέσιμης πληροφορίας δημιούργησε την ανάγκη για μια νέα μορφή ανάκτησης και απεικόνισης της πληροφορίας, όπου ο ρόλος του δημοσιογράφου είναι περισσότερο ως προγραμματιστής της διάδρασης." />
<figcaption aria-hidden="true">Η πληθώρα και η πολυπλοκότητα της
διαθέσιμης πληροφορίας δημιούργησε την ανάγκη για μια νέα μορφή
ανάκτησης και απεικόνισης της πληροφορίας, όπου ο ρόλος του
δημοσιογράφου είναι περισσότερο ως προγραμματιστής της
διάδρασης.</figcaption>
</figure>
<p>Ο προγραμματισμός της διάδρασης για τις εφαρμογές υπερμέσων είναι μια
απαιτητική δραστηριότητα, αλλά αυτό δε σημαίνει ότι θα πρέπει να γίνεται
μόνο από τους έμπειρους και εκπαιδευμένους χρήστες. Για παράδειγμα, το
πολύ πετυχημένο λογισμικό Hypercard της Apple έδωσε τη δυνατότητα σε
όλους τους χρήστες να δημιουργήσουν τα δικά τους υπερμεσικά και
πολυμεσικά προγράμματα στον υπολογιστή, χωρίς να έχουν γνώσεις
προγραμματισμού, με αποτέλεσμα να δημιουργηθούν πολλά νέα προϊόντα από
ανθρώπους που διαφορετικά δεν θα είχαν πρόσβαση σε αυτήν την τεχνολογία.
Όπως η επιφάνεια εργασίας, έτσι ακριβώς και το WWW εξελίχθηκε πολύ
γρήγορα από μια απλή εφαρμογή στον υπολογιστή του χρήστη σε μια
πλατφόρμα πάνω στην οποία εκτελούνται όλες οι εφαρμογές του χρήστη, τόσο
οι παραδοσιακές (π.χ., εφαρμογές γραφείου) όσο και οι νέες εφαρμογές,
όπως η κοινωνική δικτύωση, οι εμπορικές συναλλαγές και η ανάκτηση
πληροφορίας.</p>
<p>Το πιο συνηθισμένο λάθος στον προγραμματισμό της διάδρασης για
σύνθετα συστήματα τα οποία θα χρησιμοποιήσουν πολλοί και διαφορετικοί
χρήστες, είναι να θεωρήσουμε ότι η τεχνολογία μπορεί να προσφέρει μια
συνολική λύση, ή ακόμη χειρότερα, ότι η διαδικασία σχεδίασης μπορεί να
προσφέρει μια λύση από μόνη της χωρίς τη συμμετοχή του ανθρώπινου
παράγοντα. Ακόμη και στα συστήματα αυτοματισμού γραφείου, όπου μπορούμε
να υποθέσουμε ότι οι χρήστες είναι έμπειροι, η έρευνα έχει δείξει πως
υπάρχουν αναγκαίες διεργασίες συντονισμού ή ακόμη και αντικείμενα, όπως
το χαρτί, που είναι προτιμότερο να μην γίνουν μέρος του υπολογιστικού
συστήματος, αλλά να παραμείνουν μέρος ενός συνολικού πληροφοριακού
συστήματος που περιλαμβάνει υπολογιστές, αντικείμενα, ανθρώπους, και
πρακτικές. Επιπλέον, επειδή οι προδιαγραφές που αντικατοπτρίζουν τις
ανθρώπινες δραστηριότητες είναι φευγαλέες κατά την εισαγωγή μιας
τεχνολογικής παρέμβασης, ένας τρόπος να κρατήσουμε το σύστημα χρήσιμο
είναι να επιτρέπουμε, ή ακόμη καλύτερα να ενθαρρύνουμε τη συμμετοχή του
τελικού χρήστη στη σχεδίαση αλλά και στην κατασκευή του.</p>
<p>Μια από τις πιο σημαντικές δυνατότητες των ηλεκτρονικών υπολογιστών
είναι ότι διευκολύνουν την εκτέλεση διεργασιών που βασίζονται στην
επεξεργασία πληροφορίας. Για παράδειγμα, ένας υπολογιστής μπορεί να μας
διευκολύνει να βρούμε άμεσα όλα τα άρθρα ενός συγγραφέα που περιέχουν
κάποιες λέξεις κλειδιά, κάτι που διαφορετικά θα απαιτούσε -πέρα από την
επίσκεψη σε έναν ή περισσότερους χώρους- πολλές ώρες αναζήτησης στα
ράφια της βιβλιοθήκης. Παράλληλα με τη μετάβαση από το απλό κείμενο στο
εμπλουτισμένο με πολυμέσα κείμενο, η ανάκτηση της πληροφορίας επεκτάθηκε
σε νέες μορφές περιεχομένου, όπως είναι το περιεχόμενο που προσφέρει η
κοινωνική δικτύωση, καθώς και το περιεχόμενο που παράγεται σε πραγματικό
χρόνο από πολλούς χρήστες. Για παράδειγμα, η βραβευμένη εφαρμογή ‘We
Feel Fine’ καταγράφει συνεχώς τα συναισθήματα που εκφράζονται από τους
χρήστες ιστολογίων και προσφέρει εναλλακτικούς τρόπους πλοήγησης (π.χ.,
με αφαιρετική οπτικοποίηση) στα συναισθήματα που εκφράζονται ατομικά ή
συλλογικά από τους χρήστες του διαδικτύου. Βλέπουμε ότι η παραδοσιακή
ανάκτηση της πληροφορίας έχει διαχρονική αξία, αλλά ταυτόχρονα γίνεται
μέσα στα χρόνια πολύ διαφορετική, καθώς οι δραστηριότητες και τα
ενδιαφέροντα των χρηστών της μετασχηματίζονται.</p>
<p>Η μεγάλη αποδοχή των υπερμέσων και των πολυμέσων ως δικτυακών
εφαρμογών που βασίζονται σε ψηφιακά διασυνδεδεμένο υλικό (π.χ., σε
blogs, εικόνες, μουσική, ειδήσεις, κτλ.) δημιούργησε την ανάγκη για
εύχρηστους και διασκεδαστικούς τρόπους ανάκτησης της πληροφορίας. Η
χρήση κειμένου σε μια μηχανή αναζήτησης είναι ένας πολύ αποτελεσματικός
τρόπος ανάκτησης της πληροφορίας, όταν γνωρίζουμε με σχετική ακρίβεια τι
ψάχνουμε, ειδικά αν αυτό που ψάχνουμε περιγράφεται με κείμενο όπως αυτό
που χρησιμοποιούμε για την αναζήτηση. Υπάρχουν όμως πολλές περιπτώσεις
που μια αναζήτηση μπορεί να έχει περισσότερο τη μορφή της ανοιχτής
εξερεύνησης της πληροφορίας, όπως για παράδειγμα η επίσκεψη σε μια
βιβλιοθήκη και η ελεύθερη πλοήγηση στα εξώφυλλα και στο περιεχόμενο των
βιβλίων.</p>
<p>Αντίστοιχα, η πληθώρα της διαθέσιμης πληροφορίας και πιο
συγκεκριμένα, η πολυμεσική της φύση, δημιούργησε την ανάγκη για νέες
μορφές οπτικοποίησης και αναζήτησης της πληροφορίας, που να βασίζονται
περισσότερο στα πολυμέσα και στην αφαίρεση και λιγότερο στο κείμενο και
στη στοχευμένη αναζήτηση. Για παράδειγμα, η εφαρμογή “We Feel Fine”
οπτικοποιεί τις προτάσεις που περιέχουν την λέξη “feel” όταν τις βρίσκει
στα ιστολόγια των χρηστών, τα οποία συνήθως χρησιμοποιούν ως προσωπικά
ημερολόγια. Το αποτέλεσμα αυτής της τεχνικής του προγραμματισμού της
διάδρασης με πολυμέσα και υπερμέσα είναι μια αφαιρετική απεικόνιση των
συναισθημάτων της μπλογκόσφαιρας (blogosphere). Αντίστοιχα, η εφαρμογή
tenbyten δημιουργεί κάθε μια ώρα ένα μωσαϊκό της τρέχουσας
ειδησεογραφίας, όπως την ανακτά από εκατό δημοφιλή πρακτορεία ειδήσεων.
Συνολικά, βλέπουμε πως ο προγραμματισμός της διάδρασης μπορεί να
δημιουργήσει ένα νέο επίπεδο ανάγνωσης και αντίληψης του κόσμου που
βασίζεται στη σύνθεση των επιμέρους στοιχείων του. <a href="#fn7"
id="fnref7" class="footnote-ref" role="doc-noteref"><sup>7</sup></a> <a
href="#fn8" id="fnref8" class="footnote-ref"
role="doc-noteref"><sup>8</sup></a></p>
<section id="footnotes" class="footnotes footnotes-end-of-section"
role="doc-endnotes">
<hr />
<ol>
<li><div id="fn1">
<p>fig:hypercard-layout<a href="#fnref1" class="footnote-back"
role="doc-backlink">↩︎</a></p>
</div></li>
<li><div id="fn2">
<p>fig:web-search<a href="#fnref2" class="footnote-back"
role="doc-backlink">↩︎</a></p>
</div></li>
<li><div id="fn3">
<p><span class="citation" data-cites="bush1945we">Bush κ.ά.
(1945)</span>, berners1996past<a href="#fnref3" class="footnote-back"
role="doc-backlink">↩︎</a></p>
</div></li>
<li><div id="fn4">
<p><span class="citation" data-cites="shiffman2009learning">Shiffman
(2009)</span><a href="#fnref4" class="footnote-back"
role="doc-backlink">↩︎</a></p>
</div></li>
<li><div id="fn5">
<p><span class="citation" data-cites="packer2002multimedia">Packer και
Jordan (2002)</span><a href="#fnref5" class="footnote-back"
role="doc-backlink">↩︎</a></p>
</div></li>
<li><div id="fn6">
<p><span class="citation" data-cites="barnet2013memory">Barnet
(2013)</span><a href="#fnref6" class="footnote-back"
role="doc-backlink">↩︎</a></p>
</div></li>
<li><div id="fn7">
<p>fig:we-feel-fine<a href="#fnref7" class="footnote-back"
role="doc-backlink">↩︎</a></p>
</div></li>
<li><div id="fn8">
<p>fig:tenbyten<a href="#fnref8" class="footnote-back"
role="doc-backlink">↩︎</a></p>
</div></li>
</ol>
</section>
<h2 id="πολυμεσική-διάδραση">Πολυμεσική διάδραση</h2>
<figure id="fig:pong">
<img src="../images/pong.jpg"
alt="Το Pong αποτελεί μια βελτιωμένη εκδοχή του πρόσφατου τότε Table Tennis for Two, στο οποίο προσθέτει καλύτερη κίνηση και γίνεται γρήγορα δημοφιλές αρχικά στις δημόσιες κονσόλες βιντεοπαιχνιδιών και λίγο αργότερα στους πρώτους οικιακούς μικροϋπολογιστές. Tο Pong με την σειρά του έδωσε την έμπνευση για την δημιουργία του Breakout και την δημιουργία μιας νέας κατηγορίας τέχνης και εμπορικής δραστηριότητας." />
<figcaption aria-hidden="true">Το Pong αποτελεί μια βελτιωμένη εκδοχή
του πρόσφατου τότε Table Tennis for Two, στο οποίο προσθέτει καλύτερη
κίνηση και γίνεται γρήγορα δημοφιλές αρχικά στις δημόσιες κονσόλες
βιντεοπαιχνιδιών και λίγο αργότερα στους πρώτους οικιακούς
μικροϋπολογιστές. Tο Pong με την σειρά του έδωσε την έμπνευση για την
δημιουργία του Breakout και την δημιουργία μιας νέας κατηγορίας τέχνης
και εμπορικής δραστηριότητας.</figcaption>
</figure>
<figure id="fig:breakout">
<img src="../images/breakout.png"
alt="Το βιντεοπαιχνίδι Breakout πήρε έμπνευση από το Pong που παίζεται με δύο παίκτες και στην θέση του δεύτερου παίκτη έβαλε σειρές από τουβλάκια που σπάνε καθώς ο παίκτης τα χτυπάει με την μπάλα. Εκτός από την διασκέδαση και έμπνευση που έδωσε για την δημιουργία υπολογιστών, αποτελεί σημείο αναφοράς για την μετάβαση από τα βιντεοπαιχνίδια προσομοίωσης της πραγματικότητας σε ένα περισσότερο αφαιρετικό νέο είδος τέχνης." />
<figcaption aria-hidden="true">Το βιντεοπαιχνίδι Breakout πήρε έμπνευση
από το Pong που παίζεται με δύο παίκτες και στην θέση του δεύτερου
παίκτη έβαλε σειρές από τουβλάκια που σπάνε καθώς ο παίκτης τα χτυπάει
με την μπάλα. Εκτός από την διασκέδαση και έμπνευση που έδωσε για την
δημιουργία υπολογιστών, αποτελεί σημείο αναφοράς για την μετάβαση από τα
βιντεοπαιχνίδια προσομοίωσης της πραγματικότητας σε ένα περισσότερο
αφαιρετικό νέο είδος τέχνης.</figcaption>
</figure>
<p>Η μετάβαση από τα τερματικά κειμένου σε τερματικά γραφικών και νέες
συσκευές εισόδου διευκολύνθηκε και εμπνεύστηκε από την παράλληλη πορεία
της κατασκευής βιντεοπαιχνιδιών. Η κατασκευή ενός καινοτόμου
βιντεοπαιχνιδιού βασίζεται στον προγραμματισμό διαδράσεων που
μετατρέπουν μια μορφή δεδομένων εισόδου σε κάποια διαφορετική μορφή
δεδομένων εξόδου. Για παράδειγμα, στο κλασικό βιντεοπαιχνίδι
επιτραπέζιας αντισφαίρισης οι χρήστες μετακινούν την ψηφιακή ρακέτα με
έναν μοχλό κατακόρυφης εισόδου. Ταυτόχρονα, τα πρώτα δημοφιλή
βιντεοπαιχνίδια που μοιράζονταν σε μορφή πηγαίου κώδικα έπαιξαν τον ρόλο
προδιαγραφών για την κατασκευή των επόμενων διαδραστικών συστημάτων. Για
παράδειγμα, η αντικατάσταση του ενός παίκτη στην επιτραπέζια
αντισφαίριση με έναν τοίχο από τουβλάκια δημιούργησε μια νέα κατηγορία
βιντεοπαιχνιδιών και κυρίως δημιούργησε τις προδιαγραφές για τον
σχεδιασμό του Apple II, <a href="#fn9" id="fnref9" class="footnote-ref"
role="doc-noteref"><sup>9</sup></a> <a href="#fn10" id="fnref10"
class="footnote-ref" role="doc-noteref"><sup>10</sup></a> έτσι ώστε να
μπορεί κάποιος να προγραμματίσει μια εκδοχή του βιντεοπαιχνιδιού στην
BASIC, το ίδιο δηλαδή σκεπτικό που είχε και ο Alan Kay για το Dynabook
και το Spacewar.</p>
<p>Το πλαίσιο της τυπολογίας των διαδράσεων που έχουν δημιουργηθεί μέχρι
τώρα μπορεί να εξηγηθεί από τις αντίστοιχες ανάγκες στα πρώτα στάδια
αυτής της περιοχής. Τα πρώτα βήματα του προγραμματισμού της διάδρασης
ανθρώπου και υπολογιστή έγιναν σε τερματικά κειμένου, ενώ ακόμη και τα
πρώτα γραφικά περιβάλλοντα, όπως η επιφάνεια εργασίας, έδιναν έμφαση
στις εφαρμογές γραφείου, ειδικά στην επεξεργασία κειμένου και αριθμών.
Το αποτέλεσμα ήταν να δημιουργηθούν, να βελτιωθούν, και να γίνουν
δημοφιλείς, εκείνες οι συσκευές εισόδου-εξόδου καθώς και εκείνα τα στυλ
διάδρασης που είχαν σχέση με κείμενο. Αντίθετα, τα γραφικά είχαν αρχικά
περισσότερο διακοσμητικό ρόλο ως εικονίδια και παράθυρα, τα οποία
σίγουρα διευκολύνουν τον αρχάριο χρήστη και προσελκύουν ειδικά τον νέο
χρήστη. Καθώς όμως έγιναν περισσότερο δημοφιλή τα πολυμεσικά συστήματα
(που δίνουν πρόσβαση σε δικτυακά υπερμέσα καθώς και σε εικόνα, βίντεο,
κείμενο, ήχο, και γραφικά), ο προγραμματισμός της διάδρασης επεκτάθηκε
για να καλύψει και αυτές τις περιοχές. <a href="#fn11" id="fnref11"
class="footnote-ref" role="doc-noteref"><sup>11</sup></a> <a
href="#fn12" id="fnref12" class="footnote-ref"
role="doc-noteref"><sup>12</sup></a> Με αυτόν τον τρόπο, ο
προγραμματισμός της διάδρασης μετατρέπεται πλέον στο αναγκαίο μέσο που
συνθέτει όλα τα επιμέρους στοιχεία για τη δημιουργία πληροφοριακών
συστημάτων μεγάλης κλίμακας, είτε λόγω του πλήθους των χρηστών είτε λόγω
του εύρους του πληροφοριακού περιεχομένου.</p>
<p>Ταυτόχρονα, τα συστήματα που επέτρεπαν τη διασύνδεση μεταξύ
περιεχομένου (ανεξάρτητα από το είδος του, π.χ., κείμενο, εικόνες κτλ.),
καθώς και εκείνα τα συστήματα που βασίζονταν σε πολλαπλά μέσα (στα οποία
το κείμενο είχε έναν ισότιμο ρόλο ανάμεσα σε βίντεο, φωτογραφίες,
γραφικά, και ήχο), έγιναν διαθέσιμα στους προσωπικούς υπολογιστές τη
δεκαετία του 1990, και σε δικτυακή μορφή από την δεκαετία του 2000. Το
αποτέλεσμα ήταν να δημιουργηθεί μια νέα σειρά από συστήματα εισόδου,
εξόδου, καθώς και νέα στυλ διάδρασης, ώστε να εξυπηρετηθούν οι νέες
ανάγκες των χρηστών, οι οποίες δημιουργήθηκαν από τη χρήση περιεχομένου
που βασίζεται στα υπερμέσα και στα πολυμέσα.<a href="#fn13" id="fnref13"
class="footnote-ref" role="doc-noteref"><sup>13</sup></a> Για
παράδειγμα, δημιουργήθηκαν οπτικές γλώσσες προγραμματισμού, οι οποίες
δεν ήταν απλά μια οπτικοποίηση των αντίστοιχων γραπτών γλωσσών
προγραμμτισμού. Οι πολυμεσικές οπτικές γλώσσες προγραμματισμού
επιτρέπουν την επεξεργασία πολυμεσικών δεδομένων με χρήση διαγραμμάτων
ροής και λειτουργούν είτε ετεροχρονισμένα, είτε σε πραγματικό χρόνο.
Ειδικά τα συστήματα πραγματικού χρόνου επιτρέπουν τον ζωντανό
προγραμματισμό πολυμεσικών έργων, έτσι που μοιάζουν περισσότερο με μια
καλιτεχνική παράσταση, παρά με την μηχανική λογισμικού. Με αυτόν τον
τρόπο ο προγραμματισμός της διάδρασης δεν είναι απλά η είσοδος κειμένου,
αλλά η είσοδος με οποιοδήποτε μέσο επικοινωνίας ταιριάζει στον χρήστη
και στο πεδίο χρήσης.</p>
<figure id="fig:rand-tablet">
<img src="../images/rand-tablet.jpg"
alt="Η πένα έχει το πλεονέκτημα σε σχέση με το ποντίκι ότι μπορεί να χρησιμοποιηθεί και ως συσκευή έμμεσης διάδρασης με την βοήθεια μιας επιφάνειας ευαίσθητης στην μύτη της πένας και χωρίς να υπάρχει η ανάγκη αυτή η επιφάνεια να είναι οθόνη." />
<figcaption aria-hidden="true">Η πένα έχει το πλεονέκτημα σε σχέση με το
ποντίκι ότι μπορεί να χρησιμοποιηθεί και ως συσκευή έμμεσης διάδρασης με
την βοήθεια μιας επιφάνειας ευαίσθητης στην μύτη της πένας και χωρίς να
υπάρχει η ανάγκη αυτή η επιφάνεια να είναι οθόνη.</figcaption>
</figure>
<figure id="fig:genesys">
<img src="../images/genesys.jpg"
alt="To σύστημα οπτικού προγραμματισμού Genesys απευθύνεται σε σχεδιαστές γραφικών κίνησης, οπότε βασίζεται στην οικεία για αυτούς πένα και σε λογισμικό σχεδίασης αντικειμένων. Παρουσιάζει καινοτόμες λειτουργίες διάδρασης, όπως είναι η χειρονομία για την σχεδίαση μια τροχιάς κίνησης, όπου εκτός από την ίδια την τροχιά καταγράφεται και ο ρυθμός." />
<figcaption aria-hidden="true">To σύστημα οπτικού προγραμματισμού
Genesys απευθύνεται σε σχεδιαστές γραφικών κίνησης, οπότε βασίζεται στην
οικεία για αυτούς πένα και σε λογισμικό σχεδίασης αντικειμένων.
Παρουσιάζει καινοτόμες λειτουργίες διάδρασης, όπως είναι η χειρονομία
για την σχεδίαση μια τροχιάς κίνησης, όπου εκτός από την ίδια την τροχιά
καταγράφεται και ο ρυθμός.</figcaption>
</figure>
<p>Στο τεχνολογικό πεδίο η αναφορά στα πολυμέσα (multimedia) είναι
συνήθως συνώνυμη με την τεχνολογική ολοκλήρωση διαφορετικών μορφών
επικοινωνίας (κείμενο, εικόνα, ήχος, βίντεο, κτλ.). Όμως, τα πολυμέσα
περιέχουν ακόμη περισσότερα στοιχεία, όπως είναι τα υπερμέσα
(hypermedia), η διάδραση, η συμμετοχή των χρηστών στην παραγωγή του
περιεχομένου, η αφηγηματικότητα και η εμβύθιση. Στην προσπάθεια για
μεγιστοποίηση της εμβύθισης, οι προγραμματιστές της διάδρασης
χρησιμοποιούν φωτορεαλιστικά γραφικά καθώς και νέες συσκευές εισόδου και
εξόδου, όπως είναι τα συστήματα εικονικής πραγματικότητας. Σύμφωνα με
τον Ted Nelson ο όρος υπερμέσα περιγράφει με συνοπτικό τρόπο τον
συνδυασμό των πολυμέσων με τη διάδραση, ο οποίος δίνει τη δυνατότητα για
συμμετοχή, μη γραμμική αφήγηση, και μεγαλύτερη εμβύθιση. Ειδικά για την
ενίσχυση της εμβύθισης του χρήστη σε ένα ψηφιακό περιβάλλον, το οποίο
δημιουργεί δυναμικά ο υπολογιστής, έχουν κατασκευαστεί μια σειρά από
νέες συσκευές εισόδου (π.χ., χειριστήρια αεροσκάφους, αυτοκινήτου) και
συσκευές εξόδου, όπως μάσκες εικονικής πραγματικότητας. Η μεγάλη
υπόσχεση που δίνουν τα συστήματα εικονικής πραγματικότητας είναι ότι στο
μέλλον δε θα χρειάζεται να έχουμε διαφορετικές τεχνητές διεπαφές για τη
διάδραση μέσω του υπολογιστή, αφού αυτές θα μοιάζουν με τις διεπαφές που
έχουμε για τη διάδραση με τους ανθρώπους και το φυσικό μας περιβάλλον.
<a href="#fn14" id="fnref14" class="footnote-ref"
role="doc-noteref"><sup>14</sup></a> <a href="#fn15" id="fnref15"
class="footnote-ref" role="doc-noteref"><sup>15</sup></a> <a
href="#fn16" id="fnref16" class="footnote-ref"
role="doc-noteref"><sup>16</sup></a></p>
<p>Ο προγραμματισμός της διάδρασης ήταν αρχικά μια δουλειά μόνο για
εξειδικευμένο προσωπικό σε ερευνητικά εργαστήρια και εταιρείες υψηλής
τεχνολογίας. Σύμφωνα με αυτήν την αυστηρά ιεραρχική και γραμμική
αντίληψη της σχεδίασης, το αποτέλεσμα της εργασίας μιας μικρής αλλά
εξειδικευμένης ομάδας σχεδιαστών της τεχνολογίας γινόταν προϊόν για τους
πολλούς χρήστες. Αυτή η προσέγγιση χρησιμοποιείται με επιτυχία για πολλά
χρόνια από εταιρείες όπως η Apple, η οποία δοκιμάζει εσωτερικά πολλές
εκδοχές για ένα προϊόν και μετά την αρχική παραγωγή του φροντίζει να το
αναβαθμίζει σταδιακά. Άλλες εταιρείες όπως η Microsoft χρησιμοποιούν
πολλούς χρήστες κατά τη διαδικασία σχεδίασης και ανάπτυξης, είτε για να
κάνουν αξιολόγηση είτε απλά για να ακούσουν τη γνώμη τους. Από την άλλη
πλευρά, υπάρχουν εφαρμογές με μια εντελώς μη γραμμική και μη ιεραρχική
αντίληψη της σχεδίασης, οι οποίες αφήνουν ακόμη μεγαλύτερο περιθώριο
στους χρήστες για να επεξεργαστούν απευθείας την εμφάνιση και τη
λειτουργία τους, όπως για παράδειγμα το Winamp, ένα δημοφιλές λογισμικό
αναπαραγωγής μουσικών αρχείων κατά τα τέλη της δεκαετίας του 1990. Το
Winamp έγινε γνωστό όχι τόσο επειδή είχε κάποιο λειτουργικό πλεονέκτημα
έναντι του ανταγωνισμού (που ήταν πολύ έντονος, καθώς οι κατασκευαστές
λειτουργικών συστημάτων έβαζαν δωρεάν το δικό τους λογισμικό σε κάθε νέα
εγκατάσταση, όπως π.χ. το Windows Media Player), όσο επειδή είχε μια
μεγάλη συλλογή από μορφές και οπτικοποιήσεις, τις οποίες έφτιαχναν και
διαμοίραζαν μεταξύ τους πολλοί από τους τελικούς χρήστες, χωρίς κάποιον
κεντρικό έλεγχο από τον αρχικό κατασκευαστή.</p>
<figure id="fig:superpaint-setup">
<img src="../images/superpaint-setup.jpg"
alt="Η αρχική υλοποίηση του προγράμματος ψηφιακής επεξεργασίας εικόνας Superpaint έγινε σε γλώσσα μηχανής στον μίνι υπολογιστή Data General Nova, ο οποίος ήταν συνδεμένος με επιπλέον υλικό για την ψηφιοποίηση αναλογικού βίντεο καθώς και για την είσοδο και έξοδο του προγράμματος ψηφιακής ζωγραφικής. Η προβολή των εικόνων γινόταν σε μια αναλογική οθόνη τηλεόρασης, ενώ για την επεξεργασία της εικόνας η βασική συσκευή εισόδου ήταν μια πένα έμμεσης διάδρασης. Η τεχνολογία αυτή αναπτύχθηκε παράλληλα με τα γραφικά περιβάλλοντα και οδήγησε σε εφαρμογές ψηφιακής τέχνης και ψηφιακής κινηματογραφίας." />
<figcaption aria-hidden="true">Η αρχική υλοποίηση του προγράμματος
ψηφιακής επεξεργασίας εικόνας Superpaint έγινε σε γλώσσα μηχανής στον
μίνι υπολογιστή Data General Nova, ο οποίος ήταν συνδεμένος με επιπλέον
υλικό για την ψηφιοποίηση αναλογικού βίντεο καθώς και για την είσοδο και
έξοδο του προγράμματος ψηφιακής ζωγραφικής. Η προβολή των εικόνων
γινόταν σε μια αναλογική οθόνη τηλεόρασης, ενώ για την επεξεργασία της
εικόνας η βασική συσκευή εισόδου ήταν μια πένα έμμεσης διάδρασης. Η
τεχνολογία αυτή αναπτύχθηκε παράλληλα με τα γραφικά περιβάλλοντα και
οδήγησε σε εφαρμογές ψηφιακής τέχνης και ψηφιακής
κινηματογραφίας.</figcaption>
</figure>
<figure id="fig:dataland">
<img src="../images/dataland.jpg"
alt="Στο ερευνητικό έργο Spatial Data Management System η πλοήγηση σε πολυμεσική πληροφορία μπορεί να γίνει με μια μεταφορά που βασίζεται στην πλοήγηση στο φυσικό περιβάλλον με την προσθήκη της δυνατότητας μεγέθυνσης και μιας ιεαραρχικής οργάνωσης των δεδομένων. Ο χρήστης πλοηγείται με τα ενσωματωμένα σε μια καρέκλα χειριστήρια και χρησιμοποιεί συμπληρωματικές οθόνες, οι οποίες μπορούν να μεγενθύνουν και να εφαρμόσουν εργαλεία πάνω στα πολυμεσικά δεδομένα." />
<figcaption aria-hidden="true">Στο ερευνητικό έργο Spatial Data
Management System η πλοήγηση σε πολυμεσική πληροφορία μπορεί να γίνει με
μια μεταφορά που βασίζεται στην πλοήγηση στο φυσικό περιβάλλον με την
προσθήκη της δυνατότητας μεγέθυνσης και μιας ιεαραρχικής οργάνωσης των
δεδομένων. Ο χρήστης πλοηγείται με τα ενσωματωμένα σε μια καρέκλα
χειριστήρια και χρησιμοποιεί συμπληρωματικές οθόνες, οι οποίες μπορούν
να μεγενθύνουν και να εφαρμόσουν εργαλεία πάνω στα πολυμεσικά
δεδομένα.</figcaption>
</figure>
<p>Από την άλλη πλευρά, ο οπτικός προγραμματισμός μπορεί να λειτουργεί
και ως μια μεταφορά για τις σχετικά λιγότερο ελκυστικές, βασικές
έννοιες, όπως είναι ο έλεγχος ροής και η επανάληψη. Όπως ακριβώς στο
παρελθόν αρχικά η γλώσσα Assembly επέτρεψε σε περισσότερους να
προγραμματίσουν σε μια γλώσσα που έμοιαζε έστω και λίγο με τη φυσική
γλώσσα, και έπειτα οι γλώσσες υψηλού επιπέδου (π.χ., Cobol, C, Pascal,
κτλ.) έφυγαν από τις λεπτομέρειες της αρχιτεκτονικής του υλικού του κάθε
υπολογιστή που επέβαλε η Assembly, έτσι και ο οπτικός προγραμματισμός
έδωσε τη δυνατότητα σε ακόμη περισσότερους να μιλήσουν μια γλώσσα
κατανοητή μεν από τον υπολογιστή, αλλά και πλησιέστερη στην ανθρώπινη
λογική. Ο οπτικός προγραμματισμός έδωσε τη δυνατότητα ακόμη και στις
μικρές ηλικίες να δημιουργήσουν παιχνίδια με εργαλεία όπως το MIT
Scratch.</p>
<p>Ο οπτικός προγραμματισμός είναι μια αναγκαία προϋπόθεση για τον
γρήγορο και εύκολο προγραμματισμό της διάδρασης, αλλά δεν είναι και
ικανή συνθήκη της κατασκευής ενός πετυχημένου συστήματος διάδρασης.
Υπάρχει η ανάγκη να βλέπουμε ταυτόχρονα με την κατασκευή και τη
συμπεριφορά του προγράμματος (και όχι μόνο τη στατική του κατάσταση όπως
μας την παρουσιάζει ο πηγαίος κώδικας). Σε αναλογία με τον μαθηματικό
συμβολισμό για την κίνηση του απλού εκκρεμούς, ο πηγαίος κώδικας είναι
μεν πολύ ευέλικτος, αλλά δεν επιτρέπει την άμεση κατανόηση κατά τις
διάφορες φάσεις της εκτέλεσης του προγράμματος. Η γρήγορη δοκιμή και η
επαναληπτική βελτίωση του προγράμματος διάδρασης διευκολύνεται από
εκείνα τα περιβάλλοντα ανάπτυξης που ενθαρρύνουν την προσομοίωση της
εκτέλεσης του προγράμματος και τον διαδραστικό έλεγχο της συμπεριφοράς
του. Σε αυτήν την κατεύθυνση, υπάρχουν ερευνητικά και πειραματικά
περιβάλλοντα που βασίζονται στον πολυτροπικό και στον ζωντανό
προγραμματισμό, έτσι ώστε ο σχεδιαστής να μπορεί να εξερευνήσει σε
πραγματικό χρόνο διαφορετικές συμπεριφορές με πολλούς τρόπους.</p>
<section id="footnotes" class="footnotes footnotes-end-of-section"
role="doc-endnotes">
<hr />
<ol start="9">
<li><div id="fn9">
<p>fig:pong<a href="#fnref9" class="footnote-back"
role="doc-backlink">↩︎</a></p>
</div></li>
<li><div id="fn10">
<p>fig:breakout<a href="#fnref10" class="footnote-back"
role="doc-backlink">↩︎</a></p>
</div></li>
<li><div id="fn11">
<p>fig:rand-tablet<a href="#fnref11" class="footnote-back"
role="doc-backlink">↩︎</a></p>
</div></li>
<li><div id="fn12">
<p>fig:genesys<a href="#fnref12" class="footnote-back"
role="doc-backlink">↩︎</a></p>
</div></li>
<li><div id="fn13">
<p><span class="citation" data-cites="garrett2010elements">Garrett
(2010)</span><a href="#fnref13" class="footnote-back"
role="doc-backlink">↩︎</a></p>
</div></li>
<li><div id="fn14">
<p><span class="citation" data-cites="bolt1978spatial">Bolt
(1978)</span><a href="#fnref14" class="footnote-back"
role="doc-backlink">↩︎</a></p>
</div></li>
<li><div id="fn15">
<p>fig:superpaint-setup<a href="#fnref15" class="footnote-back"
role="doc-backlink">↩︎</a></p>
</div></li>
<li><div id="fn16">
<p>fig:dataland<a href="#fnref16" class="footnote-back"
role="doc-backlink">↩︎</a></p>
</div></li>
</ol>
</section>
<h2 id="ομάδες-και-οργανισμοί">Ομάδες και οργανισμοί</h2>
<p>Η ευρύτερη περιοχή της διάδρασης ανθρώπου και υπολογιστή ξεκίνησε και
εξακολουθεί να αναπτύσσεται δίνοντας έμφαση στον διάλογο ανάμεσα σε έναν
άνθρωπο και έναν ΗΥ. Στην πορεία έχουν δημιουργηθεί νέες υποπεριοχές, οι
οποίες αναπτύσσονται τουλάχιστον το ίδιο γρήγορα, που μελετούν ζητήματα
όπως η επικοινωνία, η συνεργασία και η οργάνωση μικρότερων ή μεγαλύτερων
ομάδων ανθρώπων.<a href="#fn17" id="fnref17" class="footnote-ref"
role="doc-noteref"><sup>17</sup></a> Ειδικότερα, η ανάπτυξη μιας από
αυτές, της περιοχής των κοινωνικών και συνεργατικών συστημάτων,<a
href="#fn18" id="fnref18" class="footnote-ref"
role="doc-noteref"><sup>18</sup></a> σηματοδοτεί τη μετατόπιση του
ενδιαφέροντος από την απλή διάδραση ανθρώπου και υπολογιστή και τον ΗΥ
ως απλό εργαλείο επίλυσης προβλημάτων, στον ΗΥ ως μέσο επικοινωνίας που
διευκολύνει τη διάδραση ανάμεσα στους ανθρώπους.</p>
<p>Εκ των πραγμάτων, αυτές οι πολύ δημοφιλείς υποπεριοχές της διάδρασης,
λόγω του ανθρωποκεντρικού τους χαρακτήρα αντλούν ερευνητικά δεδομένα και
από τις ανθρωπιστικές επιστήμες. Εκτός από την επιστήμη της ψυχολογίας
και τη γνωστική επιστήμη, βασίζονται επίσης στην κοινωνιολογία, την
επικοινωνία και την οργάνωση επιχειρήσεων. Επιπλέον, οι νέες αυτές
περιοχές προσαρμόζουν και χρησιμοποιούν μεθόδους και τεχνικές έρευνας
που έχουν αναπτυχθεί στις ανθρωπιστικές επιστήμες, για να μελετήσουν και
να σχεδιάσουν νέα διαδραστικά φαινόμενα, όπως είναι η συνεργασία και η
επικοινωνία ομάδων ανθρώπων μέσω ΗΥ, τόσο στο γραφείο, όσο και στις νέες
μορφές ΗΥ, στον κινητό και διάχυτο υπολογισμό.</p>
<p>Αν έπρεπε να διαλέξουμε μία μόνο συνεισφορά των συνεργατικών
συστημάτων στην κατανόηση του προγραμματισμού της διάδρασης, τότε αυτή
θα ήταν η ταξινόμηση των εφαρμογών σε δύο διαστάσεις: στον χώρο και στον
χρόνο. <a href="#fn19" id="fnref19" class="footnote-ref"
role="doc-noteref"><sup>19</sup></a> <a href="#fn20" id="fnref20"
class="footnote-ref" role="doc-noteref"><sup>20</sup></a> Στην διάσταση
του χώρου, τα δύο άκρα της κλίμακας ορίζονται από τη δια ζώσης και την
εξ’ αποστάσεως επικοινωνία, ενώ στη διάσταση του χρόνου, τα δύο άκρα της
κλίμακας ορίζονται από τη σύγχρονη και την ασύγχρονη επικοινωνία. Για
παράδειγμα, το email είναι μια μορφή ασύγχρονης επικοινωνίας εξ’
αποστάσεως, ενώ το chat είναι μια σύγχρονη επικοινωνία εξ’ αποστάσεως.
Στις παραπάνω βασικές διαστάσεις (σύγχρονης / ασύγχρονης και δια ζώσης /
εξ’ αποστάσεως), μπορούμε να προσθέσουμε επίσης τη διάσταση της λεκτικής
και μη-λεκτικής επικοινωνίας, η οποία έχει γίνει πολύ δημοφιλής με τα
εικονίδια emoticons. Το κείμενο, ο ήχος, και το βίντεο ανήκουν τόσο στα
παραδοσιακά μέσα επικοινωνίας όσο και στη διαμεσολαβούμενη από
υπολογιστή επικοινωνία, ο ΗΥ όμως πρόσθεσε και νέες εκφράσεις, όπως π.χ.
τη μη λεκτική επικοινωνία με τα emoticons, τα οποία αρχικά σχηματίζονταν
μόνο με τη χρήση συμβόλων κειμένου.</p>
<p>Όλες οι γνώσεις και οι τεχνικές για τον προγραμματισμό της διάδρασης
μεταξύ ανθρώπου και υπολογιστή ισχύουν αναφορικά με τον συνεργατικό
παράγοντα καθώς και με το τεχνολογικό δίκτυο επικοινωνίας των ΗΥ.
Επιπλέον, πρέπει να σχεδιάσουμε και να αναλύσουμε αυτά τα συστήματα
λαμβάνοντας υπόψη τα παραπάνω. Επομένως, η κατασκευή αυτών των
συστημάτων είναι περισσότερο δύσκολη από τη βασική περίπτωση όπου έχουμε
έναν άνθρωπο και έναν υπολογιστή, αλλά αποτελεί και μια
δημιουργική-επιχειρηματική πρόκληση, όπως δείχνει το φαινόμενο της
μαζικής αποδοχής των κοινωνικών δικτύων. Το εύρος των συνεργατικών
συστημάτων καλύπτει τεχνολογίες όπως οι εικονικοί κόσμοι, τα δικτυακά
βίντεοπαιχνίδια, η τηλεδιάσκεψη, η ανταλλαγή αρχείων, οι οποίες έχουν
πολλές εφαρμογές τόσο στην εργασία, όσο και στην εκπαίδευση, στην
ψυχαγωγία και στην καθημερινότητα. Συνολικά, με τη μεσολάβηση του
υπολογιστή, όχι μόνο ως προσωπικού εργαλείου αλλά και ως μέσου
επικοινωνίας και συνεργασίας με άλλους χρήστες, ενθαρρύνεται ο
διαμοιρασμός της γνώσης, των ικανοτήτων και των ιδεών. Τα μέλη μιας
ομάδας μπορούν να συζητήσουν και να συνεισφέρουν με μοναδικές απόψεις σε
ένα πρόβλημα, συνθέτοντας από κοινού μια λύση που δε θα μπορούσαν να
δώσουν ατομικά ούτε τα ικανότερα μέλη της ομάδας, αφού ακόμη και οι πιο
μικρές προσθήκες μπορεί να δώσουν αξία στις αρχικές προτάσεις.</p>
<p>Μια πολύ σημαντική εφαρμογή των υπολογιστών έχει να κάνει με τη
διευκόλυνση της επικοινωνίας και της συνεργασίας μικρών ομάδων ανθρώπων.
Για να κατασκευάσουμε ένα σύστημα που θα υποστηρίζει την εργασία σε
ομάδες, θα πρέπει να κατανοήσουμε τον ρόλο του κάθε μέλους της ομάδας
στις κοινές διεργασίες. Αν και η σημασία της κοινωνικής διάστασης της
συνεργασίας ήταν ήδη γνωστή σε συναφείς ερευνητικές περιοχές όπως τα
πληροφοριακά συστήματα διοίκησης (Management Information Systems) και η
οργανωσιακή συμπεριφορά, η εξειδικευμένη περιοχή των κοινωνικών και
συνεργατικών συστημάτων (Social &amp; Collaborative Systems)
δημιουργήθηκε στα τέλη της δεκαετίας του 1980. Αρχικά, οι ερευνητές
ασχολήθηκαν με τις ανάγκες που προκύπτουν κατά τη συνεργασία στον χώρο
της εργασίας με επιτραπέζιους υπολογιστές και ενσύρματα δίκτυα. Στη
συνέχεια, το ενδιαφέρον τους στράφηκε προς τον κινητό υπολογισμό, τα
κοινωνικά δίκτυα, και τα δικτυακά βιντεο-παιχνίδια ρόλων. Τέλος, πρέπει
να τονιστεί ότι οι εφαρμογές αυτής της περιοχής δεν περιορίζονται πλέον
στο πεδίο της εργασίας, αλλά έχουν επεκταθεί σε πολλά ακόμη σημαντικά
πεδία κοινωνικής δραστηριότητας, όπως αυτό της εκπαίδευσης.</p>
<p>Η θεωρία για τη διάδραση ανθρώπου και υπολογιστή εμφανίζεται με
διαφορετικές μορφές σε πολλές διαφορετικές περιοχές, οι οποίες έχουν
σχετικά διαφορετικούς στόχους (goals, objectives). Για παράδειγμα, η
Εργονομία έχει εστιάσει κυρίως στις σωματικές εργασίες των ανθρώπων που
δουλεύουν με βιομηχανικές μηχανές ή ρομπότ, στην είσοδο δεδομένων και
στον χειρισμό εξοπλισμού ασφαλείας (π.χ., σε αεροσκάφη και πλοία, σε
συστήματα ενέργειας, κτλ.). Από την άλλη πλευρά, η περιοχή των
Πληροφοριακών Συστημάτων Διοίκησης λειτουργεί σε μεγαλύτερη κλίμακα,
εκεί όπου πολλοί άνθρωποι συνεργάζονται ως μέλη επιμέρους ομάδων για να
πάρουν αποφάσεις και να πετύχουν κοινούς στόχους, στα πλαίσια ενός ή
περισσότερων διασυνδεδεμένων οργανισμών και ιεραρχικών δομών αποφάσεων.
Ανάμεσα στα δύο άκρα της κλίμακας της διάδρασης (άνθρωπος-υπολογιστής
και οργανισμός που συντονίζει ομάδες ανθρώπων) βρίσκεται η σχετικά
νεότερη περιοχή των Κοινωνικών και Συνεργατικών Συστημάτων. Εκεί η
διάδραση συμβαίνει ανάμεσα στα μέλη μιας μικρής ομάδας ανθρώπων, η οποία
συντονίζεται με τη βοήθεια υπολογιστών. Φυσικά, ο διαχωρισμός ανάμεσα
στις παραπάνω περιοχές δεν είναι στεγανός και παρατηρούνται αρκετές
επικαλύψεις, όπως για παράδειγμα σε θέματα ιδιωτικότητας.</p>
<p>Αν και υπάρχει μια μικρή επικάλυψη της περιοχής των Συνεργατικών
Συστημάτων με το αντικείμενο μελέτης των Πληροφοριακών Συστημάτων
Διοίκησης, τα Συνεργατικά Συστήματα συνήθως δεν έχουν να κάνουν με τα
φαινόμενα μεγάλης κλίμακας που συμβαίνουν σε οργανισμούς και μεγάλες
ομάδες. Η ανάπτυξη και η μελέτη των συνεργατικών συστημάτων σε μεγάλη
κλίμακα αφορά κυρίως τον συντονισμό των χρηστών που συνεργάζονται εξ
αποστάσεως. Η ανάπτυξη του λογισμικού ανοικτού κώδικα ήταν μια από τις
πρώτες περιπτώσεις όπου μελετήθηκε η συνεργασία ομάδων σε μεγάλη κλίμακα
μέσω της τεχνολογίας, αλλά σίγουρα δεν είναι η μοναδική περίπτωση πλέον,
αφού υπάρχουν πολλά σύνθετα κοινωνικά και τεχνολογικά συστήματα που
λειτουργούν με παρόμοιο τρόπο, όπως για παράδειγμα η ανάπτυξη της
εγκυκλοπαίδειας Wikipedia, των χαρτών του OpenStreetMap, της
ψηφιοποίησης βιβλίων, κ.ά. Επομένως, στην ανάπτυξη των πληροφοριακών
συστημάτων εστιάζουμε στον προγραμματισμό της διάδρασης σε μεγάλη
κλίμακα με τη συμμετοχή πολλών χρηστών. Για παράδειγμα, ακόμη και ένας
απλός επεξεργαστής κειμένου που απευθύνεται κυρίως σε έναν χρήστη μπορεί
να προσθέσει λειτουργικότητα μεγάλης κλίμακας, αν παρέχει συντονισμό με
άλλους χρήστες, οι οποίοι θα κάνουν έλεγχο του κειμένου ή μετάφραση σε
άλλες γλώσσες.</p>
<figure id="fig:time-space-cscw">
<img src="../images/time-space-cscw.jpg"
alt="Η ταξινόμηση των εφαρμογών στον χώρο (δια ζώσης ή από απόσταση) και στον χρόνο (σύγχρονη ή ασύγχρονη) επιτρέπει την εύκολη ταξινόμηση των κοινωνικών και συνεργατικών εφαρμογών και των λειτουργιών τους. Επίσης, επιτρέπει τον εντοπισμό ευκαιριών για την δημιουργία νέων τύπων συστήματος." />
<figcaption aria-hidden="true">Η ταξινόμηση των εφαρμογών στον χώρο (δια
ζώσης ή από απόσταση) και στον χρόνο (σύγχρονη ή ασύγχρονη) επιτρέπει
την εύκολη ταξινόμηση των κοινωνικών και συνεργατικών εφαρμογών και των
λειτουργιών τους. Επίσης, επιτρέπει τον εντοπισμό ευκαιριών για την
δημιουργία νέων τύπων συστήματος.</figcaption>
</figure>
<figure id="fig:social-reviews">
<img src="../images/social-reviews.jpg"
alt="Τα δημοφιλή δικτυακά καταστήματα βασίζονται στις αξιολογήσεις των προϊόντων και των προμηθευτών τους τις οποίες κάνουν οι ίδιοι οι χρήστες και λιγότερο στην προσπάθεια να διαλέξουν μετά από κόπο μια σειρά προϊόντων που οι πελάτες τους θα βρουν σίγουρα αξιόπιστα." />
<figcaption aria-hidden="true">Τα δημοφιλή δικτυακά καταστήματα
βασίζονται στις αξιολογήσεις των προϊόντων και των προμηθευτών τους τις
οποίες κάνουν οι ίδιοι οι χρήστες και λιγότερο στην προσπάθεια να
διαλέξουν μετά από κόπο μια σειρά προϊόντων που οι πελάτες τους θα βρουν
σίγουρα αξιόπιστα.</figcaption>
</figure>
<p>Τα πληροφοριακά συστήματα διοίκησης ξεκίνησαν τη δεκαετία του 1970 ως
μια εκδοχή εφαρμοσμένης επιστήμης των υπολογιστών, αλλά στην πορεία
εξελίχθηκαν σε μια εκδοχή κοινωνικής επιστήμης με έμφαση στην εργασία
και στην οικονομική δραστηριότητα μέσω υπολογιστή. Ο βασικός πυλώνας
διαφοροποίησης αυτής της περιοχής από άλλες είναι η έμφαση σε
επιχειρήσεις και σε διοίκηση πόρων. Από τη στιγμή που η απευθείας
διάδραση με υπολογιστές εξαπλώθηκε σε ανθρώπινες δραστηριότητες πέρα από
την εργασία, τα πληροφοριακά συστήματα διοίκησης άρχισαν να
ενδιαφέρονται περισσότερο για τη διάδραση ανθρώπου και υπολογιστή, και
κυρίως για τα κοινωνικά και συνεργατικά συστήματα. Για παράδειγμα, η
άνοδος του ηλεκτρονικού εμπορίου και γενικότερα των ηλεκτρονικών
συναλλαγών επιβάλλει μια καλύτερη κατανόηση των επιμέρους κανόνων που
καθορίζουν τη διάδραση ενός ανθρώπου με έναν υπολογιστή, και ειδικά για
την περίπτωση του εμπορίου με το ηλεκτρονικό καλάθι, επιβάλλεται η
καταγραφή αξιολογήσεων για προϊόντα και η μέτρηση της αξιοπιστίας των
πωλητών όταν αυτοί είναι απλοί χρήστες. Αντίστοιχα, η καθιέρωση της
ηλεκτρονικής συνεργασίας των ανθρώπων (ακόμα και όταν αυτοί βρίσκονται
στο ίδιο δωμάτιο, πόσο μάλλον όταν βρίσκονται σε μεγάλες αποστάσεις),
επέβαλε την ενασχόληση με τα Κοινωνικά και Συνεργατικά Συστήματα, τα
οποία έχουν μελετήσει το φαινόμενο της επικοινωνίας των ανθρώπων μέσω
υπολογιστή στην κλίμακα της μικρής ομάδας.</p>
<p>Τα Πληροφοριακά Συστήματα Διοίκησης είναι μια συγγενής περιοχή των
Συνεργατικών Συστημάτων, αφού και στις δύο περιπτώσεις η μελέτη εστιάζει
σε ομάδες ανθρώπων και σε εργασία με τον υπολογιστή. Από την άλλη
πλευρά, οι δύο αυτές περιοχές έχουν περισσότερες διαφορές παρά
ομοιότητες, τουλάχιστον αναφορικά με την κλίμακα και το είδος των
φαινομένων που μελετούν. Τα πληροφοριακά συστήματα διοίκησης έχουν ως
αντικείμενο μελέτης μεγάλες ομάδες εργασίας και οργανισμούς, ενώ ο ρόλος
του υπολογιστή και του λογισμικού είναι συμπληρωματικός και σε καμία
περίπτωση ισάξιος με τον ρόλο των ανθρώπων και των ομάδων εργασίας.
Αντίθετα, τα συνεργατικά συστήματα εστιάζουν στην ομάδα εργασίας
ανθρώπων και υπολογιστών σε μικρή κλίμακα και έχουν μεγαλύτερο
ενδιαφέρον για την κατασκευή και χρήση του λογισμικού διάδρασης. Για
παράδειγμα, είναι χαρακτηριστικό ότι ο όρος “υλοποίηση” στην περίπτωση
των πληροφοριακών συστημάτων διοίκησης χρησιμοποιείται με αναφορά στην
εισαγωγή κάποιου λογισμικού στον οργανισμό και όχι με αναφορά στην
κατασκευή του. Ακόμη, τα μεν πρώτα εστιάζουν περισσότερο στις επιπτώσεις
σε οικονομικές μετρικές του οργανισμού, ενώ τα δεύτερα σε μετρικές που
επηρεάζουν την σχεδίαση του λογισμικού.</p>
<p>Αν και γίνεται μεγάλη προσπάθεια για πάρα πολλές δεκαετίες να
δημιουργηθεί ένας υπολογιστής με τεχνητή νοημοσύνη παρόμοια με του
ανθρώπου, στην πράξη τα καλύτερα αποτελέσματα και σε πολύ μικρότερο
χρόνο τα έχουμε πετύχει όταν μεγάλες ομάδες ανθρώπων συνεργάζονται με
έμμεσο τρόπο για να λύσουν ένα δύσκολο πρόβλημα.<a href="#fn21"
id="fnref21" class="footnote-ref" role="doc-noteref"><sup>21</sup></a>
Σε ένα πρόσφατο παράδειγμα, το σύστημα Captcha χρησιμοποιείται σε πρώτο
επίπεδο για να διασφαλίσει ότι ο χρήστης είναι άνθρωπος και όχι
υπολογιστής, αλλά στην πράξη η αναγνώριση του κειμένου χρησιμοποιείται
σε ένα δεύτερο επίπεδο για την ψηφιοποίηση βιβλίων. Ομοίως, η αναγνώριση
αντικειμένων μέσα σε μια φωτογραφία μπορεί να γίνει αν έχουμε δύο
ανθρώπους να ανταγωνίζονται ποιος θα αναγνωρίσει τα πιο πολλά
αντικείμενα μέσα σε μια φωτογραφία με αποτέλεσμα την καταγραφή αυτών των
αντικειμένων στα οποία δύο ή περισσότερα ζευγάρια χρηστών συμφωνούν.
Βλέπουμε λοιπόν, ότι μια χρήσιμη κατεύθυνση -συμπληρωματική της
προσπάθειας για αυτόνομη τεχνητή νοημοσύνη- είναι η προσπάθεια να
οργανώσουμε και να καταμερίσουμε σε πολλούς ανθρώπους δύσκολα προβλήματα
με τρόπο ευχάριστο ή τουλάχιστον έμμεσο. <a href="#fn22" id="fnref22"
class="footnote-ref" role="doc-noteref"><sup>22</sup></a> Ο
προγραμματισμός της διάδρασης αυτών των συστημάτων είναι ένα σημαντικό
κεφάλαιο στα συστήματα συνεργασίας μεγάλης κλίμακας.</p>
<p>Τα ψηφιακά προϊόντα αρχικά αναπτύσσονταν μόνο από μεγάλες εταιρείες,
γιατί μόνο αυτές είχαν τους αντίστοιχους πόρους (π.χ., οικονομικούς,
ανθρώπινους, τεχνογνωσία), αλλά σταδιακά η καινοτομία πέρασε και στις
μικρότερες εταιρείες, ενώ πλέον ακόμη και η χρηματοδότηση μπορεί να
γίνει από το πλήθος (πληθοπορισμός), όπως στην περίπτωση του έξυπνου
ρολογιού pebble που κατασκευάστηκε μόνο από έναν σχεδιαστή, ο οποίος
όμως φρόντισε να κάνει τον κατάλληλο καταμερισμό της εργασίας, και
κυρίως τον καταμερισμό της ανάγκης χρηματοδότησης. Το μοντέλο του
πληθοπορισμού της χρηματοδότησης για νέα προϊόντα έχει εφαρμοστεί επίσης
με επιτυχία στην περίπτωση της παραγωγής ψυχαγωγικού περιεχομένου. Το
βασικό πλεονέκτημα που έχει το μοντέλο της χρηματοδότησης μέσω του
πληθοπορισμού είναι ότι παρέχει μια πολύ γρήγορη ανάδραση για το
πραγματικό ενδιαφέρον των χρηστών να αγοράσουν, οπότε αν αυτό είναι
μικρό μεταφράζεται σε μη-χρηματοδότηση, άρα ο δημιουργός μπορεί να
περάσει γρήγορα στην επόμενη ιδέα. <a href="#fn23" id="fnref23"
class="footnote-ref" role="doc-noteref"><sup>23</sup></a></p>
<figure id="fig:crowdsourcing">
<img src="../images/crowdsourcing.jpg"
alt="Η διάδραση σε μεγάλη κλίμακα μπορεί να χρησιμοποιηθεί για να λύσει δύσκολα προβλήματα τα οποία οι υπολογιστές δεν μπορούν να τα αντιμετωπίσουν από μόνοι τους, όπως είναι η αναγνώριση αντικειμένων σε μια φωτογραφία." />
<figcaption aria-hidden="true">Η διάδραση σε μεγάλη κλίμακα μπορεί να
χρησιμοποιηθεί για να λύσει δύσκολα προβλήματα τα οποία οι υπολογιστές
δεν μπορούν να τα αντιμετωπίσουν από μόνοι τους, όπως είναι η αναγνώριση
αντικειμένων σε μια φωτογραφία.</figcaption>
</figure>
<figure id="fig:kickstarter-pebble">
<img src="../images/kickstarter-pebble.png"
alt="Το έξυπνο ρολόι pebble κατάφερε να πουλήσει το πρώτο εκατομμύριο κομμάτια το ίδιο γρήγορα με το πρώτο Apple iPod, με την διαφορά ότι το pebble σχεδιάστηκε από μια μικρή ομάδα και χρηματοδοτήθηκε από χιλιάδες δυνητικούς χρήστες, και όχι από επενδυτές που έχουν ως κίνητρο μόνο το κέρδος." />
<figcaption aria-hidden="true">Το έξυπνο ρολόι pebble κατάφερε να
πουλήσει το πρώτο εκατομμύριο κομμάτια το ίδιο γρήγορα με το πρώτο Apple
iPod, με την διαφορά ότι το pebble σχεδιάστηκε από μια μικρή ομάδα και
χρηματοδοτήθηκε από χιλιάδες δυνητικούς χρήστες, και όχι από επενδυτές
που έχουν ως κίνητρο μόνο το κέρδος.</figcaption>
</figure>
<section id="footnotes" class="footnotes footnotes-end-of-section"
role="doc-endnotes">
<hr />
<ol start="17">
<li><div id="fn17">
<p><span class="citation"
data-cites="malone1994interdisciplinary">Malone και Crowston
(1994)</span><a href="#fnref17" class="footnote-back"
role="doc-backlink">↩︎</a></p>
</div></li>
<li><div id="fn18">
<p><span class="citation" data-cites="baecker1993readings">Baecker
(1993)</span><a href="#fnref18" class="footnote-back"
role="doc-backlink">↩︎</a></p>
</div></li>
<li><div id="fn19">
<p>fig:time-space-cscw<a href="#fnref19" class="footnote-back"
role="doc-backlink">↩︎</a></p>
</div></li>
<li><div id="fn20">
<p>fig:social-reviews<a href="#fnref20" class="footnote-back"
role="doc-backlink">↩︎</a></p>
</div></li>
<li><div id="fn21">
<p>licklider1960man<a href="#fnref21" class="footnote-back"
role="doc-backlink">↩︎</a></p>
</div></li>
<li><div id="fn22">
<p>fig:crowdsourcing<a href="#fnref22" class="footnote-back"
role="doc-backlink">↩︎</a></p>
</div></li>
<li><div id="fn23">
<p>fig:kickstarter-pebble<a href="#fnref23" class="footnote-back"
role="doc-backlink">↩︎</a></p>
</div></li>
</ol>
</section>
<h2 id="η-περίπτωση-του-παγκόσμιου-ιστού">Η περίπτωση του παγκόσμιου
ιστού</h2>
<p>Η κατασκευή του συστήματος World Wide Web (WWW) και κυρίως η πολύ
γρήγορη αποδοχή του από ένα μεγάλο εύρος χρηστών ήταν μια εξέλιξη
κομβικής σημασίας για την ανάπτυξη και ολοκλήρωση της διάδρασης με τον
επιτραπέζιο υπολογιστή. Σε πλήρη αναλογία με την αρχική κατασκευή της
διάδρασης με την επιφάνεια εργασίας του επιτραπέζιου υπολογιστή (με
σκοπό τη διευκόλυνση της εκδοτικής εργασίας), έτσι και το σύστημα WWW
σχεδιάστηκε για να διευκολύνει τον διαμοιρασμό επιστημονικών
δημοσιεύσεων. Η αναλογία του WWW με το Desktop συνεχίζεται και στη
μετεξέλιξή τους, αφού και τα δύο μετασχηματίστηκαν και προσαρμόστηκαν
για να εξυπηρετήσουν τις ανάγκες των χρηστών και σε άλλες εφαρμογές,
όπως η επικοινωνία, η διασκέδαση, η εκπαίδευση, κτλ.</p>
<p>Η ιστορία του WWW ξεκίνησε με μια ασύμμετρα χαμηλή αποδοχή όταν η
περιγραφή του συστήματος πέρασε σχεδόν απαρατήρητη από την επιστημονική
κοινότητα, αφού υπήρχαν ήδη αντίστοιχα συστήματα που ήταν περισσότερο
πλήρη, όπως η Standard Generalized Markup Language (SGML). Αν και η
γλώσσα Hyper-Text Markup Language (HTML) δεν θεωρήθηκε ως επιστημονική
πρόοδος, έγινε διαθέσιμη τη σωστή στιγμή, ήταν εύχρηστη, και είχε όσες
λειτουργίες ήταν χρήσιμες τότε, με αποτέλεσμα να πετύχει μεγάλη αποδοχή
από μια ευρύτατη ομάδα χρηστών σε πολύ μικρό χρονικό διάστημα. Αυτό το
γεγονός από μόνο του αποτελεί ένα σημαντικό παράδειγμα της περιοχής του
προγραμματισμού της διάδρασης, όπου δεν κερδίζει ούτε η καλύτερη
κατασκευή, ούτε η καλύτερη σχεδίαση, αλλά η πιο κατάλληλη και η πιο
προσαρμόσιμη στις συνεχώς μεταλλασσόμενες τεχνολογικές ανάγκες των
χρηστών. Η ανάπτυξη του WWW τόσο από την πλευρά των χρηστών που έβαζαν
περιεχόμενο, όσο και από την πλευρά των κατασκευαστών που ανέπτυσσαν τις
τεχνολογίες έγινε με τρόπο περισσότερο οργανικό, παρά με τρόπο ιεραρχικό
και συντονισμένο βάσει κάποιων κοινά συμφωνημένων προδιαγραφών που
προέρχονταν από συστηματική ανάλυση των αναγκών των χρηστών.</p>
<p>Πράγματι, το σύστημα WWW αποδείχτηκε εξαιρετικά προσαρμόσιμο σε νέα
πεδία εφαρμογών, όπως το ηλεκτρονικό εμπόριο. Αν και αρχικά το σύστημα
WWW σχεδιάστηκε για τον διαμοιρασμό επιστημονικών εργασιών, χάρη στην
πολύ απλή δηλωτική γλώσσα οργάνωσης και μορφοποίησης της πληροφορίας, σε
πολύ σύντομο χρονικό διάστημα γνώρισε την αποδοχή χρηστών που ήθελαν να
μοιραστούν με τον υπόλοιπο κόσμο κάθε λογής πληροφορία. Πριν συμπληρώσει
την πρώτη δεκαετία ζωής του, το σύστημα WWW με τη βοήθεια τεχνολογικών
επεκτάσεων έδωσε τη δυνατότητα -εκτός από την ανάκτηση πληροφορίας- και
για ηλεκτρονικές συναλλαγές. Φυσικά, η γλώσσα SGML αν και φαινομενικά
χάθηκε, στην πορεία αποτέλεσε τη βάση για την XML που έγινε μέρος της
XHTML και καθόρισε την HTML5, με την οποία το WWW απέκτησε πλέον τη
μορφή πλατφόρμας εκτέλεσης γενικών υπολογιστικών εφαρμογών, κι όχι απλών
εφαρμογών του Internet όπως ήταν ο αρχικός ρόλος του.</p>
<figure id="fig:www">
<img src="../images/www.png"
alt="Οι πρώτες σελίδες του WWW είχαν στόχο να βελτιώσουν την ταχύτητα της δημοσίευσης επιστημονικών άρθρων μέσω του Internet, το οποίο είχε ήδη παρόμοιες υπηρεσίες όπως το FTP, ενώ η ανάπτυξη τόσο του εξυπηρετητή όσο και του φυλλομετρητή για το WWW αναπτύχθηκαν από έναν άνθρωπο τον Tim Berners Lee, ο οποίος εργαζόταν στην τεχνολογική υποστήριξη του ερευνητικού κέντρου CERN." />
<figcaption aria-hidden="true">Οι πρώτες σελίδες του WWW είχαν στόχο να
βελτιώσουν την ταχύτητα της δημοσίευσης επιστημονικών άρθρων μέσω του
Internet, το οποίο είχε ήδη παρόμοιες υπηρεσίες όπως το FTP, ενώ η
ανάπτυξη τόσο του εξυπηρετητή όσο και του φυλλομετρητή για το WWW
αναπτύχθηκαν από έναν άνθρωπο τον Tim Berners Lee, ο οποίος εργαζόταν
στην τεχνολογική υποστήριξη του ερευνητικού κέντρου CERN.</figcaption>
</figure>
<figure id="fig:amaya-web-editor">
<img src="../images/amaya-web-editor.jpg"
alt="Το σύστημα Amaya παρέχει ολοκληρωμένη πρόβαση στον παγκόσμιο ιστό, όχι μόνο ως φυλομετρητής, αλλά κυρίως ως ένα περιβάλλον επεξεργασίας εγγράφων για δημοσίευση." />
<figcaption aria-hidden="true">Το σύστημα Amaya παρέχει ολοκληρωμένη
πρόβαση στον παγκόσμιο ιστό, όχι μόνο ως φυλομετρητής, αλλά κυρίως ως
ένα περιβάλλον επεξεργασίας εγγράφων για δημοσίευση.</figcaption>
</figure>
<p>Η σημαντικότερη εξέλιξη του συστήματος WWW πραγματοποιήθηκε κατά την
πρώτη δεκαετία του 2000, όταν ο συνδυασμός του δυναμικού προγραμματισμού
στις τεχνολογίες του εξυπηρετητή και του φυλλομετρητή επέτρεψαν την
ανάπτυξη πλήρως λειτουργικών εφαρμογών χρήστη. Αν και τα πρώτα δημοφιλή
παραδείγματα δυναμικών εφαρμογών ήταν αυτά των ηλεκτρονικών συναλλαγών
(π.χ., ebay, paypal) και του ηλεκτρονικού καλαθιού (π.χ., Amazon), η
δικτυακή εφαρμογή που επαναπροσδιόρισε την αντίληψη που έχουμε για το
WWW ήταν το Google Mail (Gmail). Το Gmail προσφέρει όλες τις λειτουργίες
του ηλεκτρονικού ταχυδρομείου χωρίς να υπάρχει ανάγκη για την αντίστοιχη
εφαρμογή που τρέχει πάνω από το λειτουργικό σύστημα. Με αυτόν τον τρόπο
το Gmail αποτέλεσε το πρώτο μεγάλο βήμα για την αντιμετώπιση του απλού
μέχρι τότε φυλλομετρητή ως λειτουργικού συστήματος και του WWW ως
πλατφόρμας δικτυακού υπολογισμού (cloud computing).</p>
<p>Η καθιέρωση του συστήματος WWW συνεχίστηκε με ακόμη πιο έντονους
ρυθμούς και μετά το 2005 με την ολοκλήρωση όλο και περισσότερων
λειτουργιών, με περισσότερο χαρακτηριστικές περιπτώσεις το YouTube, το
Facebook, και το Twitter, που σε μεγάλο βαθμό επαναπροσδιόρισαν το
σύστημα WWW περισσότερο ως ένα ευέλικτο μέσο επικοινωνίας παρά ως ένα
απλό εργαλείο για τον διαμοιρασμό επιστημονικών δημοσιεύσεων, όπως ήταν
ο αρχικός σκοπός του. Ειδικά η ραγδαία ανάπτυξη και αποδοχή του Facebook
αποτελεί παράδειγμα ανάλογο του ίδιου του WWW, όπου ένα τεχνολογικό
σύστημα -χωρίς να έχει κάποια ιδιαίτερη τεχνολογική ή σχεδιαστική
υπεροχή έναντι του ανταγωνισμού- προσαρμόζεται και εξυπηρετεί τις
ανάγκες των χρηστών του, ενώ διαχρονικά και σταδιακά εξελίσσεται το ίδιο
σε πλατφόρμα εφαρμογών.</p>
<p>Οι τεχνολογικές εξελίξεις μετά το 2010 έδωσαν στο αρχικό σύστημα WWW
τη δυνατότητα ανάπτυξης ενός πολύ μεγάλου εύρους εφαρμογών χρήστη (π.χ.,
ανταλλαγή μηνυμάτων, παιχνίδια), σε βαθμό τέτοιο που να μπορούμε πλέον
να μιλάμε για μια πλατφόρμα ανάπτυξης αντίστοιχη με τα μέχρι τότε
διαδεδομένα επιτραπέζια λειτουργικά συστήματα. Πράγματι, ο
μετασχηματισμός της αντίληψης που έχουμε για το WWW, αφού έκανε το πρώτο
βήμα με τις εφαρμογές (π.χ., Wikipedia, Gmail), σταδιακά μετατράπηκε σε
πλατφόρμα για την εκτέλεση εφαρμογών, όπου ο φυλλομετρητής αντικαθιστά
το λειτουργικό σύστημα (π.χ., ChromeOS) και ο χρήστης έχει στην διάθεσή
του δημοφιλείς εφαρμογές επικοινωνίας και γραφείου.</p>
<p>Συνολικά, η ερευνητική μελέτη περίπτωσης του συστήματος World Wide
Web (WWW) αποτελεί μια σύνθεση των διαφορετικών θεωρήσεων της διάδρασης,
εξίσου ενδιαφέρουσα με εκείνη του επιτραπέζιου υπολογιστή. Όπως και ο
επιτραπέζιος υπολογιστής, έτσι και το σύστημα WWW, μέσα στο χρονικό
διάστημα μιας δεκαετίας, μετατράπηκε από ένα απλό σύστημα διαμοιρασμού
ερευνητικών δημοσιεύσεων σε μια υπολογιστική πλατφόρμα πάνω στην οποία
μπορούν να εκτελεστούν πολύ διαφορετικές εφαρμογές, από ψυχαγωγικά
παιχνίδια, μέχρι εφαρμογές γραφείου, επικοινωνίας, και εμπορικών
συναλλαγών. Τελικά, ο φυλομετρητής του παγκόσμιου ιστού μετατράπηκε από
μια απλή εφαρμογή σε ένα λειτουργικό σύστημα με τις δικές του εφαρμογές,
όπως φαίνεται στην περίπτωση του ChromeOS.</p>
<h2 id="η-περίπτωση-της-wikipedia">Η περίπτωση της Wikipedia</h2>
<p>Η συμμετοχική ανάπτυξη και η ευέλικτη διανομή και αλλαγή ενός
προϊόντος για υπολογιστές ξεκίνησε με την περίπτωση του λογισμικού
ανοικτού κώδικα. Όμως, η διαδικασία αυτή έγινε δημοφιλής και γνωστή με
την περίπτωση της δικτυακής εγκυκλοπαίδειας Wikipedia. Προσπάθειες
παρόμοιες με της Wikipedia, όπως εκείνη της Nupedia -η οποία είχε ένα
πιο ιεραρχικό και δομημένο μοντέλο δημοσίευσης και ενημέρωσης άρθρων,
παρόμοιο με αυτό μια έντυπης εγκυκλοπαίδειας- δεν πέτυχαν στην πράξη.
Βλέπουμε, λοιπόν, ότι ο πετυχημένος προγραμματισμός της διάδρασης είναι
κάτι περισσότερο από τη μετατροπή μιας υπάρχουσας διαδικασίας σε
ψηφιακή, αφού τουλάχιστον σε κάποιες -πετυχημένες- περιπτώσεις, όπως της
Wikipedia, απαιτεί και την υιοθέτηση ενός νέου παραγωγικού μοντέλου, το
οποίο έχει και αντίστοιχα διαφορετικές προδιαγραφές λειτουργίας και
χρήσης. Η αποτελεσματικότητα της Wikipedia ήταν τόσο μεγάλη που μέσα σε
λιγότερο από δέκα χρόνια οδήγησε την Encyclopaedia Britannica στην
κατάργηση της έντυπης έκδοσης. Φυσικά, όπως και οι παραδοσιακές
εγκυκλοπαίδειες, έτσι και η Wikipedia έχει δεχτεί κριτική για κάποια
άρθρα της, με τη διαφορά όμως ότι στη Wikipedia η διαδικασία
αποσαφήνισης είναι ανοικτή και τεκμηριωμένη.</p>
<p>Το προϊόν της Wikipedia βασίζεται σε δύο πυλώνες που είναι
καινοτομικοί σε σχέση με την κυρίαρχη πρακτική εκείνης της εποχής (2000)
για την παραγωγή και διανομή ψηφιακού περιεχομένου. Πρώτον, οι τελικοί
χρήστες δημιουργούν και συντηρούν το περιεχόμενο της εγκυκλοπαίδειας και
δεύτερον, η επεξεργασία ενός άρθρου γίνεται με το πρόγραμμα
περιήγησης.<a href="#fn24" id="fnref24" class="footnote-ref"
role="doc-noteref"><sup>24</sup></a> Αν και αυτές οι δύο πρακτικές
μπορεί να φαίνονται σήμερα κοινή λογική, εκείνη την εποχή η λογική αυτή
είχε αποδοχή μόνο σε έναν πολύ μικρό κύκλο προγραμματιστών ανοικτού
κώδικα, όπως ο Richard Stallman. Μάλιστα, στην πρώτη προσπάθεια
δημιουργίας μιας ελεύθερης δικτυακής εγκυκλοπαίδειας οι ίδιοι οι
δημιουργοί της Wikipedia προσπάθησαν χωρίς επιτυχία (π.χ., Nupedia) να
χρησιμοποιήσουν ειδικούς ανά θεματική κατηγορία και μια αυστηρή
διαδικασία ελέγχου των άρθρων, ακριβώς όπως έκαναν οι έντυπες
εγκυκλοπαίδειες. Ταυτόχρονα, οι περισσότεροι χρήστες και παραγωγοί
περιεχομένου για τον ιστό είχαν την αντίληψη ότι άλλο είναι το πρόγραμμα
περιήγησης που απλά διαβάζει μια σελίδα από τον εξυπηρετητή και άλλο
είναι το πρόγραμμα επεξεργασίας που δημιουργεί και αλλάζει μια σελίδα
για να τη βάλει προς διανομή στον εξυπηρετητή.</p>
<p>H Wikipedia είναι ένα σπουδαίο παράδειγμα προγραμματισμού της
διάδρασης για τους παρακάτω λόγους: Πρώτον, βλέπουμε για μια ακόμη φορά
(π.χ., Facebook) ότι ένα σύστημα διάδρασης ανθρώπου και υπολογιστή
μπορεί να γίνει πολύ επιτυχημένο, όχι επειδή είναι το πιο προηγμένο
τεχνολογικά, αλλά επειδή είναι αυτό που εξυπηρετεί με απλό τρόπο τις
πραγματικές ανάγκες των χρηστών (π.χ., επεξεργασία περιεχομένου χωρίς
την ανάγκη πρόσθετου λογισμικού) και μάλιστα την κατάλληλη χρονική
στιγμή. Δεύτερον, το μοντέλο λογισμικού τύπου wiki, μετά την επιτυχία
που είχε με τη Wikipedia, χρησιμοποιήθηκε σε πάρα πολλές άλλες
περιπτώσεις, όπως στην κατασκευή προσωπικών ιστοσελίδων από τους
τελικούς χρήστες (π.χ., Wordpress). Τέλος, αν και μια εγκυκλοπαίδεια που
δίνει εύκολη πρόσβαση στην ανθρώπινη γνώση σε πολλές γλώσσες είναι από
μόνη της ένα σπουδαίο προϊόν, αυτό που κάνει πραγματικά ξεχωριστή τη
Wikipedia είναι ότι αποτελεί την καλύτερη απόδειξη ότι ένα απλό
λογισμικό και μερικοί κοινώς αποδεκτοί κανόνες συνεργασίας (π.χ., αρχείο
αλλαγών και περιοχή συζήτησης) μπορούν να αντικαταστήσουν τη μέχρι τότε
ιεραρχική και κερδοσκοπική διαδικασία παραγωγής προϊόντων
περιεχομένου.</p>
<figure id="fig:wikipedia-edit">
<img src="../images/wikipedia-edit.png"
alt="Η εύκολη και καθολική συμμετοχή των χρηστών στη δημιουργία και ενημέρωση του περιεχομένου γίνεται με τη βοήθεια λογισμικού τύπου wiki, το οποίο επιτρέπει την επιτόπου επεξεργασία ενός άρθρου μέσα στο λογισμικό περιηγητή του χρήστη." />
<figcaption aria-hidden="true">Η εύκολη και καθολική συμμετοχή των
χρηστών στη δημιουργία και ενημέρωση του περιεχομένου γίνεται με τη
βοήθεια λογισμικού τύπου wiki, το οποίο επιτρέπει την επιτόπου
επεξεργασία ενός άρθρου μέσα στο λογισμικό περιηγητή του
χρήστη.</figcaption>
</figure>
<figure id="fig:open-street-map">
<img src="../images/open-street-map.jpg"
alt="Η λογική της συμμετοχικής δημιουργίας και συντηρήσης σημαντικού περιεχομένου όπως στην εγκυκλοπαίδεια Wikipedia εφαρμόστηκε με επιτυχία και σε άλλους τομείς όπως οι χάρτες, οι οποίοι σε μια περίπτωση φυσικής καταστροφής ενημερώθηκαν πιο γρήγορα και πιο αποτελεσματικά από τους αντίστοιχους ιδιωτικούς." />
<figcaption aria-hidden="true">Η λογική της συμμετοχικής δημιουργίας και
συντηρήσης σημαντικού περιεχομένου όπως στην εγκυκλοπαίδεια Wikipedia
εφαρμόστηκε με επιτυχία και σε άλλους τομείς όπως οι χάρτες, οι οποίοι
σε μια περίπτωση φυσικής καταστροφής ενημερώθηκαν πιο γρήγορα και πιο
αποτελεσματικά από τους αντίστοιχους ιδιωτικούς.</figcaption>
</figure>
<p>Το παραπάνω παράδειγμα λειτουργίας (καθολική συμμετοχή και
συνεργατικό λογισμικό) της Wikipedia εφαρμόστηκε σε πολλές ακόμη
περιπτώσεις συνεργατικής παραγωγής περιεχομένου, με ιδιαίτερη έμφαση
στις περιπτώσεις εκείνες που οι κερδοσκοπικοί οργανισμοί δεν είχαν
κίνητρα συμμετοχής (π.χ., Ushahidi). Ένα ακόμη πολύ επιτυχημένο
παράδειγμα είναι η παραγωγή χαρτογραφικής πληροφόρησης και ειδικά η
προσπάθεια του OpenStreetMap,<a href="#fn25" id="fnref25"
class="footnote-ref" role="doc-noteref"><sup>25</sup></a> το οποίο
επιτρέπει σε όλους τους χρήστες να εισάγουν δρόμους και χαρτογραφική
πληροφορία σε μια κοινή περιοχή, με σκοπό να δημιουργηθεί μια
εναλλακτική στα κυρίαρχα προϊόντα, όπως το Google Maps, που ελέγχονται
από κερδοσκοπικές εταιρείες. Για τους δημιουργούς των αντίστοιχων
συστημάτων ανοικτής πρόσβασης, τα κίνητρα συμμετοχής τους είναι συνήθως
κάτι περισσότερο από μια φιλοσοφική άρνηση του μοντέλου λειτουργίας των
κερδοσκοπικών επιχειρήσεων, αφού ο στόχος τους είναι περισσότερο η
πρόσβαση σε μια διαφορετική αντίληψη στην παραγωγή του περιεχομένου.
Άλλωστε, ακόμη και οι κυρίαρχες πλατφόρμες χαρτών αποδέχτηκαν την
αδυναμία τους να καλύψουν τις επιμέρους ανάγκες που συνέχεια προκύπτουν,
και έδωσαν (από το 2013) τη δυνατότητα στους χρήστες να κάνουν προτάσεις
για αλλαγές στους χάρτες τους (π.χ., Google Map Maker, Here Map
Creator).</p>
<section id="footnotes" class="footnotes footnotes-end-of-section"
role="doc-endnotes">
<hr />
<ol start="24">
<li><div id="fn24">
<p>fig:wikipedia-edit<a href="#fnref24" class="footnote-back"
role="doc-backlink">↩︎</a></p>
</div></li>
<li><div id="fn25">
<p>fig:open-street-map<a href="#fnref25" class="footnote-back"
role="doc-backlink">↩︎</a></p>
</div></li>
</ol>
</section>
<h2 id="σύντομη-βιογραφία-του-ted-nelson">Σύντομη βιογραφία του Ted
Nelson</h2>
<p>O Ted Nelson αναφέρεται συχνά ως ένας από τους θεωρητικούς του
παγκόσμιου ιστού, αλλά αυτό είναι μόνο εν μέρει σωστό. Πράγματι
ασχολήθηκε με τα ψηφιακά έγγραφα και κυρίως με την φύση των
υπερσυνδέσμων ανάμεσα τους, έτσι ώστε να είναι πάντα σαφές το νόημα ενός
κειμένου που είναι παράθεση από άλλο κείμενο.<a href="#fn26"
id="fnref26" class="footnote-ref" role="doc-noteref"><sup>26</sup></a>
Για αυτόν τον σκοπό η σχεδίαση του επιβάλει την ύπαρξη αμφίδρομων
υπερσυνδέσμων, που εμπλουτίζουν και το νόημα της αρχικής πηγής, σε
αντίθεση με τον σύγχρονο παγκόσμιο ιστό που βασίζεται σε μονόδρομους
υπερσυνδέσμους.</p>
<p>Οι μονόδρομοι υπερσύνδεσμοι είναι σίγουρα πολύ απλοί στην υλοποίηση,
αλλά τελικά έχουν ένα πολύ μεγάλο κόστος μακροπρόθεσμα, το οποίο δεν
είναι μόνο οικονομικό. Το οικονομικό κόστος αφορά στην ανάγκη να
δημιουργηθούν εμπορικές υπηρεσίες που θα παρέχουν την λειτουργικότητα
των αμφίδρομων συνδέσμων όπως είναι οι Google και Faceobok, για τις
περιπτώσεις των ψηφιακών εγγράφων και κοινωνικών δικτύων αντίστοιχα. Η
συγκέντρωση της οικονομικής ισχύος σε μοναδικούς πυλώνες ενισχύει την
οικονομική ανισότητα και ταυτόχρονα μειώνει την πολυφωνία και τελικά
απειλεί την δημοκρατία, ειδικά σε μια κοινωνία που λειτουργεί πάνω σε
ατελή ψηφιακά μέσα.</p>
<p>Όπως και ο καλός του φίλος ο Douglas Engelbart που έμεινε γνωστός
περισσότερο για το ποντίκι, έτσι ακριβώς και ο Ted Nelson είναι γνωστός
ως ο δημιουργός του πλήκτρου της επιστροφής από ένα ψηφιακό έγγραφο στο
προηγούμενο, το οποίο όμως δεν είναι παρά μια μικρή τεχνολογική
συνεισφορά σε ένα πολύ ευρύτερο όραμα.<a href="#fn27" id="fnref27"
class="footnote-ref" role="doc-noteref"><sup>27</sup></a> Το όραμα του
βασίζεται στην θεώρηση των ψηφιακών εγγράφων ως ένα νέο μέσο και όχι ως
μια προσομοίωση των φυσικών εγγράφων που τυπώνονται σε χαρτί. Σε αυτό το
όραμα ο υπολογιστής δεν είναι απλά ένα εργαλείο, αλλά ένα νέο μέσο, το
οποίο διατηρεί το ιστορικό για κάθε έγγραφο που είναι μοναδικό, έτσι
ώστε να μην υπάρχει η ανάγκη για αντιγραφή και επικόλληση, αλλά μόνο για
δημιουργία υπερσυνδέσμων που αυξάνουν το νόημα, αλλά και την αξία κάθε
εγγράφου, είτε αυτό είναι κείμενο, είτε πολυμεσικό υλικό.</p>
<figure id="fig:nelson-profile">
<img src="../images/nelson-profile.jpg"
alt="Το έργο του Ted Nelson αντανακλά την κατασκευή της διάδρασης, όπου υπάρχουν πολλές εναλλακτικές ιδέες για την οργάνωση και την οπτικοποίηση της πληροφορίας και τελικά επικρατούν κάποιες που ήταν ευκολότερο να υλοποιηθούν και να διαδωθούν γρήγορα ώστε να γίνουν οικείες. Ταυτόχρονα, η διαδρομή και η σύνθεση γνώσεων και δεξιοτήτων του Ted Nelson δείχνει την δυσκολία του αντικειμένου, όπου απαιτούνται τόσο ανθρωπιστικές όσο και τεχνολογικές ιδιότητες." />
<figcaption aria-hidden="true">Το έργο του Ted Nelson αντανακλά την
κατασκευή της διάδρασης, όπου υπάρχουν πολλές εναλλακτικές ιδέες για την
οργάνωση και την οπτικοποίηση της πληροφορίας και τελικά επικρατούν
κάποιες που ήταν ευκολότερο να υλοποιηθούν και να διαδωθούν γρήγορα ώστε
να γίνουν οικείες. Ταυτόχρονα, η διαδρομή και η σύνθεση γνώσεων και
δεξιοτήτων του Ted Nelson δείχνει την δυσκολία του αντικειμένου, όπου
απαιτούνται τόσο ανθρωπιστικές όσο και τεχνολογικές
ιδιότητες.</figcaption>
</figure>
<figure id="fig:xanadu-viewer3d">
<img src="../images/xanadu-viewer3d.png"
alt="Σε μια από τις πολλές προσπάθειες υλοποίησης μιας διεπαφής για το Xanadu δοκιμάστηκαν τα γραφικά τριών διαστάσεων και η πλοήγηση με διεπαφή μεγέθυνσης. Για αυτήν την περίπτωση, το κείμενο ήταν η Παλαιά Διαθήκη, η οποία συνοδεύεται από πολλές εναλλακτικές σημειώσεις και ερμηνείες, έτσι ώστε ο αναγνώστης να μπορεί να τις μελετήσει συγκριτικά." />
<figcaption aria-hidden="true">Σε μια από τις πολλές προσπάθειες
υλοποίησης μιας διεπαφής για το Xanadu δοκιμάστηκαν τα γραφικά τριών
διαστάσεων και η πλοήγηση με διεπαφή μεγέθυνσης. Για αυτήν την
περίπτωση, το κείμενο ήταν η Παλαιά Διαθήκη, η οποία συνοδεύεται από
πολλές εναλλακτικές σημειώσεις και ερμηνείες, έτσι ώστε ο αναγνώστης να
μπορεί να τις μελετήσει συγκριτικά.</figcaption>
</figure>
<p>Το έργο του Ted Nelson θέτει θεμελιώδη ερωτήματα στην τεχνολογία
λογισμικού και στα διαδραστικά συστήματα,<a href="#fn28" id="fnref28"
class="footnote-ref" role="doc-noteref"><sup>28</sup></a> γιατί είναι
από τους λίγους που συμετείχε στις συζητήσεις δημιουργίας των πρώτων
προσωπικών υπολογιστών και είχε άποψη ορμώμενος από τις ανθρωπιστικές
επιστήμες και ιδεώδη. Αν και ο ίδιος δεν κατάφερε να υλοποιήσει σε
μεγάλη κλίμακα το όραμα του, οι ιδέες του για την φύση των υπολογιστών
ως μέσα επικοινωνίας και έκφρασης αποτελούν προδιαγραφές για μελλοντικά
διαδραστικά συστήματα,<a href="#fn29" id="fnref29" class="footnote-ref"
role="doc-noteref"><sup>29</sup></a> τα οποία δεν θα είναι απλά μια
προσομοίωση της πραγματικότητας.</p>
<section id="footnotes" class="footnotes footnotes-end-of-section"
role="doc-endnotes">
<hr />
<ol start="26">
<li><div id="fn26">
<p>fig:nelson-profile<a href="#fnref26" class="footnote-back"
role="doc-backlink">↩︎</a></p>
</div></li>
<li><div id="fn27">
<p><span class="citation" data-cites="nelson1974computer">Nelson
(1974)</span><a href="#fnref27" class="footnote-back"
role="doc-backlink">↩︎</a></p>
</div></li>
<li><div id="fn28">
<p><span class="citation" data-cites="nelson2010possiplex">Nelson κ.ά.
(2010)</span><a href="#fnref28" class="footnote-back"
role="doc-backlink">↩︎</a></p>
</div></li>
<li><div id="fn29">
<p>fig:xanadu-viewer3d<a href="#fnref29" class="footnote-back"
role="doc-backlink">↩︎</a></p>
</div></li>
</ol>
</section>
<h2 class="unnumbered" id="βιβλιογραφία">Βιβλιογραφία</h2>
<div id="refs" class="references csl-bib-body hanging-indent"
role="list">
<div id="ref-baecker1993readings" class="csl-entry" role="listitem">
Baecker, Ronald M. 1993. <em>Readings in groupware and
computer-supported cooperative work: Assisting human-human
collaboration</em>. Elsevier.
</div>
<div id="ref-barnet2013memory" class="csl-entry" role="listitem">
Barnet, Belinda. 2013. <em>Memory machines: The evolution of
hypertext</em>. Anthem Press.
</div>
<div id="ref-berners1996past" class="csl-entry" role="listitem">
Berners-Lee, Tim. 1996. <span>‘WWW: Past, present, and future’</span>.
<em>Computer</em> 29 (10): 69–77.
</div>
<div id="ref-bolt1978spatial" class="csl-entry" role="listitem">
Bolt, Richard A. 1978. <span>‘Spatial data management system’</span>.
MASSACHUSETTS INST OF TECH CAMBRIDGE ARCHITECTURE MACHINE GROUP.
</div>
<div id="ref-bush1945we" class="csl-entry" role="listitem">
Bush, Vannevar κ.ά. 1945. <span>‘As we may think’</span>. <em>The
atlantic monthly</em> 176 (1): 101–8.
</div>
<div id="ref-garrett2010elements" class="csl-entry" role="listitem">
Garrett, Jesse James. 2010. <em>Elements of user experience, the:
user-centered design for the web and beyond</em>. Pearson Education.
</div>
<div id="ref-licklider1960man" class="csl-entry" role="listitem">
Licklider, Joseph Carl Robnett. 1960. <span>‘Man-computer
symbiosis’</span>. <em>IRE transactions on human factors in
electronics</em>, τχ. 1: 4–11.
</div>
<div id="ref-malone1994interdisciplinary" class="csl-entry"
role="listitem">
Malone, Thomas W, και Kevin Crowston. 1994. <span>‘The interdisciplinary
study of coordination’</span>. <em>ACM Computing Surveys (CSUR)</em> 26
(1): 87–119.
</div>
<div id="ref-nelson1974computer" class="csl-entry" role="listitem">
Nelson, Theodor H. 1974. <span>‘Computer lib/Dream machines’</span>.
</div>
<div id="ref-nelson2010possiplex" class="csl-entry" role="listitem">
Nelson, Theodor H κ.ά. 2010. <em>POSSIPLEX: movies, intellect, creative
control, my computer life and the fight for civilization: an
autobiography of Ted Nelson</em>. Mindful Press.
</div>
<div id="ref-packer2002multimedia" class="csl-entry" role="listitem">
Packer, Randall, και Ken Jordan. 2002. <em>Multimedia: from Wagner to
virtual reality</em>. WW Norton &amp; Company.
</div>
<div id="ref-shiffman2009learning" class="csl-entry" role="listitem">
Shiffman, Daniel. 2009. <em>Learning Processing: a beginner’s guide to
programming images, animation, and interaction</em>. Morgan Kaufmann.
</div>
</div>
<h1 id="μορφές">Μορφές</h1>
<blockquote>
<p>Αν υπάρχει ένα προηγούμενο στην ανθρώπινη εμπειρία που να δείχνει πως
θα πρέπει να μοιάζει ένας υπολογιστής, αυτό είναι το μουσικό όργανο: μια
επινόηση με την οποία μπορείς να διερευνήσεις ένα τεράστιο εύρος
δυνατοτήτων μέσω μιας διεπαφής που συνδέει το μυαλό με το σώμα σου.
Jaron Lanier</p>
</blockquote>
<h3 id="περίληψη">Περίληψη</h3>
<p>Οι μορφές των συστημάτων διάδρασης βρίσκονται σε μια συνεχή εξέλιξη,
η οποία εξαρτάται τόσο από την τεχνολογία και τις ανθρώπινες δεξιότητες,
όσο και από το κοινωνικό και πολιτιστικό πλαίσιο δημιουργίας και χρήσης
τους. Οι διάτρητες κάρτες και το πληκτρολόγιο ήταν διαθέσιμα ως
συστήματα εισόδου για την βιομηχανία υφασμάτων και την τυπογραφία,
πολλές δεκαετίες πριν συνδεθούν σε έναν υπολογιστή. Αν και η σύνδεση
τους με τον υπολογιστή έδωσε μια οικειότητα σε ένα μηχάνημα που μέχρι
τότε μόνο κάποιος ηλεκτρονικός είχε πρόσβαση, ταυτόχρονα όρισε και ένα
σχετικά στενό πλαίσιο διάδρασης, όπως είναι η εισαγωγή δεδομένων και η
πληκτρολόγηση κειμένου, τα οποία είναι συμβατά περισσότερο με το
περιβάλλον εργασίας στο γραφείο. Από την άλλη πλευρά, ο υπολογιστής δεν
έχει προτίμηση αναφορικά με τις συσκευές εισόδου και εξόδου, αλλά θα
χρειαστεί να περάσουν πολλές ακόμη δεκαετίες μέχρι να αρχίσουμε να
συνδέουμε ψηφιακές οθόνες, κάμερες, και αισθητήρες. Παράλληλα με τις
συσκευές διάδρασης, αναπτύσσονται διαφορετικές μορφές λογισμικού
διάδρασης, όπως ένας επεξεργαστής κειμένου που βασίζεται σε
πληκτρολόγιο, αλλά μπορεί να έχει πολλές διαφορετικά στυλ διάδρασης,
όπως παράθυρα, μενού, γραφικά, ή να βασίζεται στην γραμμή εντολών.</p>
<h2 id="μορφολογία">Μορφολογία</h2>
<p>Υπάρχουν πολλοί τρόποι διάδρασης του χρήστη με τη συσκευή. Αρχικά,
έχουμε τη γραμμή εντολών και τις εντολές δέσμης (batch processing).
Αυτοί παραμένουν πολύ αποτελεσματικοί τρόποι διάδρασης, ειδικά όταν ο
χρήστης δίνει επαναλαμβανόμενες και σταθερές οδηγίες προς τη συσκευή.
Όταν οι οδηγίες προς το σύστημα πρέπει να αλλάζουν συχνά και δυναμικά,
τότε έχουμε τον απευθείας χειρισμό (direct manipulation) και την
εικονική πραγματικότητα (virtual reality - VR). Όταν η διάδραση γίνεται
δυναμικά, οι χρήστες λαμβάνουν συνέχεια ανάδραση (feedback). Στο
ενδιάμεσο αυτών των ακραίων τύπων διάδρασης (γραμμή εντολής και
απευθείας χειρισμός) υπάρχει ένα ολόκληρο φάσμα τύπων, μεταξύ των οποίων
και τύποι διάδρασης που εμφανίζονται με τις κινητές εφαρμογές και τις
συσκευές διάχυτου υπολογισμού (ubiquitous computing smart devices).</p>
<p>Πριν την εφικτή και οικονομική ανάπτυξη των μικροϋπολογιστών, που
βασιζόνται σε ολοκληρωμένα κυκλώματα ημιαγωγών μεγάλης κλίμακας,
διάδραση σε πραγματικό χρόνο ήταν διαθέσιμη μόνο σε συστήματα που είχαν
λογισμικό χρονοδιαμοιρασμού, αφού στους περισσότερους υπολογιστές την
δεκαετία του 1960 η εκτέλεση των προγραμμάτων γινόταν με εργασίες
δέσμης. Πέρα από τα καινοτόμα ερευνητικά συστήματα που εξετάζουμε στην
επόμενη ενότητα, τα εμπορικά διαθέσιμα διαδραστικά συστήματα βασίζονταν
σε τερματικά κειμένου, στα οποία η διάδραση γινόταν με γραμμή εντολών,
μενού, και φόρμες. Τα τερματικά κειμένου αρχικά ήταν προσαρμοσμένες και
εξελιγμένες εκδοχές του παραδοσιακού τηλέτυπου, τα οποία σταδιακά
αντικαταστάθηκαν από τερματικά με ηλεκτρονικές οθόνες καθοδικού σωλήνα.
Σε όλες αυτές τι περιπτώσεις ο χρήστης πληκτρολογούσε και έβλεπε το
αποτέλεσμα στο χαρτί ή στην οθόνη. Η πληκτρολόγηση γινόταν συνήθως για
την εισαγωγή ενός προγράμματος FORTRAN, BASIC, COBOL, ή για την χρήση
του προγράμματος μέσω της γραμμής εντολών, μενού, και φόρμας. Εκτός από
τους κεντρικούς υπολογιστές της IBM, που ήταν ήδη μια μεγάλη εταιρεία
στις λύσεις για την ηλεκτρονική επεξεργασία δεδομένων, ήρθαν να
προστεθούν και οι μίνι-υπολογιστές της DEC. Η DEC δημιούργησε την γέφυρα
από τους πολύ ακριβούς κεντρικούς υπολογιστές της δεκαετίας του 1960,
προς τους πολύ οικονομικούς μικροϋπολογιστές της δεκαετίας του 1970,
δημιουργώντας την κατηγορία των μίνι-υπολογιστών, οι οποίοι ήταν μεν
πολύ ακριβοί για να είναι προσωπικοί, αλλά αρκετά οικονομικοί για να
εγκατασταθούν σε πολλούς οργανισμούς και να εκπαιδεύσουν μια νέα γενιά
χρηστών, η οποία θα απαιτήσει μια πιο προσωπική εκδοχή τους.</p>
<figure id="fig:macintosh-desktop">
<img src="../images/macintosh-desktop.png"
alt="Το λειτουργικό σύστημα του επιτραπέζιου υπολογιστή Macintosh ήταν το πρώτο επιτυχημένο εμπορικό γραφικό περιβάλλον εργασίας και το πρώτο που έδωσε πρόσβαση σε πολλές εφαρμογές λογισμικού, ακόμη και σε χρήστες που δεν είχαν γνώσεις υπολογιστών, χάρη στην ευχρηστία του." />
<figcaption aria-hidden="true">Το λειτουργικό σύστημα του επιτραπέζιου
υπολογιστή Macintosh ήταν το πρώτο επιτυχημένο εμπορικό γραφικό
περιβάλλον εργασίας και το πρώτο που έδωσε πρόσβαση σε πολλές εφαρμογές
λογισμικού, ακόμη και σε χρήστες που δεν είχαν γνώσεις υπολογιστών, χάρη
στην ευχρηστία του.</figcaption>
</figure>
<figure id="fig:tmux-desktop">
<img src="../images/tmux-desktop.png"
alt="Η επιφάνεια εργασίας έχει συνδεθεί με τα γραφικά και τα πολυμέσα αλλά μπορεί να πραγματοποιηθεί σε μεγάλο βαθμό μόνο με την χρήση της γραμμής εντολών, μερικών συνοδευτικών εργαλείων και αρκετών ρυθμίσεων με αποτέλεσμα μια πολύ γρήγορη, απλή, και πυκνή σε πληροφορία διεπαφή." />
<figcaption aria-hidden="true">Η επιφάνεια εργασίας έχει συνδεθεί με τα
γραφικά και τα πολυμέσα αλλά μπορεί να πραγματοποιηθεί σε μεγάλο βαθμό
μόνο με την χρήση της γραμμής εντολών, μερικών συνοδευτικών εργαλείων
και αρκετών ρυθμίσεων με αποτέλεσμα μια πολύ γρήγορη, απλή, και πυκνή σε
πληροφορία διεπαφή.</figcaption>
</figure>
<p>Ο μικροϋπολογιστής Apple II ήταν μια πολύ μεγάλη εμπορική επιτυχία με
εκατομμύρια πωλήσεις, αν και απευθυνόταν κυρίως σε χομπίστες των
ηλεκτρονικών και του προγραμματισμού. Η προσιτή τιμή, η αξιοπιστία του,
και η απλότητα στην χρήση διεύρυναν πολύ το κοινό του, πέρα από τους
χομπίστες, προς τους σπουδαστές και τους επαγγελματίες. Σε αντίθεση με
τους πρώτους μικροϋπολογιστές που ήταν διαθέσιμοι σε μορφή
συναρμολογούμενου, ο Apple II είχε προσεγμένο βιομηχανικό σχεδιασμό που
μοιάζει με τα καταναλωτικά ηλεκτρονικά όπως είναι ένα οικειακό
ηχοσύστημα. Το βασικό σύστημα είχε πληκτρολόγιο, αλλά δεν είχε ούτε
οθόνη, ούτε αποθηκευτικό μέσο, για τα οποία ο χρήστης μπορούσε να
χρησιμοποιήσει την τηλεόραση και ένα κασετόφωνο. Το βασικό λογισμικό
ήταν μια εκδοχή της γλώσσας προγραμματισμού BASIC, με την οποία ο
χρήστης μπορούσε να αναπτύξει τα δικά του προγράμματα ή να αντιγράψει
αυτά που έβρισκε σε περιοδικά και βιβλία της εποχής.</p>
<hr />
<blockquote>
<p><em>Η διάλεκτος της BASIC που χρησιμοποιήθηκε στον Apple II ήταν η
Integer η οποία δεν υποστήριζε μεταβλητές κινητής υποδιαστολής. Ο
δημιουργός της, Steve Wozniak, είχε στρέψει τον ενδιαφέρον του κυρίως
στην ανάπτυξη βιντεο-παιχνιδιών, τομέας στον οποίο η χρήση ακεραίων ήταν
επαρκής. Τότε η Apple στράφηκε στην Microsoft όπου δύο εργαζόμενοι της
ανέπτυξαν την Applesoft BASIC, η οποία υποστήριζε πολυδιάστατους
πίνακες, μεταβλητές κινητής υποδιαστολής και παγίδευση σφαλμάτων.
Χαρακτηριστικά που φυσικά την έκαναν πιο αργή αλλά δεν υπήρχαν στην
παλαιότερη BASIC.</em></p>
</blockquote>
<hr />
<blockquote>
<p><em>Μπουικλής Άγγελος Π2018076</em></p>
</blockquote>
<hr />
<p>Η μεγάλη διάδοση αυτού του μικροϋπολογιστή έδωσε το κίνητρο στην
Apple να αναπτύξει βελτιώσεις όπως οθόνη και εξωτερικό μέσο αποθήκευσης,
καθώς και νέα μοντέλα με περισσότερες δυνατότητες. Επίσης, το εύρος των
διαφορετικών χρηστών και οι πολυδιάστατες ανάγκες τους οδήγησαν στην
δημιουργία πολλών εμπορικών εφαρμογών, όπως το πρώτο φύλλο εργασίας
VisiCalc, καθώς και στην ανάπτυξη πολλών βιντεοπαιχνιδιών.</p>
<p>Παράλληλα με την ανάπτυξη των προσωπικών διαδραστικών
μίκρο-υπολογιστών, μερικές εταιρείες κατασκεύασαν τις πρώτες κονσόλες
βιντεοπαιχνιδιών. Οι πρώτες κονσόλες δεν είχαν εξωτερικό αποθηκευτικό
μέσο, οπότε τα βιντεοπαιχνίδια ήταν διαθέσιμα μόνο εσωτερικά σε τσιπάκια
μνήμης ανάγνωσης, αλλά αυτό άλλαξε με το Atari 2600, το οποίο δεχόταν
εξωτερικές κασέτες, όπου βρίσκονταν τα τσιπ με την μνήμη ανάγνωσης. Οι
κονσόλες συνοδεύονταν από συσκευές εισόδου με την μορφή του μοχλού
ελέγχου και δεν είχαν ούτε πληκτρολόγιο, ούτε ποντίκι, ενώ η έξοδος
γινόταν προς την τηλεόραση. Όπως και οι μορφές των προσωπικών
διαδραστικών συστημάτων έχουν μόνο μικρές αλλαγές από το 1984 με το
Apple Macintosh, <a href="#fn1" id="fnref1" class="footnote-ref"
role="doc-noteref"><sup>1</sup></a> <a href="#fn2" id="fnref2"
class="footnote-ref" role="doc-noteref"><sup>2</sup></a> έτσι και οι
κονσόλες δεν έχουν αλλάξει σημαντικά. To ίδιο ισχύει και με την
αρχιτεκτονική του λογισμικού τους, το οποίο συνήθως δεν περιλαμβάνει το
ενδιάμεσο επίπεδο ενός λειτουργικού συστήματος, αφού οι κατασκευαστές
βιντεοπαιχνιδιών προτιμάνε να έχουν πλήρη έλεγχο πάνω στο υλικό, γιατί
αυτό τους δίνει μεγαλύτερη δημιουργικότητα και έλεγχο στο τελικό
αποτέλεσμα, που είναι το ζητούμενο σε αυτήν την βιομηχανία. Αν και τα
πρώτα βιντεοπαιχνίδια ξεκίνησαν κυρίως ως προσομοιώσεις επίκαιρων
θεμάτων, όπως το τένις, ή οι διαστημικές μάχες, σταδιακά η
δημιουργικότητα των σχεδιαστών βιντεοπαιχνιδιών δημιουργούν νέα είδη και
κυρίως νέες συσκευές εισόδου. Σε αντίθεση με τους προσωπικούς
υπολογιστές με γραφική διεπαφή που έχουν μείνει σταθεροί, η βιομηχανία
των βιντεοπαιχνιδιών φαίνεται πιο δημιουργική, γιατί δεν περιορίζεται
ούτε από συσκευές εισόδου, ούτε από ένα λειτουργικό σύστημα με γραφική
διεπαφή.</p>
<figure id="fig:apple2">
<img src="../images/apple2.jpg"
alt="Ο δεύτερος μικροϋπολογιστής της Apple ήταν άμεσα διαθέσιμος σε μια καλαίσθητη συσκευασία βιομηχανικού σχεδιασμού με πληκτρολόγιο και είχε εισόδους και εξόδους για πολλά διαφερτικά περιφερειακά, όπως δίσκοι και οθόνη. Μπορούσε να συνδεθεί σε τηλεόραση και να αποθηκεύσει προγράμματα σε ένα μαγνητόφωνο κασέτας ήχου, οπότε το κόστος ήταν χαμηλό και έγινε αμέσως δημοφιλής, ενώ έμεινε σε παραγωγή για περισσότερα από δεκαπέντε χρόνια." />
<figcaption aria-hidden="true">Ο δεύτερος μικροϋπολογιστής της Apple
ήταν άμεσα διαθέσιμος σε μια καλαίσθητη συσκευασία βιομηχανικού
σχεδιασμού με πληκτρολόγιο και είχε εισόδους και εξόδους για πολλά
διαφερτικά περιφερειακά, όπως δίσκοι και οθόνη. Μπορούσε να συνδεθεί σε
τηλεόραση και να αποθηκεύσει προγράμματα σε ένα μαγνητόφωνο κασέτας
ήχου, οπότε το κόστος ήταν χαμηλό και έγινε αμέσως δημοφιλής, ενώ έμεινε
σε παραγωγή για περισσότερα από δεκαπέντε χρόνια.</figcaption>
</figure>
<figure id="fig:visicalc">
<img src="../images/visicalc.png"
alt="Ανάμεσα στις πολλές διαφορετικές χρήσεις του υπολογιστή ως εργαλείο (π.χ., επεξεργασία κειμένου, σχεδίαση, κτλ.), ξεχωρίζει η περίπτωση του VisiCalc που είναι το πρώτο δημοφιλές εργαλείο επεξεργασίας υπολογιστικών φύλλων, το οποίο μεταφέρει από το χαρτί στην οθόνη του υπολογιστή μια πολύ βασική διεργασία που κάνουν οι εταιρείες και τα νοικοκυριά για τη διαχείριση των οικονομικών τους. Η διάθεση μιας εφαρμογής γραφείου σε μικρο-υπολογιστές θα στρέψει την προσοχή της IBM στους προσωπικούς υπολογιστές και θα δημιουργήσει πολλές νέες μεγάλες εταιρείες όπως η Microsoft και η Apple." />
<figcaption aria-hidden="true">Ανάμεσα στις πολλές διαφορετικές χρήσεις
του υπολογιστή ως εργαλείο (π.χ., επεξεργασία κειμένου, σχεδίαση, κτλ.),
ξεχωρίζει η περίπτωση του VisiCalc που είναι το πρώτο δημοφιλές εργαλείο
επεξεργασίας υπολογιστικών φύλλων, το οποίο μεταφέρει από το χαρτί στην
οθόνη του υπολογιστή μια πολύ βασική διεργασία που κάνουν οι εταιρείες
και τα νοικοκυριά για τη διαχείριση των οικονομικών τους. Η διάθεση μιας
εφαρμογής γραφείου σε μικρο-υπολογιστές θα στρέψει την προσοχή της IBM
στους προσωπικούς υπολογιστές και θα δημιουργήσει πολλές νέες μεγάλες
εταιρείες όπως η Microsoft και η Apple.</figcaption>
</figure>
<p>Η εμπορική επιτυχία των μικροϋπολογιστών και ειδικά του Apple II,
καθώς και η εμφάνιση λειτουργικών συστημάτων, όπως το CPΜ, και εφαρμογών
γραφείου, όπως ο επεξεργαστής κειμένου WordStar και η λογιστική εφαρμογή
VisiCalc, έστρεψαν την προσοχή της IBM από τους κεντρικούς υπολογιστές
που ήταν η διαχρονική της αγορά προς την κατεύθυνση ενός προσωπικού
υπολογιστή για τις εργασίες του γραφείου. Αν και δεν υπήρχε ακόμη κάποιο
πετυχημένο εμπορικά εύχρηστο γραφικό περιβάλλον εργασίας, υπήρχαν ήδη
πάρα πολλές και πολύ οικονομικές λύσεις υλικού και λογισμικού για το
περιβάλλον γραφείου, μια αγορά δηλαδή που η IBM θεωρούσε ότι της ανήκε
και όπου είχε διαχρονικά τον έλεγχο των τιμών. Αυτή η νέα αγορά
προσωπικών υπολογιστών είχε πολύ διαφορετικές ιδιότητες από την
παραδοσιακή αγορά της IBM με τους κεντρικούς ή μίνι-υπολογιστές. Τόσο ο
κεντρική μονάδα, όσο και τα συστήματα εισόδου και εξόδου είχαν πλέον
προσβάσιμη τιμή ώστε να είναι προσιτά από πολλές μικρές επιχειρήσεις,
καθώς και νοικοκυριά. Ταυτόχρονα, η κατασκευή του λογισμικού, αλλά και η
χρήση του ήταν πλέον αρκετά διαδεδομένη, ώστε νέες μικρές εταιρείες,
ακόμη και ανεξάρτητοι κατασκευαστές να δημιουργούν πολλές εφαρμογές ή
λειτουργικά συστήματα, όπως το CPM, τα οποία μπορεί να μην ήταν τόσο
καλά όσο αυτά της IBM, αλλά ήταν αρκετά καλά και πολύ οικονομικά.<a
href="#fn3" id="fnref3" class="footnote-ref"
role="doc-noteref"><sup>3</sup></a> Η είσοδος της IBM με τον προσωπικό
της υπολογιστή ουσιαστικά έδωσε μια σφραγίδα ποιότητας και σοβαρότητας
σε έναν ιδιαίτερα πολυφωνικό χώρο, ταυτόχρονα όμως με την επικράτηση του
έδωσε και ένα τέλος στην δημιουργικότητα η οποία θα περάσει σε έναν
μικρότερο βαθμό προς το Apple Macintosh. <a href="#fn4" id="fnref4"
class="footnote-ref" role="doc-noteref"><sup>4</sup></a> <a href="#fn5"
id="fnref5" class="footnote-ref" role="doc-noteref"><sup>5</sup></a></p>
<figure id="fig:xerox-parc-tab">
<img src="../images/xerox-parc-tab.png"
alt="Η συσκευή τύπου Tab ήταν η μικρότερη στην οικογένεια συσκευών διάχυτου υπολογισμού Tab-Pad-Board και ήταν σχεδιασμένη έτσι ώστε να χωράει στην παλάμη και να μπορεί να λειτουργήσει τα κουμπιά μόνο με το ένα χέρι, ενώ επέτρεπε και την αφή με το δεύτερο χέρι με την χρήση μιας πένας." />
<figcaption aria-hidden="true">Η συσκευή τύπου Tab ήταν η μικρότερη στην
οικογένεια συσκευών διάχυτου υπολογισμού Tab-Pad-Board και ήταν
σχεδιασμένη έτσι ώστε να χωράει στην παλάμη και να μπορεί να
λειτουργήσει τα κουμπιά μόνο με το ένα χέρι, ενώ επέτρεπε και την αφή με
το δεύτερο χέρι με την χρήση μιας πένας.</figcaption>
</figure>
<figure id="fig:tabs-pads-boards">
<img src="../images/tabs-pads-boards.png"
alt="Το όραμα για τον διάχυτο υπολογισμό από το εργαστήριο Xerox PARC βασίζεται σε τρεις διακριτές φόρμες συσκευών διάδρασης με τους χρήστες οι οποίες επικονωνούν διαφανώς μεταξύ τους έτσι ώστε οι χρήστες να μπορούν να πραγματοποιήσουν τους στόχους τους είτε ατομικά είτε συνεργατικά." />
<figcaption aria-hidden="true">Το όραμα για τον διάχυτο υπολογισμό από
το εργαστήριο Xerox PARC βασίζεται σε τρεις διακριτές φόρμες συσκευών
διάδρασης με τους χρήστες οι οποίες επικονωνούν διαφανώς μεταξύ τους
έτσι ώστε οι χρήστες να μπορούν να πραγματοποιήσουν τους στόχους τους
είτε ατομικά είτε συνεργατικά.</figcaption>
</figure>
<p>Η παρουσία ενός διακριτού επιπέδου λογισμικού ανάμεσα στο υλικό του
υπολογιστή και στις εφαρμογές του ήταν για πολλές δεκαετίες κάτι
περιττό, αφού δεν υπήρχαν πολλές διαφορετικές αρχιτεκτονικές, ενώ και οι
εφαρμογές δεν ήταν πολλές. Σε μερικές περιπτώσεις, κάποιος κατασκευαστής
έφτιαχνε μερικές βιβλιοθήκες προγραμματισμού, έτσι ώστε να μην
χρειάζεται να υλοποιεί συνέχεια κάποιες βασικές λειτουργίες, αλλά στην
πράξη, οι περισσότερες εφαρμογές φτιάχνονταν από την αρχή, είτε σε
γλώσσες υψιλού επιπέδου όπως οι FORTRAN, COBOL, BASIC, είτε σε συμβολική
γλώσσα μηχανής. Η διάθεση οικονομικών επεξεργαστών από την Intel που
τοποθετήθηκαν σε πολλούς διαφορετικούς μίκρο-υπολογιστές, οδήγησε στην
δημιουργία των πρώτων λειτουργικών συστημάτων, τα οποία επέτρεπαν στους
προγραμματιστές να εστιάσουν στις λειτουργίες της εφαρμογής τους, χωρίς
να νοιάζονται για την πρόσβαση στον δίσκο και στις βασικές συσκευές
εισόδου και εξόδου. Η επιλογή του λειτουργικού συστήματος MSDOS από την
IBM για τον πρώτο της προσωπικό υπολογιστή και η ανάπτυξη πολλών
εφαρμογών για αυτήν την πλατφόρμα δημιούργησαν μια αγορά και ένα τρόπο
διάδρασης που θα παραμείνει επίκαιρος ακόμη και μετά την εμφάνιση της
γραφικής διεπαφής. Πράγματι, οι πρώτες εκδόσεις του γραφικού
περιβάλλοντος της Microsoft μέχρι και την έκδοση Windows Me του 2000,
βασίζονται στο MS-DOS, ενώ ακόμη και επόμενες εκδόσεις που έχουν
κατασκευαστεί από την αρχή, υλοποιούν για λόγους συμβατότητας έναν
περιβάλλον εξομοίωσης για τις διαχρονικά δημοφιλείς εφαρμογές που
τρέχουν μόνο πάνω σε MS-DOS.</p>
<p>Τα επιτραπέζια συστήματα με οθόνη γραφικών, πληκτρολόγιο, και
ποντίκι, ήταν από την δεκαετία του 1980 και μέχρι τις αρχές της
δεκαετίας του 2010, η βασική μορφή υλικού διάδρασης. Για παράδειγμα, ο
επιτραπέζιος υπολογιστής Apple Lisa απέτυχε εμπορικά, αλλά ήταν
καθοριστικής σημασίας για την μετάβαση από τον Xerox Star που
απευθυνόταν μόνο στο περιβάλλον του γραφείου προς την κατεύθυνση του
Apple Macintosh που έφερε την γραφική επιφάνεια εργασίας σε ένα ευρύτερο
κοινό.<a href="#fn6" id="fnref6" class="footnote-ref"
role="doc-noteref"><sup>6</sup></a> Για τον σκοπό, αυτό η Apple ϋοθετεί
από το Xerox Star το ποντίκι και την γραφική επιφάνεια εργασίας με τα
έγγραφα ως αρχεία. Ταυτόχρονα, προσθέτει στο Macintosh την ιδέα της
διάκρισης ανάμεσα στις εφαρμογές και στο λειτουργικό σύστημα, έτσι ώστε
να μπορεί να προσαρμοστεί σε διαφορετικές ανάγκες. Το Apple Macintosh
δημιουργεί ένα σημείο αναφοράς για την διάδραση με επιτραπέζια
συστήματα, που στην συνέχεια θα αντιγραφεί από την Microsoft με τα
Windows 95, καθώς και από τα γραφικά περιβάλλοντα των συστημάτων Linux
με τα GNOME, KDE. Ο χρήστης μπορεί με το ποντίκι να εξερευνήσει τις
εφαρμογές και τα έγγραφα του συστήματος, ενώ δεν χρειάζεται να θυμάται
εντολές αφού μπορεί να τις ανακαλύψει σταδιακά μέσα από μενού, φόρμες,
και παλέτες εργαλείων. Η δημιουργία εφαρμογών που βασίζονται στις ίδιες
βιβλιοθήκες και σε κάποιους βασικούς κανόνες ενισχύει ακόμη περισσότερο
την ευχρηστία του συστήματος, αφού ακόμη και μια νέα εφαρμογή έχει
πολλές διαδράσεις παρόμοιες με προηγούμενες, όπως το άνοιγμα,
αποθήκευση, και εκτύπωση εγγράφων. Η διάκριση ανάμεσα στις εφαρμογές και
στο λειτουργικό σύστημα δημιουργεί τα θεμέλια για ένα σύστημα διάδρασης
που θα διατηρηθεί και θα επεκταθεί ακόμη περισσότερο με τα κινητά και
φορετά συστήματα διάδρασης των επόμενων δεκαετιών. <a href="#fn7"
id="fnref7" class="footnote-ref" role="doc-noteref"><sup>7</sup></a> <a
href="#fn8" id="fnref8" class="footnote-ref"
role="doc-noteref"><sup>8</sup></a></p>
<figure id="fig:apple-newton">
<img src="../images/apple-newton.jpg"
alt="Πολύ πριν την επιτυχία του iPad, το Apple Newton προσπάθησε να προσφέρει εύχρηστη διάδραση σε κινητή μορφή για μαθητές και εργαζόμενους βασιζόμενο στην φυσική διάδραση της γραφής, η οποία όμως εκείνη την εποχή δεν είχε την αναγκαία ακρίβεια." />
<figcaption aria-hidden="true">Πολύ πριν την επιτυχία του iPad, το Apple
Newton προσπάθησε να προσφέρει εύχρηστη διάδραση σε κινητή μορφή για
μαθητές και εργαζόμενους βασιζόμενο στην φυσική διάδραση της γραφής, η
οποία όμως εκείνη την εποχή δεν είχε την αναγκαία ακρίβεια.</figcaption>
</figure>
<figure id="fig:iphone-jobs">
<img src="../images/iphone-jobs.jpg"
alt="Η εισαγωγή του πρώτου iphone αποτελεί σημείο αναφοράς καθώς μέσα σε λιγότερο από δέκα χρόνια περισσότεροι άνθρωποι θα είχαν μια παρόμοια κινητή συσκευή με οθόνη αφής ως βασικό σύστημα καθημερινής διάδρασης, παρά τον παραδοσιακό επιτραπέζιο υπολογιστή, ο οποίος θα κρατήσει την θέση του περισσότερο ως υπολογιστής ανάπτυξης." />
<figcaption aria-hidden="true">Η εισαγωγή του πρώτου iphone αποτελεί
σημείο αναφοράς καθώς μέσα σε λιγότερο από δέκα χρόνια περισσότεροι
άνθρωποι θα είχαν μια παρόμοια κινητή συσκευή με οθόνη αφής ως βασικό
σύστημα καθημερινής διάδρασης, παρά τον παραδοσιακό επιτραπέζιο
υπολογιστή, ο οποίος θα κρατήσει την θέση του περισσότερο ως υπολογιστής
ανάπτυξης.</figcaption>
</figure>
<p>Η διαδραστική τηλεόραση είναι μια προσπάθεια για την βελτίωση ενός
παραδοσιακού μέσου που έχει κατηγορηθεί για την δημιουργία παθητικότητας
από την πλευρά του τηλεθεατή. Από τις αρχές της δεκαετίας του 1990,
πολλές εταιρείες και ερευνητικές ομάδες προσθέτουν τεχνολογίες διάδρασης
σε τηλεοπτικούς δέκτες, έτσι ώστε τα ωφέλη της διάδρασης να μην
βρίσκονται μόνο στους επιτραπέζιους υπολογιστές. Αρχικά οι περισσότερες
προσπάθειες μετέφεραν την λειτουργικότητα των επιτραπέζιων εφαρμογών
στον τηλεοπτικό δέκτη, όπως την ηλεκτρονική αλληλογραφία και την
περιήγηση στον παγκόσμιο ιστό. Σταδιακά οι σχεδιαστές κατανόησαν πως το
πλαίσιο και οι στόχοι χρήσης της διαδραστικής τηλεόρασης δεν είναι
καθόλου ίδιοι με αυτούς του επιτραπέζιου υπολογιστή. Ο τηλεοπτικός
δέκτης βρίσκεται συνήθως σε ένα σαλόνι και οι χρήστες παρακολουθούν από
απόσταση και με παρέα προγράμματα που έχουν μια σημαντική ψυχαγωγική
διάσταση. Με αυτόν τον τρόπο, η διάδραση πήρε μια λιγότερο κυριαρχική
θέση ως συμπλήρωμα της ροής οπτικοακουστικού περιεχομένου, με εφαρμογές
ψηφοφορίας, μηνυμάτων, και πρόσθετης πληροφορίας.</p>
<p>Την ίδια περίοδο που η τηλεόραση γίνεται περισσότερο διαδραστική,
αναδύεται μια νέα μορφή προσωπικού συστήματος διάδρασης με την ονομασία
έξυπνο τηλέφωνο, το οποίο θα γίνει σύντομα η πιο δημοφιλής διαδραστική
συσκευή. Οι πρώτες προσπάθειες στην κατασκευή φορητών συστημάτων
μεγέθους παλάμης είχαν ασύμβατα στοιχεία διάδρασης, τα οποία ήταν
συνήθως απευθείας δανεισμένα από τα επιτραπέζια συστήματα, όπως ακριβώς
και στην περίπτωση της διαδραστικής τηλεόρασης. Στην πορεία όμως το
έξυπνο τηλέφωνο με οθόνη αφής θα ϋοθετήσει την ιδέα των εφαρμογών από τα
επιτραπέζια συστήματα σε μια περισσότερο απλή μορφή και με έμφαση στο
οπτικοακουστικό περιεχόμενο. Με αυτόν τον τρόπο, πολύ χρήστες θα
αποκτήσουν πρόσβαση σε διαδραστική πληροφορία και επικοινωνία με μια
φορητή συσκευή με κύρια στοιχεία όχι τόσο το τηλέφωνο, αλλά κυρίως την
ασύρματη πρόσβαση σε δίκτυα δεδομένων, καθώς και την κάμερα και
γεωγραφική θέση, τα οποία θα αποτελέσουν δομικά στοιχεία διάδρασης με
τις κινητές εφαρμογές. Σε πολύ σύντομο χρονικό διάστημα από την εμφάνιση
του, το έξυπνο τηλέφωνο θα αρχίσει να χρησιμοποιείται λιγότερο ως
τηλέφωνο και περισσότερο ως τερματικό κατανάλωσης περιεχομένου, κάτι
δηλαδή που ήταν ένα από τα κακά χαρακτηριστικά της παραδοσιακής
τηλεόρασης. <a href="#fn9" id="fnref9" class="footnote-ref"
role="doc-noteref"><sup>9</sup></a> <a href="#fn10" id="fnref10"
class="footnote-ref" role="doc-noteref"><sup>10</sup></a></p>
<section id="footnotes" class="footnotes footnotes-end-of-section"
role="doc-endnotes">
<hr />
<ol>
<li><div id="fn1">
<p>fig:macintosh-desktop<a href="#fnref1" class="footnote-back"
role="doc-backlink">↩︎</a></p>
</div></li>
<li><div id="fn2">
<p>fig:tmux-desktop<a href="#fnref2" class="footnote-back"
role="doc-backlink">↩︎</a></p>
</div></li>
<li><div id="fn3">
<p><span class="citation" data-cites="freiberger1984fire">Freiberger και
Swaine (1984)</span><a href="#fnref3" class="footnote-back"
role="doc-backlink">↩︎</a></p>
</div></li>
<li><div id="fn4">
<p>fig:apple2<a href="#fnref4" class="footnote-back"
role="doc-backlink">↩︎</a></p>
</div></li>
<li><div id="fn5">
<p>fig:visicalc<a href="#fnref5" class="footnote-back"
role="doc-backlink">↩︎</a></p>
</div></li>
<li><div id="fn6">
<p><span class="citation" data-cites="hertzfeld2004revolution">Hertzfeld
(2004)</span><a href="#fnref6" class="footnote-back"
role="doc-backlink">↩︎</a></p>
</div></li>
<li><div id="fn7">
<p>fig:xerox-parc-tab<a href="#fnref7" class="footnote-back"
role="doc-backlink">↩︎</a></p>
</div></li>
<li><div id="fn8">
<p>fig:tabs-pads-boards<a href="#fnref8" class="footnote-back"
role="doc-backlink">↩︎</a></p>
</div></li>
<li><div id="fn9">
<p>fig:apple-newton<a href="#fnref9" class="footnote-back"
role="doc-backlink">↩︎</a></p>
</div></li>
<li><div id="fn10">
<p>fig:iphone-jobs<a href="#fnref10" class="footnote-back"
role="doc-backlink">↩︎</a></p>
</div></li>
</ol>
</section>
<h2 id="πέρα-από-τον-υπολογισμό">Πέρα από τον υπολογισμό</h2>
<p>Οι πρώτοι κεντρικοί υπολογιστές προγραμματίζονταν με διάτρητες
κάρτες, γιατί αυτή ήταν μια έμπιστη τεχνολογία που είχε χρησιμοποιηθεί
ήδη για πολλές δεκαετίες σε άλλες εφαρμογές όπως η κλωστοϋφαντουργία και
η απογραφή του πληθυσμού. <a href="#fn11" id="fnref11"
class="footnote-ref" role="doc-noteref"><sup>11</sup></a> Παράλληλα, η
συγγενική τεχνολογία της διάτρητης ταινίας χρησιμοποιήθηκε για την
αποθήκευση μεγαλύτερων προγραμμάτων και δεδομένων, καθώς και για την
ανάλυση εργαστηριακών πειραμάτων. <a href="#fn12" id="fnref12"
class="footnote-ref" role="doc-noteref"><sup>12</sup></a> Αν και ο
υπολογιστής αριστεύει στην αποδοτική εκτέλεση υπολογισμών, αυτό δεν
είναι μόνη εφαρμογή του, αφού μπορεί να προσομοιώσει και κυρίως να
εξομοιώσει νέα συστήματα που βασίζονται μεν στον υπολογισμό, αλλά
παρουσιάζουν μια διαφορετική εικόνα στον χρήστη, έτσι ώστε να ταιριάζει
στις ανάγκες και τις δυνατότητες του.<a href="#fn13" id="fnref13"
class="footnote-ref" role="doc-noteref"><sup>13</sup></a></p>
<figure id="fig:card-puncher">
<img src="../images/card-puncher.jpg"
alt="Τα συστήματα διάτρησης κάρτας υπάρχουν από τον 19ο αιώνα με βασικές εφαρμογές τον προγραμματισμό και αποθήκευση δεδομένων για μηχανήματα πλεξίματος και αναπαραγωγής μουσικής, οπότε υπήρχε η τεχνογνωσία για την προσαρμογή τους ως συσκευές εισόδου στους πρώτους κεντρικούς ηλεκτρονικούς υπολογιστές." />
<figcaption aria-hidden="true">Τα συστήματα διάτρησης κάρτας υπάρχουν
από τον 19ο αιώνα με βασικές εφαρμογές τον προγραμματισμό και αποθήκευση
δεδομένων για μηχανήματα πλεξίματος και αναπαραγωγής μουσικής, οπότε
υπήρχε η τεχνογνωσία για την προσαρμογή τους ως συσκευές εισόδου στους
πρώτους κεντρικούς ηλεκτρονικούς υπολογιστές.</figcaption>
</figure>
<figure id="fig:linc-pc">
<img src="../images/linc-pc.jpg"
alt="O LINC (Laboratory INstrument Computer) θεωρείται ο πρώτος προσωπικός υπολογιστής, γιατί σε έναν σχετικά μικρό όγκο περιλαμβάνει συσκευή εξωτερικής αποθήκευσης και κυρίως οθόνη και πληκτρολόγιο ως σύστημα εξόδου και εισόδου. Σε αντίθεση με τους μεγάλους κεντρικούς υπολογιστές εκείνης της εποχής, ήταν σχεδιασμένος από την αρχή σε συναρμολογούμενη μορφή, οπότε ήταν σχετικά προσιτός σε πολλά ερευνητικά εργαστήρια που είχαν τις δεξιότητες να τον κατασκευάσουν και να τον συντηρήσουν." />
<figcaption aria-hidden="true">O LINC (Laboratory INstrument Computer)
θεωρείται ο πρώτος προσωπικός υπολογιστής, γιατί σε έναν σχετικά μικρό
όγκο περιλαμβάνει συσκευή εξωτερικής αποθήκευσης και κυρίως οθόνη και
πληκτρολόγιο ως σύστημα εξόδου και εισόδου. Σε αντίθεση με τους μεγάλους
κεντρικούς υπολογιστές εκείνης της εποχής, ήταν σχεδιασμένος από την
αρχή σε συναρμολογούμενη μορφή, οπότε ήταν σχετικά προσιτός σε πολλά
ερευνητικά εργαστήρια που είχαν τις δεξιότητες να τον κατασκευάσουν και
να τον συντηρήσουν.</figcaption>
</figure>
<p>Ένας από τους πιο σημαντικούς μορφολογικούς μετασχηματισμούς ήταν η
δημιουργία του Sketchpad στο MIT από τον Ivan Sutherland το 1963. Ο
κεντρικός υπολογιστής που είχε στην διάθεση του μπορούσε να
προγραμματιστεί με διάτρητες κάρτες και η βασική αλληλεπίδραση γινόταν
σε εργασίες δέσμης, όπου υπήρχε ένας σημαντικός ετεροχρονισμός ανάμεσα
στην ανάγνωση του προγράμματος και στην τελική εκτύπωση του
αποτελέσματος. Αντίθετα, το Sketchpad εστιάζει στην διάδραση σε
πραγματικό χρόνο με χρήση πένας και οθόνης, όπου τα γραφικά ελέγχονται
τόσο από την πένα, όσο και από τον υπολογιστή σε πραγματικό χρόνο,
δίνοντας έτσι μια από τις πρώτες εμπειρίες συμβίωσης ανάμεσα στον
άνθρωπο και την μηχανή. Αν και αυτή η υπέρβαση φαίνεται πολύ μεγάλη, ήδη
υπήρχαν σε χρήση οι επιμέρους τεχνολογίες για διαφορετικούς σκοπούς,
όπως η είσοδος με πένα αντί για διάτρητες κάρτες και η έξοδος σε οθόνη,
αντί για εκτύπωση σε χαρτί. Πράγματι, την ίδια περίοδο, οι μεταπτυχιακοί
ερευνητές στο MIT χρησιμοποιούν τους μεγάλους υπολογιστές της εποχής για
να φτιάξουν διαδραστικά προγράμματα όπως τα ψυχαγωγικά τρίλιζα,
λαβύρινθος, και Spacewar ή την πολύ ακριβή γραφομηχανή. Το συμπέρασμα
είναι ότι ο μορφολογικός μετασχηματισμός συμβαίνει με σταδιακές
μετατροπές και περισσότερο ως δημιουργική σύνθεση τεχνολογιών που ήδη
υπάρχουν, παρά ως καινοτομία χωρίς προηγούμενο. <a href="#fn14"
id="fnref14" class="footnote-ref" role="doc-noteref"><sup>14</sup></a>
<a href="#fn15" id="fnref15" class="footnote-ref"
role="doc-noteref"><sup>15</sup></a></p>
<p>Το αρχικό όραμα για το Dynabook ήταν η δημιουργία ενός φορητού
συστήματος διάδρασης για παιδιά, που μορφολογικά έμοιαζε με τους
σύγχρονους υπολογιστές ταμπλέτας. Το λογισμικό διάδρασης του όμως δεν
είχε τίποτα κοινό με αυτό που έχουν οι σύγχρονες ταμπλέτες iOS, Android.
Ο στόχος του Dynabook ήταν να δημιουργήσει μια νέα μορφή ψηφιακού
αλφαβητισμού, η οποία βασίζεται στην ανάγνωση του πηγαίου κώδικα που
έχουν γράψει άλλοι, στην μετατροπή και κατανόηση του, και τελικά στην
ανάπτυξη πρωτότυπων διαδραστικών έργων λογισμικού, ως μια νέα μορφή
λογοτεχνίας. Για αυτόν τον σκοπό, ο Άλαν Κέη και η ομάδα του
δημιούργησαν το λογισμικό Smalltalk, το οποίο είχε ως βασική προδιαγραφή
την δυνατότητα υλοποίησης του δημοφιλούς βιντεοπαιχνιδιού Spacewar με
σχετικά μικρή προσπάθεια και λίγο κώδικα. Ο προγραμματισμός του
Spacewar, εκτός από την διασκέδαση του ίδιου του παιχνιδιού με έναν
συμπαίκτη, έδινε πρόσβαση σε ένα περιβάλλον προσομοίωσης της βαρύτητας.
Με άλλα λόγια, ο χρήστης του Dynabook δεν ήταν απλά ένας καταναλωτής
βιντεοπαιχνιδιών που αγόραζε, αλλά ήταν κάποιος που θα μελετούσε την
κατασκευή τους, θα έκανε μετατροπές, και τελικά θα άρχιζε να φτιάχνει τα
δικά του παιχνίδια και προσομοιώσεις για άλλα φυσικά ή τεχνητά
φαινόμενα.</p>
<p>Το λογισμικό και το υλικό διάδρασης των δημοφιλών επιτράπεζιων
συστημάτων δημιουργήθηκε ως ένα ενδιάμεσο πρωτότυπο, αλλά τελικά
εδραιώθηκε ειδικά στον χώρο του γραφείου και της εργασίας.<a
href="#fn16" id="fnref16" class="footnote-ref"
role="doc-noteref"><sup>16</sup></a> Το επιτραπέζιο σύστημα Xerox Alto
δημιουργήθηκε ως ένα ενδιάμεσο πρωτότυπο για το Dynabook, γιατί ήταν ένα
εφικτό ενδιάμεσο βήμα από τους μίνι-υπολογιστές του 1970 προς την
μελλοντική κατεύθυνση φορητών μορφών. Ο βασικός στόχος ήταν η ανάπτυξη
λογισμικού στο περιβάλλον Smalltalk και οι δοκιμές με παιδιά, έτσι ώστε
να βελτιωθεί η κατανόηση των ερευνητών για αυτόν τον σχεδιαστικό χώρο.
Τα εδραιωμένα εμπορικά συμφέροντα στον χώρο των εκδόσεων της μητρικής
εταιρείας Xerox οδήγησαν τελικά στην δημιουργία του Star, το οποίο
απευθύνεται στον χώρο του γραφείου. Με την σειρά της, η Apple παρουσίασε
το σύστημα Macintosh για ένα ευρύτερο κοινό, το οποίο εκτός από τις
εφαρμογές γραφείου ενδιαφέρεται επίσης για την δημιουργικότητα και την
ψυχαγωγία. Με αυτόν τον τρόπο, ένα πειραματικό σύστημα για την
εκπαίδευση, τελικά βρίσκεται στο γραφείο με πολύ διαφορετικό λογισμικό,
γιατί μια σειρά από οργανισμοί είχαν διαφορετικά κίνητρα και συμφέροντα,
και όχι γιατί η επιφάνεια εργασίας είναι ο αντικειμενικά καλύτερος
τρόπος διάδρασης για τις διεργασίες του γραφείου.</p>
<p>Η διαθεσιμότητα οικονομικών μικροεπεξεργαστών στις αρχές της
δεκαετίας του 1970 επέτρεψε σε πολλές νέες μικρές εταιρείες να
κατασκευάσουν προσιτούς μικροϋπολογιστές δημιουργόντας έτσι μια νέα
αγορά που καμία από τις μεγάλες εταιρείες εκείνης της εποχής όπως οι
IBM, DEC, Xerox, δεν μπορούσαν να φανταστούν. Εκείνη την εποχή, η πιο
γρήγορα αναπτυσόμενη εταιρεία υπολογιστών ήταν η DEC, η οποία έφτιαχνε
οικονομικούς μίνι-υπολογιστές για πολύπλοκο λογισμικό χρονοκαταμερισμού,
που ήταν πολύ δημοφιλές στα πανεπιστήμια και στις μικρές εταιρείες, ενώ
οι μεγαλύτεροι οργανισμοί συνήθως προτιμούσαν έναν κεντρικό υπολογιστή
της IBM. Όπως ακριβώς ο διευθυντής της IBM έκανε την λανθασμένη πρόβλεψη
το 1958, ότι ο κόσμος δεν χρειάζεται περισσότερους από δέκα υπολογιστές,
έτσι ακριβώς και ο διευθυντής της DEC, ο οποίος διέψευσε την προφητεία
της IBM με εκατοντάδες μίνι-υπολογιστές, ήρθε με την σειρά του να κάνει
μια λάθος πρόβλεψη το 1977, ότι, δηλαδή, κανείς άνθρωπος δεν χρειάζεται
έναν προσωπικό υπολογιστή στο σπίτι του. Ήδη είχε εμφανιστεί ο πρώτος
συναρμολογούμενος μικροϋπολογιστής, οποίος μπορούσε να προγραμματιστεί
για την εκτέλεση του βιντεοπαιχνιδιού Lunar Lander, με την βοήθεια της
BASIC, που ήταν το πρώτο προϊόν της νέας εταιρείας Microsoft. Αρχικά ο
Altair απευθυνόταν κυρίως σε χομπίστες ηλεκτρονικών κατασκευών που απλά
ήθελαν έναν πιο ευέλικτο σταθμό εργασίας. Η δυνατότητα του όμως να
εκτελεί διαφορετικά προγράμματα λογισμικού τον μετέτρεψε σε ένα κομβικό
σημείο για την δημιουργία μιας νέας κατηγορίας προσιτών προσωπικών
υπολογιστών, αφού πολλές νέες μικρές εταιρείες θα δημιουργηθούν για να
εκμεταλευτούν τις ευκαιρίες σε υλικό και λογισμικό μικρής κλίμακας, όπως
οι Apple, Microsoft, Commodore, Digital Research.<a href="#fn17"
id="fnref17" class="footnote-ref"
role="doc-noteref"><sup>17</sup></a></p>
<p>Τα περισότερα συστήματα με γραφική διεπαφή χρησιμοποιούν την
επιφάνεια εργασίας, τις εφαρμογές, και τα αρχεία εγγράφων ως την βασική
μορφή λογισμικού διάδρασης, αλλά όλα αυτά δεν είναι παρά μόνο μια εκδοχή
της διάδρασης που μπορούμε να έχουμε για τις δουλειές του γραφείου.
Παράλληλα με την κατασκευή του Lisa, μια ομάδα της Apple, κατασκευάζει
ένα αρχικό προσχέδιο του Macintosh, υπό την καθοδήγηση του Jef Raskin.
Σε αντίθεση με το Lisa, που απευθύνεται στην εταιρική αγορά του
γραφείου, το Macintosh αρχικά στοχεύει στην επεξεργασία κειμένου, που
θεωρείται η πιο χρήσιμη λειτουργία των υπολογιστών και απευθύνεται σε
όλους, δηλαδή σε σχολεία, σπίτια, γραφεία. Για τον σκοπό αυτό, ο Jef
Raskin κατασκευάζει ένα μηχάνημα που είναι πολύ οικονομικό και απλό στην
χρήση του και δεν περιλαμβάνει ούτε λειτουργικό σύστημα, ούτε εφαρμογές,
ούτε αρχεία. Το λειτουργικό πρωτότυπο βασίζεται, όπως ακριβώς και το
Lisa, σε μια κάρτα επέκτασης του δημοφιλούς Apple II, αλλά δεν
περιλαμβάνει ούτε γραφικό περιβάλλον με παράθυρα, ούτε είσοδο με
ποντίκι. Η διάδραση βασίζεται στο πληκτρολόγιο, με το οποίο χρήστης
επεξεργάζεται έγγραφα, τα οποία αποθηκεύονται αυτόματα σε μια δισκέτα, η
οποία αποτελεί την φυσική αναπαράσταση του εγγράφου χωρίς να μεσολαβεί η
έννοια του αρχείου. Η πιο σημαντική διαφορά από τα συστήματα διάδρασης
εκείνης της εποχής, αλλά και όσα ακολούθησαν, είναι ότι αντί για
εφαρμογές και λειτουργικό σύστημα, χρησιμοποιεί μια συλλογή από εντολές,
οι οποίες μπορούν να εφαρμοστούν πάνω στο έγγραφο κειμένου, παρόμοια με
τα συστήματα UNIX. Αν και αυτή η φιλοσοφία διάδρασης δεν εφαρμόστηκε
τελικά στην εμπορική εκδοχή του Macintosh, o Jef Raskin εφάρμοσε αυτές
τις ιδέες λίγο αργότερα στα εμπορικά προϊόντα SwyftCard, Canon Cat και
Archy.</p>
<p>Με την εξαίρεση του Jef Raskin, για τους περισσότερους κατασκευαστές
διάδρασης και σίγουρα για όλους τους χρήστες θεωρείται δεδομένο ότι τα
αρχεία, οι εφαρμογές, και το λειτουργικό σύστημα είναι θεμελιώδη
συστατικά. Παρόμοια και για τον Alan Kay και την ομάδα του αρχικά στο
Xerox PARC και αργότερα στην Disney, η αρχιτεκτονική ενός διαδραστικού
συστήματος παραμένει ανοιχτή σε ερμηνείες και σε κατευθύνσεις. Όπως στο
περιβάλλον Smalltalk δεν υπάρχει η διάκριση ανάμεσα σε εφαρμογές και
λειτουργικό σύστημα, έτσι και στο νέο περιβάλλον Squeak δεν υπάρχουν
αυτές οι έννοιες, ούτε τα αρχεία.<a href="#fn18" id="fnref18"
class="footnote-ref" role="doc-noteref"><sup>18</sup></a> Η βασική
θεμελίωση του συστήματος Squeak γίνεται με την έννοια του αντικειμένου
που στέλνει μηνύματα σε άλλα αντικείμενα. Με αυτόν τον τρόπο, όλα τα
γραφικά στοιχεία του συστήματος είναι αντικείμενα, τα οποία μπορούν να
προγραμματιστούν σε πραγματικό χρόνο. Όπως ακριβώς στα συστήματα UNIX
όλα είναι αρχεία, έτσι ακριβώς και στο σύστημα Squeak όλα είναι
αντικείμενα που μπορούν να αναγνωρίσουν κάποια μηνύματα από άλλα
αντικείμενα. Ο απλός χρήστης οργανώνει το γραφικό περιβάλλον σε
επιμέρους περιοχές έργων, όπου όλα τα διαθέσιμα εργαλεία μπορούν να
εφαρμοστούν σε όλο το διαθέσιμο οπτικοακουστικό περιεχόμενο, χωρίς να
γίνεται κάποια διάκριση ανάμεσα σε διαφορετικά είδη περιεχομένου ή
διαφορετικά είδη εφαρμογής, αφού ο γραφικός χώρος εργασίας είναι
ενιαίος. Αυτό το περιβάλλον διάδρασης επιτρέπει στον χρήστη να κάνει
πολύ περισσότερα λάθη, ενώ για την καλύτερη χρήση του θα πρέπει να
υπάρχει γνώση της γλώσσας προγραμματισμού του συστήματος που είναι μια
εξέλιξη της Smalltalk. Το τίμημα της αρχικά αυξημένης δυσκολίας χρήσης
είναι η μεγαλύτερη δημιουργικότητα πέρα από τα όρια που θέτουν τα
συμφέροντα των κατασκευαστών εφαρμογών.</p>
<figure id="fig:electrocular">
<img src="../images/electrocular.jpg"
alt="Η προβολή βίντεο πάνω σε έναν διάφανο φακό που βρίσκεται στερεωμένος σε ένα κράνος πιλότου ελικοπτέρου χρησιμοποιήθηκε από τον στρατό για να διευκολύνει την προσγείωση ελικοπτέρων με την βοήθεια κάμερας σε δύσκολες συνθήκες. Αυτό το σύστημα επεκτάθηκε τα επόμενα χρόνια ώστε, αντί για βίντεο, να προβάλει γραφικά, τα οποία μετασχηματίζονταν ανάλογα με την κίνηση του κεφαλιού." />
<figcaption aria-hidden="true">Η προβολή βίντεο πάνω σε έναν διάφανο
φακό που βρίσκεται στερεωμένος σε ένα κράνος πιλότου ελικοπτέρου
χρησιμοποιήθηκε από τον στρατό για να διευκολύνει την προσγείωση
ελικοπτέρων με την βοήθεια κάμερας σε δύσκολες συνθήκες. Αυτό το σύστημα
επεκτάθηκε τα επόμενα χρόνια ώστε, αντί για βίντεο, να προβάλει γραφικά,
τα οποία μετασχηματίζονταν ανάλογα με την κίνηση του
κεφαλιού.</figcaption>
</figure>
<figure id="fig:damocles-sword">
<img src="../images/damocles-sword.jpg"
alt="Tο Σπαθί του Δαμοκλή θεωρείται μια θεμελιώδης τεχνολογία για την δημιουργία της εικονικής πραγματικότητας, όπου τα γραφικά στην οθόνη ακολουθούν την κίνηση του κεφαλιού. Το αρχικό σύστημα βασιζόταν στην προβολή βίντεο από μια βιντεοκάμερα που βρισκόταν στην βάση ενός ελικοπτέρου έτσι ώστε να διευκολύνει την προσγείωση σε δύσκολες συνθήκες." />
<figcaption aria-hidden="true">Tο Σπαθί του Δαμοκλή θεωρείται μια
θεμελιώδης τεχνολογία για την δημιουργία της εικονικής πραγματικότητας,
όπου τα γραφικά στην οθόνη ακολουθούν την κίνηση του κεφαλιού. Το αρχικό
σύστημα βασιζόταν στην προβολή βίντεο από μια βιντεοκάμερα που βρισκόταν
στην βάση ενός ελικοπτέρου έτσι ώστε να διευκολύνει την προσγείωση σε
δύσκολες συνθήκες.</figcaption>
</figure>
<p>Ένα από τα πιο σημαντικά ερευνητικά παραδείγματα διάδρασης στον χώρο
της εργασίας χωρίς λειτουργικό σύστημα, εφαρμογές, και αρχεία,
δημιουργήθηκε από το Αγγλικό παράρτημα του Xerox PARC στις αρχές της
δεκαετίας του ενενήντα. Την ίδια περίοδο που τα κεντρικά του PARC στην
Καλιφόρνια εξερευνούσαν τις τεχνολογίες διάδρασης με τον διάχυτο
υπολογισμό, η ερευνητική ομάδα στο Κέμπριτζ δοκίμαζε μια εναλλακτική
κατεύθυνση για το ψηφιακό γραφείο του μέλλοντος. Αν και το Xerox PARC με
τον επιτραπέζιο Star και τον επεξεργαστή κειμένου Bravo είχε ήδη
καθορίσει την μορφή του σύγχρονου ψηφιακού γραφείου οι ερευνητές
γνώριζαν καλύτερα από τους χρήστες ότι αυτά τα συστήματα διάδρασης δεν
ήταν μονοσήμαντα. Μια εναλλακτική κατεύθυνση για την διάδραση στην
πραγματική επιφάνεια εργασίας είναι η επαύξηση των αντικειμένων του
γραφείου και όχι η αντικατάσταση τους με προσομοιωμένες μορφές στον
υπολογιστή. Πράγματι, με την χρήση της υπολογιστικής όρασης και ενός
προβολέα που βρίσκονται πάνω από το γραφείο είναι εφικτή η επαύξηση του
φυσικού χαρτιού, πάνω στο οποίο μπορούν να προβάλονται δυναμικά γραφικά.
Το φυσικό χαρτί και η γραφή με το χέρι παραμένουν στο γραφείο, το οποίο
επαυξάνεται με τις δυνατότητες του υπολογιστή και της κάμερας που είναι
η βασική συσκευή εισόδου. Τα συστήματα επαυξημένης πραγματικότητας
αποτελούν ένα παράδειγμα διάδρασης που βασίζεται περισσότερο στην
σύζευξη με τον πραγματικό κόσμο, παρά με την προσομοίωση ή την
αντικατάσταση του με μια εικονική πραγματικότητα.</p>
<p>Τα συστήματα εικονικής πραγματικότητας αποτελούν μια ιδιαίτερη μορφή
διάδρασης, αφού δεν παρουσιάζουν συγγένειες με τα αντίστοιχα συστήματα
εισόδου και εξόδου και τις γραφικές διεπαφές. Η κατασκευή των πρώτων
συστημάτων εικονικής πραγματικότητας από την ομάδα του Jaron Lanier στα
τέλη της δεκαετίας του 1980 ξεκίνησε με βασικό κίνητρο ένα αντίβαρο στην
δημοφιλία των συστημάτων τεχνητής νοημοσύνης.<a href="#fn19"
id="fnref19" class="footnote-ref" role="doc-noteref"><sup>19</sup></a>
Τα συστήματα τεχνητής νοημοσύνης μετά την αρχική τους σχεδίαση και την
περιστασιακή ενημέρωση τους δεν έχουν ανάγκη ανθρώπινης διάδρασης για να
λειτουργήσουν. Αντίθετα, το αρχικό όραμα για τα συστήματα εικονικής
πραγματικότητας βασίζεται στην συνεχή ανθρώπινη παρουσία και διάδραση
μέσω του υπολογιστή με έναν εικονικό κόσμο καθώς και με τις
αναπαραστάσεις άλλων χρηστών. Τόσο οι αναπαραστάσεις των χρηστών όσο και
τα εικονικά περιβάλλοντα αρχικά σχεδιάζονται με δημιουργικούς τρόπους
πέρα από την προσομοίωση της πραγματικότητας. Για παράδειγμα, ένας
χρήστης μπορεί να εμφανιστεί στην εικονική πραγματικότητα με την μορφή
κάποιου ζώου ή κάποιου κυτάρου και να προσπαθήσει να αλληλεπιδράσει
κάνοντας μια χαρτογράφηση ανάμεσα στα διαθέσιμα συστήματα εισόδου και
στις δυνατότητες κίνησης της αντίστοιχης αναπαραστάσης. Τελικά, η
εικονική πραγματικότητα απομακρύνθηκε από το αρχικό όραμα, όπου η έμφαση
ήταν στον άνθρωπο και στην δημιουργικότητα προς την εμπορική κατεύθυνση
της προσομοίωσης και κυρίως της πιστής απεικόνισης παρά της
διάδρασης.</p>
<section id="footnotes" class="footnotes footnotes-end-of-section"
role="doc-endnotes">
<hr />
<ol start="11">
<li><div id="fn11">
<p>fig:card-puncher<a href="#fnref11" class="footnote-back"
role="doc-backlink">↩︎</a></p>
</div></li>
<li><div id="fn12">
<p>fig:linc-pc<a href="#fnref12" class="footnote-back"
role="doc-backlink">↩︎</a></p>
</div></li>
<li><div id="fn13">
<p>denning1998beyond<a href="#fnref13" class="footnote-back"
role="doc-backlink">↩︎</a></p>
</div></li>
<li><div id="fn14">
<p>fig:electrocular<a href="#fnref14" class="footnote-back"
role="doc-backlink">↩︎</a></p>
</div></li>
<li><div id="fn15">
<p>fig:damocles-sword<a href="#fnref15" class="footnote-back"
role="doc-backlink">↩︎</a></p>
</div></li>
<li><div id="fn16">
<p><span class="citation" data-cites="waldrop2001dream">Waldrop
(2001)</span><a href="#fnref16" class="footnote-back"
role="doc-backlink">↩︎</a></p>
</div></li>
<li><div id="fn17">
<p><span class="citation" data-cites="nelson2008geeks">Nelson
(2008)</span><a href="#fnref17" class="footnote-back"
role="doc-backlink">↩︎</a></p>
</div></li>
<li><div id="fn18">
<p><span class="citation" data-cites="kay1977personal">Kay και Goldberg
(1977)</span><a href="#fnref18" class="footnote-back"
role="doc-backlink">↩︎</a></p>
</div></li>
<li><div id="fn19">
<p><span class="citation" data-cites="lanier2017dawn">Lanier
(2017)</span><a href="#fnref19" class="footnote-back"
role="doc-backlink">↩︎</a></p>
</div></li>
</ol>
</section>
<h2 id="συνεργατικό-οικοσύστημα-διεπαφών">Συνεργατικό οικοσύστημα
διεπαφών</h2>
<figure id="fig:xerox-pad-board">
<img src="../images/xerox-pad-board.jpg"
alt="Η επικονωνία ανάμεσα στην συσκευή Tab και Board έχει πολλές συνεργατικές εφαρμογές όπως σε αίθουσες συναντήσεων καθώς και σε αίθουσες διδασκαλίας." />
<figcaption aria-hidden="true">Η επικονωνία ανάμεσα στην συσκευή Tab και
Board έχει πολλές συνεργατικές εφαρμογές όπως σε αίθουσες συναντήσεων
καθώς και σε αίθουσες διδασκαλίας.</figcaption>
</figure>
<figure id="fig:xerox-liveboard">
<img src="../images/xerox-liveboard.jpg"
alt="Το τρίτο και μεγαλύτερο σε μέγεθος μέλος της οικογένειας του διάχυτου υπολογισμού του Xerox PARC είναι το Liveboard. Βασίζεται στην είσοδο με πένα και προσομοιώνει τις λειτουργίες των σημειώσεων και της παρουσίασης σε μια μεγάλη οθόνη τοίχου, έτσι ώστε οι ομάδες συνεργασίας να μπορούν να μεταφέρουν χρήσιμη πληροφορία από τα προσωπικά τερματικά τους." />
<figcaption aria-hidden="true">Το τρίτο και μεγαλύτερο σε μέγεθος μέλος
της οικογένειας του διάχυτου υπολογισμού του Xerox PARC είναι το
Liveboard. Βασίζεται στην είσοδο με πένα και προσομοιώνει τις
λειτουργίες των σημειώσεων και της παρουσίασης σε μια μεγάλη οθόνη
τοίχου, έτσι ώστε οι ομάδες συνεργασίας να μπορούν να μεταφέρουν χρήσιμη
πληροφορία από τα προσωπικά τερματικά τους.</figcaption>
</figure>
<p>Η συνεργασία μεταξύ των ανθρώπων και μέσω των υπολογιστών είναι ένα
διαχρονικό θέμα στα συστήματα διάδρασης. <a href="#fn20" id="fnref20"
class="footnote-ref" role="doc-noteref"><sup>20</sup></a> <a
href="#fn21" id="fnref21" class="footnote-ref"
role="doc-noteref"><sup>21</sup></a> Ακόμη και στα πρώτα πολυχρηστικά
συστήμα χρονοδιαμοιρασμού υπάρχουν κοινά αποθετηρία και ανταλλαγή
ηλεκτρονικής αλληλογραφίας, έστω και με ασύγχρονο τρόπο. Το πρώτο
διαδραστικό σύστημα σύχρονης συνεργασίας είναι το NLS του Douglas
Engelbart, όπου οι χρήστες βλέπουν το ίδιο έγγραφο στις προσωπικές
οθόνες και μπορούν να συνεργαστούν στην επεξεργασία του με ενέργειες και
χειρονομίες που γίνονται μέσω πολλαπλών δεικτών που οδηγούνται από το
ποντίκι του κάθε χρήστη.<a href="#fn22" id="fnref22"
class="footnote-ref" role="doc-noteref"><sup>22</sup></a> Χρειάστηκε να
περάσουν τουλάχιστον δύο δεκαετίες από το NLS για να φτάσουμε στο
σύστημα διάχυτου υπολογισμού του PARC, που προσθέτει πολλές διαφορετικές
συσκευές συνεργασίας. Σε όλες αυτές τις περιπτώσεις συνεργασίας ανάμεσα
σε ομάδες ανθρώπων και μηχανών η πιο σημαντική παράμετρος σχεδίασης δεν
είναι η ποιότητα της διεπαφής και η εργονομία της συσκευής, αλλά κυρίως
ένας ισορροπημένος σχεδιασμός του μίγματος επικοινωνίας που γίνεται μέσω
των μηχανών και απευθειάς μεταξύ των ανθρώπων.</p>
<p>Μετά το περιβάλλον εργασίας, οι κοινότητες μάθησης όρισαν διαφορετικά
μίγματα στην συνεργασία ανθρώπων και μηχανών. Η κατασκευή και εκτέλεση
των δημοφιλών βιντεοπαιχνιδιών, αρχικά δεν γινόταν μόνο για ψυχαγωγικούς
σκοπούς, αλλά είχε και εμπορικούς καθώς και εκπαιδευτικούς σκοπούς. Το
βιντεοπαιχνίδι Spacewar δημιουργήθηκε αρχικά για να εξερευνηθούν τα όρια
των δυνατοτήτων διάδρασης σε πραγματικό χρόνο με τον πρωτοεμφανιζόμενο
μίνι-υπολογιστή DEC PDP-1. Το Spacewar στην συνέχεια ήταν σημείο
αναφοράς για την δημιουργία του Dynabook και της Smalltalk από τον Alan
Kay ο οποίος ήθελε τα παιδιά να μπορούν όχι μόνο να διασκεδάσουν, αλλά
να μπορούν και να το υλοποιήσουν σε μια προσβάσιμη για αυτά γλώσσα
προγραμματισμού. Τόσο η Smalltalk, όσο και το Dynabook δεν σχεδιάστηκαν
ανεξάρτητα από το πλαίσιο λειτουργίας τους, αλλά έγιναν με την παραδοχή
ότι τα παιδιά υποστηρίζονται από έναν δάσκαλο και το μαθησιακό υλικό
περιλαμβάνει ένα χαρτοφυλάκιο έτοιμων έργων.</p>
<p>Μερικά χρόνια αργότερα, με παρόμοιο σκεπτικό, ο Paul Allen υλοποιεί
το πρώτο προϊόν της νεοσύστατης Microsoft την πρώτη Basic για τον
συναρμολογούμενο μίκρο-υπολογιστή Altair, έτσι ώστε να μπορεί κάποιος να
κατασκευάσει το δημοφιλές βιντεοπαιχνίδι Lunar Lander. Σχεδόν παράλληλα,
το ίδιο ακριβώς πνεύμα διατρέχει και την δουλειά του Steve Wozniak κατά
την ανάπτυξη του μίκρο-υπολογιστή Apple II και της Apple Basic, τα οποία
υλοποιήθηκαν έτσι ώστε να μπορεί κάποιος να αναπτύξει σχετικά εύκολα το
δημοφιλές βιντεοπαιχνίδι Breakout. Σε όλες αυτές τις περιπτώσεις, ο
στόχος είναι εξερεύνηση και επίδειξη των δυνατοτήτων ενός υπολογιστή,
αλλά και η μάθηση μέσα από την αντιγραφή κώδικα διαθέσιμου σε βιβλία και
περιοδικά, καθώς και η μετατροπή και προσαρμογή του σύμφωνα με τις
προτιμήσεις του κάθε χρήστη.</p>
<figure id="fig:printed-code">
<img src="../images/printed-code.jpg"
alt="Πριν την εξάπλωση του δικτύου και των μέσων αποθήκευσης ο βασικός τρόπος διαμοιρασμού του λογισμικού ήταν σε πηγαίο κώδικα, ο οποίος ήταν τυπωμένος σε χαρτί περιοδικού ή βιβλίου, τα οποία ο χρήστης θα μελετούσε και μετά θα πληκτρολογούσε στον μικροϋπολογιστή του. Αν και η διαδικασία αυτή φαίνεται κάπως ξεπερασμένη, φαίνεται ότι είχε το πλεονέκτημα μια αίσθησης ιδιοκτησίας καθώς και μιας έμμεσης ενθάρρυνσης για σκόπιμες ή ακούσιες μετατροπές, τα οποία τελικά λειτουργούσαν θετικά για τις γνώσεις και δεξιότητες του χρήστη." />
<figcaption aria-hidden="true">Πριν την εξάπλωση του δικτύου και των
μέσων αποθήκευσης ο βασικός τρόπος διαμοιρασμού του λογισμικού ήταν σε
πηγαίο κώδικα, ο οποίος ήταν τυπωμένος σε χαρτί περιοδικού ή βιβλίου, τα
οποία ο χρήστης θα μελετούσε και μετά θα πληκτρολογούσε στον
μικροϋπολογιστή του. Αν και η διαδικασία αυτή φαίνεται κάπως
ξεπερασμένη, φαίνεται ότι είχε το πλεονέκτημα μια αίσθησης ιδιοκτησίας
καθώς και μιας έμμεσης ενθάρρυνσης για σκόπιμες ή ακούσιες μετατροπές,
τα οποία τελικά λειτουργούσαν θετικά για τις γνώσεις και δεξιότητες του
χρήστη.</figcaption>
</figure>
<figure id="fig:c64-demoscene">
<img src="../images/c64-demoscene.jpg"
alt="Η προσιτή τιμή του μικροϋπολογιστή Commodore 64 τον έκανε δημοφιλή σε περισσότερο από δέκα εκατομύρια χρήστες, οι οποίοι εκτός από την αγορά λογισμικού και περιφερειακών, δημιούργησαν μια κοινότητα ερασιτεχνικής δημιουργίας και ανταλλαγής προγραμμάτων και παιχνιδιών, που διατηρήθηκε ως μέρος της ψηφιακής κουλτούρας και μετά την απόσυρση αυτού του μοντέλου." />
<figcaption aria-hidden="true">Η προσιτή τιμή του μικροϋπολογιστή
Commodore 64 τον έκανε δημοφιλή σε περισσότερο από δέκα εκατομύρια
χρήστες, οι οποίοι εκτός από την αγορά λογισμικού και περιφερειακών,
δημιούργησαν μια κοινότητα ερασιτεχνικής δημιουργίας και ανταλλαγής
προγραμμάτων και παιχνιδιών, που διατηρήθηκε ως μέρος της ψηφιακής
κουλτούρας και μετά την απόσυρση αυτού του μοντέλου.</figcaption>
</figure>
<p>Τα πρώτα χρόνια διάθεσης των μικροϋπολογιστών δεν υπήρχε αρκετό
διαθέσιμο λογισμικό και αυτό οδηγεί τους περισσότερους χρήστες στην
αναζήτηση πηγαίου κώδικα από βιβλία, περιοδικά, καθώς και από άλλους
χρήστες. Με αυτόν τρόπο, δημιουργείται μια νέα κατηγορία περιοδικού
τύπου, όπου δημοσιεύονται ολοκληρωμένα προγράμματα ή δίνονται λύσεις σε
επιμέρους προβλήματα προγραμματισμού. <a href="#fn23" id="fnref23"
class="footnote-ref" role="doc-noteref"><sup>23</sup></a> Ταυτόχρονα, οι
χρήστες δημιουργούν ομάδες ενδιαφέροντος και οργανώνουν φυσικές
συναντήσεις <a href="#fn24" id="fnref24" class="footnote-ref"
role="doc-noteref"><sup>24</sup></a> με στόχο την συνεργασία ή και τον
ανταγωνισμό στην κατασκευή πειραματικών προγραμμάτων και
βιντεοπαιχνιδιών.</p>
<p>Παράλληλα με την επιτυχία και την διάδοση των πρώτων μικροϋπολογιστών
από τις Apple και Commodore, η Atari ακολουθεί μια διαφορετική πορεία,
όπου ο χρήστης αποκτάει πρόσβαση σε μια συλλογή από εμπορικά
βιντεοπαιχνίδια. Οι χρήστες δεν έχουν την δυνατότητα να χρησιμοποιήσουν
την κονσόλα για ανάπτυξη παρά μόνο για να διαδράσουν με έτοιμο
λογισμικό, το οποίο δημιουργεί τον νέο μεγάλο κλάδο της βιομηχανίας των
βιντεοπαιχνιδιών που θα γνωρίσει συνεχή ανάπτυξη τις επόμενες δεκαετίες.
Αν και η Atari δεν μπόρεσε να εκμεταλευτεί την αγορά που δημιούργησε με
την κονσόλα 2600 και με κλασικά βιντεοπαιχνίδια όπως το Space Invaders,
η επίδραση της θα είναι καταλυτική τόσο στην βιομηχανία των
βιντεοπαιχνιδιών, αλλά και σε σχετικούς κλάδους, όπως είναι τα
καταναλωτικά ηλεκτρονικά, αλλά και στην ευρύτερη ψηφιακή κουλτούρα.
Πράγματι, νέες εταιρείες θα δημιουργηθούν για να εκμεταλευτούν την
ευκαιρία που δημιούργησε η Atari, όπως οι Nintento, Sega, ενώ και οι
υπάρχουσες εταιρείες θα προσπαθήσουν να αποκτήσουν ένα μερίδιο από αυτήν
την νέα και αναπτυσόμενη αγορά, όπως οι Sony, Microsoft.</p>
<p>Ο ψηφιακός αλφαβητισμός είναι καθολικά αποδεκτός ως μια πολύ βασική
δεξιότητα, ανεξάρτητα από τις προσωπικές και επαγγελματικές επιδιώξεις
του κάθε ανθρώπου. Στις πρώτες φάσεις διάδοσης της διάδρασης με
υπολογιστές, ο ψηφιακός αλφαβητισμός εξαντλήθηκε στην κατανόηση της
χρήσης του υπολογιστή, αλλά τελικά έγινε σαφές ότι ο αλφαβητισμός, εκτός
από την ανάγνωση, έχει ως αναγκαία προϋπόθεση και ένα βαθμό δεξιότητας
στη συγγραφή, η οποία βασίζεται στην γραφή που είναι από τις
σημαντικότερες τεχνολογικές εφευρέσεις της ανθρωπότητας. Φυσικά, όπως
δεν έχουμε την απαίτηση από τον μέσο άνθρωπο να γράφει κείμενο όπως ένας
κορυφαίος συγγραφέας, έτσι ακριβώς δεν έχουμε την απαίτηση να μπορεί να
δημιουργήσει καινοτόμα προγράμματα διάδρασης. Από την άλλη πλευρά, η
δυνατότητα να παρέμβει στη δημιουργία και προσαρμογή προγραμμάτων
διάδρασης ανοιχτού κώδικα που του ταιριάζουν είναι μια δεξιότητα που
αυξάνει τις δυνατότητές του για έκφραση και δημιουργία, τόσο στην
προσωπική όσο και στην επαγγελματική του ζωή.</p>
<p>Η εφαρμογή των υπολογιστών στην εκπαίδευση ξεκίνησε με τις χελώνες
ρομπότ του Seymour Papert στο ΜΙΤ, τα οποία συνέχισε ο Alan Kay με την
Smalltalk στο Xerox PARC. Αυτές οι αρχικές φιλόδοξες προσπάθειες
παραμένουν για πολλές δεκαετίες μετέωρες, όχι τόσο γιατί είναι ανέφικτες
αλλά κυρίως γιατί δεν έχει δημιουργηθεί το κατάλληλο οργανωτικό και
γνωστικό πλαίσιο για την ευρύτερη ορθή εφαρμογή τους. Αντίθετα, η
εφαρμογή των υπολογιστών στην εκπαίδευση έχει βρει πολύ γόνιμο έδαφος
εκεί που οι υπολογιστές χρησιμοποιούνται ως εργαλεία για την μετάδοση
γνώσεων σε άλλες γνωστικές περιοχές ή στην καλύτερη περίπτωση για την
ανάπτυξη δεξιοτήτων για τον προγραμματισμό τους. Για παράδειγμα, η σειρά
υπολογιστών Plato περιλαμβάνει διαδραστικές ασκήσεις στις φυσικές
επιστήμες, ενώ ο BBC Micro αντιγράφει την δημοφιλή φόρμα των
μικροϋπολογιστών δίνοντας έμφαση και στον προγραμματισμό εκτός από την
διανομή εκπαιδευτικού λογισμικού.</p>
<section id="footnotes" class="footnotes footnotes-end-of-section"
role="doc-endnotes">
<hr />
<ol start="20">
<li><div id="fn20">
<p>fig:xerox-pad-board<a href="#fnref20" class="footnote-back"
role="doc-backlink">↩︎</a></p>
</div></li>
<li><div id="fn21">
<p>fig:xerox-liveboard<a href="#fnref21" class="footnote-back"
role="doc-backlink">↩︎</a></p>
</div></li>
<li><div id="fn22">
<p><span class="citation" data-cites="engelbart1988augmented">Engelbart
(1988)</span><a href="#fnref22" class="footnote-back"
role="doc-backlink">↩︎</a></p>
</div></li>
<li><div id="fn23">
<p>fig:printed-code<a href="#fnref23" class="footnote-back"
role="doc-backlink">↩︎</a></p>
</div></li>
<li><div id="fn24">
<p>fig:c64-demoscene<a href="#fnref24" class="footnote-back"
role="doc-backlink">↩︎</a></p>
</div></li>
</ol>
</section>
<h2 id="η-περίπτωση-του-unix">Η περίπτωση του UNIX</h2>
<figure id="fig:pdp11-tty-unix">
<img src="../images/pdp11-tty-unix.jpg"
alt="Ο μίνιϋπολογιστής PDP11 της DEC θεωρείται κομβικό σημείο γιατί ήταν πολύ δημοφιλής σε πανεπιστήμια και ερευνητικά κέντρα, όπου χρησιμοποιήθηκε για την διάδοση του λειτουργικού συστήματος UNIX, της γλώσσας προγραμματισμού C, και κυρίως των εξομοιωτών που επέτρεψαν την ανάπτυξη νέων συστημάτων για τους μικροϋπολογιστές που αναπτύχθηκαν στο τέλος της δεκαετίας του 1970 και έφεραν τον υπολογισμό στα σπίτια και στους απλούς χρήστες." />
<figcaption aria-hidden="true">Ο μίνιϋπολογιστής PDP11 της DEC θεωρείται
κομβικό σημείο γιατί ήταν πολύ δημοφιλής σε πανεπιστήμια και ερευνητικά
κέντρα, όπου χρησιμοποιήθηκε για την διάδοση του λειτουργικού συστήματος
UNIX, της γλώσσας προγραμματισμού C, και κυρίως των εξομοιωτών που
επέτρεψαν την ανάπτυξη νέων συστημάτων για τους μικροϋπολογιστές που
αναπτύχθηκαν στο τέλος της δεκαετίας του 1970 και έφεραν τον υπολογισμό
στα σπίτια και στους απλούς χρήστες.</figcaption>
</figure>
<figure id="fig:unix-shell">
<img src="../images/unix-shell.png"
alt="Το κέλυφος του πυρήνα του λειτουργικού συστήματος UNIX ονομάστηκε shell καθώς κρύβει τις λεπτομέρειες της υλοποίησης και παρέχει μια προσβάσιμη διεπαφή για τον χρήστη. Εκτός από τις βασικές λειτουργίες του συστήματος παρέχει και μια απλή γλώσσα προγραμματισμού μεταγλώτισης η οποία επιτρέπει την φορητότα των προγραμμάτων του χρήστη σε παρόμοια συστήματα." />
<figcaption aria-hidden="true">Το κέλυφος του πυρήνα του λειτουργικού
συστήματος UNIX ονομάστηκε shell καθώς κρύβει τις λεπτομέρειες της
υλοποίησης και παρέχει μια προσβάσιμη διεπαφή για τον χρήστη. Εκτός από
τις βασικές λειτουργίες του συστήματος παρέχει και μια απλή γλώσσα
προγραμματισμού μεταγλώτισης η οποία επιτρέπει την φορητότα των
προγραμμάτων του χρήστη σε παρόμοια συστήματα.</figcaption>
</figure>
<p>Το Unix είναι περισσότερο γνωστό σε όσους ασχολούνται με τα
λειτουργικά συστήματα και σχεδόν καθόλου γνωστό στην κοινότητα της
διάδρασης και των γραφικών διεπαφών χρήστη. Πράγματι, οι γραφικές
διεπαφές σε όλα τα Unix είναι συνήθως αντίγραφα από τις αντίστοιχες
εμπορικές με βασικό σημείο διαφοροποίησης την διάθεση ανοικτού πηγαίου
κώδικα. Εκτός από την γραφική διεπαφή όμως, το Unix παρέχει και κυρίως
βασίζεται στην διεπαφή της γραμμής εντολών, η οποία είναι από τα
σημαντικότερα κεφάλαια.</p>
<p>Η διάδραση με την γραμμή εντολών είναι από τους πρώτους τρόπους
χρήσης των υπολογιστών, αλλά η αξία της παραμένει διαχρονική. Η γραμμή
εντολών έγινε αρχικά δημοφιλής με το σύστημα Unix, ενώ διατηρεί την
χρησιμότητα της σε σύγχρονα συστήματα όπως οι διεπαφές γραπτών μηνυμάτων
ή διαλόγων με ρομπότ στα κινητά τηλέφωνα και στις φωνητικές πύλες. Αν
και θεωρείται δύσκολη στην χρήση, τουλάχιστον για τους αρχάριους, η
διαχρονικότητα της καθώς και η σταθερή προτίμηση από τους ειδικούς
τεκμηριώνουν την σημασία της.</p>
<p>Εκτός από την γραμμή εντολών, το Unix έκανε δημοφιλή την οργάνωση
ενός λειτουργικού συστήματος σε αρχεία και φακέλους, τα οποία
χρησιμοποιήθηκαν και από τα περισσότερα γραφικά περιβάλλοντα που
ακολούθησαν. Η πιο σημαντική συνεισφορά αυτού του συστήματος είναι στο
σημείο συνάντησης των αρχείων με την γραμμή εντολής, όπου δημιουργήθηκαν
οι γλώσσες κελύφους<a href="#fn25" id="fnref25" class="footnote-ref"
role="doc-noteref"><sup>25</sup></a> καθως και η διασωλήνωση των
προγραμμάτων.<a href="#fn26" id="fnref26" class="footnote-ref"
role="doc-noteref"><sup>26</sup></a> Σε αντίθεση με την ιδέα της
εμπορικής διάθεσης εφαρμογών με πολλές δυνατότητες, το Unix βασίζεται
στην ιδέα των πολλών μικρών προγραμμάτων, τα οποία παραμετροποιούνται,
συνδέονται μεταξύ τους και τελικά συνθέτουν νέα προγράμματα σύμφωνα με
τις ανάγκες του χρήστη.</p>
<p>Ακόμη και η γραφική διεπαφή έγινε με έμφαση στο δίκτυο έτσι ώστε
υπάρχει διαχωρισμός ανάμεσα στο μηχάνημα που εκτελεί μια εφαρμογή και
στο τερματικό του χρήστη που κάνει την διάδραση. Τέλος, το Unix από την
δημιουργία του την δεκαετία του 1960 μέχρι και σήμερα δίνει μεγάλη
έμφαση σε μια κοινότητα χρηστών, οι οποίοι δουλεύουν μαζί τόσο για την
ανάπτυξη του βασικού συστήματος και κυρίως για την ανταλλαγή
προγραμμάτων.<a href="#fn27" id="fnref27" class="footnote-ref"
role="doc-noteref"><sup>27</sup></a> Η ιδέα της κοινότητας σε αντίθεση
με την ιδέα του προϊόντος ήταν θεμελιώδης για την δημιουργία αντίστοιχων
κοινοτήτων κατά τις επόμενες δεκαετίες, όπως αυτές των πρώτων δικτυακών
συζητήσεων, της σκηνής των δοκιμαστικών προγραμμάτων και κυρίως για το
ανοιχτό λογισμικό την δεκαετία του 1990.</p>
<section id="footnotes" class="footnotes footnotes-end-of-section"
role="doc-endnotes">
<hr />
<ol start="25">
<li><div id="fn25">
<p>fig:unix-shell<a href="#fnref25" class="footnote-back"
role="doc-backlink">↩︎</a></p>
</div></li>
<li><div id="fn26">
<p><span class="citation" data-cites="kernighan2019unix">Kernighan
(2019)</span><a href="#fnref26" class="footnote-back"
role="doc-backlink">↩︎</a></p>
</div></li>
<li><div id="fn27">
<p>fig:pdp11-tty-unix<a href="#fnref27" class="footnote-back"
role="doc-backlink">↩︎</a></p>
</div></li>
</ol>
</section>
<h2 id="η-περίπτωση-της-κονσόλας-βιντεοπαιχνιδιών">Η περίπτωση της
κονσόλας βιντεοπαιχνιδιών</h2>
<p>Οι κονσόλες βιντεοπαιχνιδιών και τα βιντεοπαιχνίδια που τρέχουν σε
αυτές αναπτύχθηκαν παράλληλα με τους οικιακούς μικροϋπολογιστές και
έχουν ιδιαίτερη σημασία γιατί σε πολλές περιπτώσεις δεν βασίζονται στα
κυρίαρχα συστήματα διάδρασης. Πράγματι, ένα βιντεοπαιχνίδι αξιολογείται
με κριτήριο την δημιουργικότητα, οπότε οι κατασκευαστές του συνήθως
αποφεύγουν τα κυρίαρχα αρχέτυπα διάδρασης και σχεδιάζουν νέες
διεπαφές.<a href="#fn28" id="fnref28" class="footnote-ref"
role="doc-noteref"><sup>28</sup></a> Για την περίπτωση των δημοφιλών
παιχνιδιών πρώτου προσώπου ή για τα παιχνίδια ρόλων δημιουργούνται
εύχρηστα εργαλεία κατασκευής για τις αντίστοιχες κατηγορίες.</p>
<figure id="fig:atari-2600">
<img src="../images/atari-2600.jpg"
alt="Σε αντίθεση με τους πρώτους μικροϋπολογιστές εκείνης της χρονιάς η κονσόλα της Atari εστιάζει μόνο στην διασκέδαση με βιντεοπαιχνίδια, τα οποία αγοράζονται όπως τα βιβλία και οι δίσκοι και φορτώνονται με εξωτερικές κάρτες μνήμης ανάγνωσης. Αντί για πληκτρολόγιο έχει μοχλό για τον έλεγχο των χαρακτήρων στα βιντεοπαιχνίδια. Ο βιομηχανικός σχεδιασμός ταιριάζει με αυτόν της τηλεόρασης με την οποία συνδέεται ως συσκευή εξόδου και με την βοήθεια του βιντεοπαιχνιδιού Space Invaders δημιουργεί μια νέα κατηγορία διαδραστικού υπολογιστή." />
<figcaption aria-hidden="true">Σε αντίθεση με τους πρώτους
μικροϋπολογιστές εκείνης της χρονιάς η κονσόλα της Atari εστιάζει μόνο
στην διασκέδαση με βιντεοπαιχνίδια, τα οποία αγοράζονται όπως τα βιβλία
και οι δίσκοι και φορτώνονται με εξωτερικές κάρτες μνήμης ανάγνωσης.
Αντί για πληκτρολόγιο έχει μοχλό για τον έλεγχο των χαρακτήρων στα
βιντεοπαιχνίδια. Ο βιομηχανικός σχεδιασμός ταιριάζει με αυτόν της
τηλεόρασης με την οποία συνδέεται ως συσκευή εξόδου και με την βοήθεια
του βιντεοπαιχνιδιού Space Invaders δημιουργεί μια νέα κατηγορία
διαδραστικού υπολογιστή.</figcaption>
</figure>
<figure id="fig:power-glove">
<img src="../images/power-glove.jpg"
alt="Το πρώτο προσιτά οικονομικό και ευρέως διαθέσιμο γάντι διάδρασης είχε πολλά προβλήματα και λίγο διαθέσιμο λογισμικό, αλλά αυτό δεν εμπόδισε πολλούς προχωρημένους χρήστες να το προσαρμόσουν σε διαφορετικές εφαρμογές πέρα από τα βίντεοπαιχνίδια για τα οποία κατασκευάστηκε." />
<figcaption aria-hidden="true">Το πρώτο προσιτά οικονομικό και ευρέως
διαθέσιμο γάντι διάδρασης είχε πολλά προβλήματα και λίγο διαθέσιμο
λογισμικό, αλλά αυτό δεν εμπόδισε πολλούς προχωρημένους χρήστες να το
προσαρμόσουν σε διαφορετικές εφαρμογές πέρα από τα βίντεοπαιχνίδια για
τα οποία κατασκευάστηκε.</figcaption>
</figure>
<p>Η οικιακή ανάπτυξη και ο διαμοιρασμός του κώδικα ενός
βιντεοπαιχνιδιού είναι μια δημοφιλής πρακτική, από τα πρώτα βήματα
διάδοσης των βιντεοπαιχνιδιών στους μικροϋπολογιστές. Ο άμεσος
προγραμματισμός των πρώτων μικροϋπολογιστών προσφέρει σε μια γενιά
χρηστών μια περισσότερο παραγωγική οπτική στο φαινόμενο της διάδρασης με
τους υπολογιστές. Επίσης, οι κατασκευαστές βιντεοπαιχνιδιών συχνά
επιλέγουν να παρακάμψουν το λειτουργικό σύστημα έτσι ώστε να πετύχουν
βελτιστοποιημένες επιδόσεις για τις δημιουργίες τους.</p>
<p>Οι εμπορικές κονσόλες βιντεοπαιχνιδιών συνεισφέρουν στο φαινόμενο της
διάδρασης νέες συσκευές εισόδου, όπως είναι τα χειριστήρια με πολλά
κουμπιά και αισθητήρες, καθώς και η αναγνώριση εικόνας. Σε αντίθεση με
το παραδοσιακό πληκτρολόγιο και ποντίκι, οι κονσόλες γίνονται πλατφόρμες
πειραματισμού για νέες συσκευές διάδρασης, οι οποίες δημιουργούν νέες
κατηγορίες βιντεοπαιχνιδιών, σε πεδία όπως είναι η μουσική και η
γυμναστική. Νέες συσκευές διάδρασης όπως είναι η μάσκα εικονικής
πραγματικότητας χρησιμοποιούν την δημοτικότητα των βιντεοπαιχνιδιών για
να διατεθούν εμπορικά σε περισσότερο προσιτές τιμές.</p>
<p>Η ευρεία διαθεσιμότητα πολύ ισχυρών πολυμεσικών συστημάτων επιτρέπει
την εξομοίωση παλιότερων συστημάτων που δεν είναι πλέον διαθέσιμα, όπως
ήταν οι κονσόλες βιντεοπαιχνιδιών με κέρματα και οι κονσόλες με
κασέτες.<a href="#fn29" id="fnref29" class="footnote-ref"
role="doc-noteref"><sup>29</sup></a> Η πρακτική αυτή επιτρέπει την
μουσειακή διατήρηση παλιότερων συστημάτων, αλλά και την μελέτη τους από
τους νεότερους που δεν έχουν δει αυτά τα συστήματα. Επιπλέον, η ίδια η
πρακτική της εξομοίωσης επιτρέπει την ανάπτυξη νέων εικονικών συστημάτων
για τα οποία δεν υπάρχει αντίστοιχο υλικό, με στόχο τον πειραματισμό και
την δημιουργικότητα.</p>
<section id="footnotes" class="footnotes footnotes-end-of-section"
role="doc-endnotes">
<hr />
<ol start="28">
<li><div id="fn28">
<p>fig:power-glove<a href="#fnref28" class="footnote-back"
role="doc-backlink">↩︎</a></p>
</div></li>
<li><div id="fn29">
<p>fig:atari-2600<a href="#fnref29" class="footnote-back"
role="doc-backlink">↩︎</a></p>
</div></li>
</ol>
</section>
<h2 id="σύντομη-βιογραφία-του-jef-raskin">Σύντομη βιογραφία του Jef
Raskin</h2>
<p>Ο Jef Raskin, όπως και οι περισσότεροι πρωτοπόροι των υπολογιστών,
δεν σπούδασε κάτι σχετικό με την πληροφορική, ενώ παράλληλα είχε πολλά
ενδιαφέροντα με κεντρικό την μουσική εκτέλεση. Ξεκίνησε την καριέρα του
ως καθηγητής πανεπιστημίου, αλλά η εισαγωγή των πρώτων μικροϋπολογιστών
τον βρήκε να δημιουργεί μια εταιρεία που έφτιαχνε εγχειρίδια χρήσης για
απλούς χρήστες και να αρθρογραφεί στον περιοδικό τύπο του κλάδου. Με
αυτόν τον τρόπο συνάντησε τους ιδρυτές της Apple και άρχισε να γράφει
ένα καλύτερο εγχειρίδιο για τον Apple II.</p>
<figure id="fig:swyftware">
<img src="../images/swyftware.jpg"
alt="Το σύστημα SwyftWare βασιζόταν σε μια κάρτα επέκτασης για τον Apple II και σε λογισμικό διάδρασης για την επεξεργασία εγγράφων κειμένου, η οποία γινόταν μόνο με το πληκτρολόγιο και μερικές εντολές. Η κεντρική ιδέα σε αυτό το σύστημα είναι ότι η διάδραση με τα έγγραφα γίνεται πιο απλή αν αποφύγουμε ιδέες που σχετίζονται με μηχανήματα γενικής χρήσης, όπως είναι τα αρχεία, οι εφαρμογές, και το λειτουργικό σύστημα." />
<figcaption aria-hidden="true">Το σύστημα SwyftWare βασιζόταν σε μια
κάρτα επέκτασης για τον Apple II και σε λογισμικό διάδρασης για την
επεξεργασία εγγράφων κειμένου, η οποία γινόταν μόνο με το πληκτρολόγιο
και μερικές εντολές. Η κεντρική ιδέα σε αυτό το σύστημα είναι ότι η
διάδραση με τα έγγραφα γίνεται πιο απλή αν αποφύγουμε ιδέες που
σχετίζονται με μηχανήματα γενικής χρήσης, όπως είναι τα αρχεία, οι
εφαρμογές, και το λειτουργικό σύστημα.</figcaption>
</figure>
<figure id="fig:raskin-profile">
<img src="../images/raskin-profile.jpg"
alt="Ο Jef Raskin είναι από τους λίγους κατασκευαστές της διάδρασης που συνδύασε μια ανθρωποκεντρική φιλοσοφία με την πρακτική εφαρμογή σε ένα προϊόν επεξεργασίας κειμένου. Το αποτέλεσμα αυτής της προσπάθειας αποτελεί παράδειγμα προς μίμηση και ταυτόχρονα μας θυμίζει ότι τα περισσότερα πετυχημένα εμπορικά προϊόντα δεν εξυπηρετούν την αντικειμενική ευχρηστία, αλλά μόνο την βολική συνήθεια και τα συμφέροντα των κατασκευαστών." />
<figcaption aria-hidden="true">Ο Jef Raskin είναι από τους λίγους
κατασκευαστές της διάδρασης που συνδύασε μια ανθρωποκεντρική φιλοσοφία
με την πρακτική εφαρμογή σε ένα προϊόν επεξεργασίας κειμένου. Το
αποτέλεσμα αυτής της προσπάθειας αποτελεί παράδειγμα προς μίμηση και
ταυτόχρονα μας θυμίζει ότι τα περισσότερα πετυχημένα εμπορικά προϊόντα
δεν εξυπηρετούν την αντικειμενική ευχρηστία, αλλά μόνο την βολική
συνήθεια και τα συμφέροντα των κατασκευαστών.</figcaption>
</figure>
<p>Τόσο η τεχνολογική κατανόηση που είχε για τους μικροϋπολογιστές, όσο
και η έμφαση που έδινε στην απλότητα της χρήσης του έδωσαν την θέση του
υπεύθυνου ανάπτυξης για το έργο Macintosh. Από αυτήν την θέση προσπάθησε
να φτιάξει ένα απλό και οικονομικό μηχάνημα με έμφαση στην επεξεργασία
κειμένου. Τελικά, ο Macintosh πέρασε στην διοίκηση του Steve Jobs, ο
οποίος πρόσθεσε το ποντίκι και το παραθυρικό περιβάλλον, το οποίο ήταν
μια πολύ διαφορετική κατεύθυνση. Για τον Jef Raskin η αντιλαμβανόμενη
ευχρηστία ενός συστήματος διάδρασης επηρεάζεται κυρίως από την
υποκειμενική οικειότητα με προηγούμενα παρόμοια συστήματα ή μεταφορές
από τον φυσικό κόσμο, τα οποία όμως δεν είναι αντικειμενικά βέλτιστα
ειδικά για τους συχνούς χρήστες.</p>
<p>Η στοχοπροσήλωση που είχε για ένα πολύ απλό και εστιασμένο στην
επεξεργασία κειμένου μηχάνημα διάδρασης τον οδήγησαν στην δημιουργία
μιας ακόμη εταιρείας. Το πρώτο προϊόν είναι το SwyftWare,<a href="#fn30"
id="fnref30" class="footnote-ref" role="doc-noteref"><sup>30</sup></a>
το οποίο είναι ένας επεξεργαστής κειμένου χωρίς αρχεία, χωρίς εφαρμογές,
και χωρίς λειτουργικό σύστημα, τα οποία θεωρεί πως μπερδεύουν τον χρήστη
με περιττές επιλογές, που αυξάνουν το κόστος χωρίς να προσφέρουν
σημαντικές λειτουργίες. Για την λειτουργικότητα του επεξεργαστή κειμένου
το SwyftWare και το Canon Cat<a href="#fn31" id="fnref31"
class="footnote-ref" role="doc-noteref"><sup>31</sup></a> βασίζονται στο
πληκτρολόγιο και σε συντομεύσεις για την εκτέλεση εντολών.</p>
<p>Την περίοδο που ήταν καθηγητής στο τμήμα τεχνών ανέπτυξε την γλώσσα
προγραμματισμού FLOW, η οποία απευθύνεται σε σπουδαστές των
ανθρωπιστικών επιστημών. Όπως η BASIC έδωσε εύκολη πρόσβαση στον
προγραμματισμό για τις φυσικές επιστήμες και τα μαθηματικά ως σκαλοπάτι
πριν την FORTRAN, έτσι και η FLOW άνοιξε τον προγραμματισμό για ένα νέο
κοινό. Η FLOW είχε έμφαση στην επεξεργασία δεδομένων κειμένου και όχι
αριθμών και καινοτόμησε με την χρήση της αυτόματης συμπλήρωσης των
εντολών προγραμματισμού και χρησιμοποιήθηκε για να διδάξει
προγραμματισμό σε σπουδαστές τεχνών τριάντα χρόνια πριν η ιδέα αυτή
υλοποιηθεί πάλι στο δημοφιλές Processing.</p>
<section id="footnotes" class="footnotes footnotes-end-of-section"
role="doc-endnotes">
<hr />
<ol start="30">
<li><div id="fn30">
<p>fig:swyftware<a href="#fnref30" class="footnote-back"
role="doc-backlink">↩︎</a></p>
</div></li>
<li><div id="fn31">
<p>fig:raskin-profile<a href="#fnref31" class="footnote-back"
role="doc-backlink">↩︎</a></p>
</div></li>
</ol>
</section>
<h2 class="unnumbered" id="βιβλιογραφία">Βιβλιογραφία</h2>
<div id="refs" class="references csl-bib-body hanging-indent"
role="list">
<div id="ref-denning1998beyond" class="csl-entry" role="listitem">
Denning, Peter J, και Robert M Metcalfe. 1998. <em>Beyond calculation:
The next fifty years of computing</em>. Springer Science &amp; Business
Media.
</div>
<div id="ref-engelbart1988augmented" class="csl-entry" role="listitem">
Engelbart, Douglas. 1988. <span>‘The augmented knowledge
workshop’</span>. Στο <em>A history of personal workstations</em>,
185–248.
</div>
<div id="ref-freiberger1984fire" class="csl-entry" role="listitem">
Freiberger, Paul, και Michael Swaine. 1984. <em>Fire in the Valley: the
making of the personal computer</em>. McGraw-Hill, Inc.
</div>
<div id="ref-10.1145/61975" class="csl-entry" role="listitem">
Goldberg, Adele, επιμ. 1988. <em>A History of Personal
Workstations</em>. New York, NY, USA: Association for Computing
Machinery.
</div>
<div id="ref-hertzfeld2004revolution" class="csl-entry" role="listitem">
Hertzfeld, Andy. 2004. <em>Revolution in The Valley [Paperback]: The
Insanely Great Story of How the Mac Was Made</em>. " O’Reilly Media,
Inc.".
</div>
<div id="ref-kay1977personal" class="csl-entry" role="listitem">
Kay, Alan, και Adele Goldberg. 1977. <span>‘Personal dynamic
media’</span>. <em>Computer</em> 10 (3): 31–41.
</div>
<div id="ref-kernighan2019unix" class="csl-entry" role="listitem">
Kernighan, Brian W. 2019. <em>UNIX: A History and a Memoir</em>. Kindle
Direct Publishing.
</div>
<div id="ref-lanier2017dawn" class="csl-entry" role="listitem">
Lanier, Jaron. 2017. <em>Dawn of the new everything: Encounters with
reality and virtual reality</em>. Henry Holt; Company.
</div>
<div id="ref-laurel2013computers" class="csl-entry" role="listitem">
Laurel, Brenda. 2013. <em>Computers as theatre</em>. Addison-Wesley.
</div>
<div id="ref-nelson2008geeks" class="csl-entry" role="listitem">
Nelson, Ted. 2008. <em>Geeks Bearing Gifts</em>. Mindful Pr.
</div>
<div id="ref-sellen2003myth" class="csl-entry" role="listitem">
Sellen, Abigail J, και Richard HR Harper. 2003. <em>The myth of the
paperless office</em>. MIT press.
</div>
<div id="ref-waldrop2001dream" class="csl-entry" role="listitem">
Waldrop, M Mitchell. 2001. <em>The dream machine: JCR Licklider and the
revolution that made computing personal</em>. Viking Penguin.
</div>
</div>
<h1 id="τεχνολογία">Τεχνολογία</h1>
<blockquote>
<p>Οι κατασκευαστές που σχεδιάζουν προσεκτικά το λογισμικό τους,
φτιάχνουν και το δικό τους υλικό. Alan Kay</p>
</blockquote>
<h3 id="περίληψη">Περίληψη</h3>
<p>Η τεχνολογία διάδρασης είναι πλέον ευρέως διαθέσιμη σε κάποιες λίγες
μορφές που καθιστούν δύσκολη την διάκριση ανάμεσα στην βασική τεχνολογία
και στα στιγμιότυπα οργάνωσής της. Ο δημοφιλής επιτραπέζιος υπολογιστής
για αρκετές δεκαετίες συνοδεύεται από ένα γραφικό περιβάλλον εργασίας,
το οποίο από τους περισσότερους θεωρείται τεχνολογία, αλλά, όπως είδαμε
στα προηγούμενα, είναι περισσότερο μια τεχνολογική μορφή, που
κατασκευάστηκε σε ένα δεδομένο τεχνο-οικονομικό πλαίσιο. Παρόμοια, η
τεχνολογία εμβύθισης των συστημάτων εικονικής πραγματικότητας μπορεί να
χρησιμοποιηθεί για την επαύξηση της ανθρώπινης εμπειρίας προς
κατευθύνσεις που δεν είναι απαραίτητα συμβατές με το φυσικό περιβάλλον.
Στην πράξη όμως, τα περισσότερα συστήματα εικονικής πραγματικότητας
χρησιμοποιούνται για να δημιουργήσουν προσομοιώσεις της φυσικής
πραγματικότητας. Ιδιαίτερο ενδιαφέρον παρουσιάζει η τεχνολογία ανοιχτού
κώδικα, ο οποίος επιτρέπει την μελέτη και ανάλογα με την άδεια χρήσης
την προσαρμογή του αρχικού κώδικα για διαφορετικούς σκοπούς. Ο ανοιχτός
κώδικας είναι μια σημαντική ιδιότητα στην τεχνολογία διάδρασης, αλλά δεν
μπορεί να είναι ο σκοπός της, γιατί τότε τα νέα συστήματα διάδρασης
μπορεί να είναι απλά αντίγραφα των μορφών διάδρασης από τα ήδη υπάρχοντα
κλειστού κώδικα.</p>
<h2 id="τεχνολογικά-προϊόντα">Τεχνολογικά προϊόντα</h2>
<p>Στην τεχνολογία λογισμικού υπάρχουν συνήθως πολλά επίπεδα αφαίρεσης
που κάνουν δύσκολη την διάκριση ανάμεσα σε βασική τεχνολογία και
τεχνολογικό προϊόν. Επίσης, συμβαίνει συχνά κάποια δημοφιλή προϊόντα να
δίνουν το όνομα τους σε όλην την κατηγορία, όπως ακριβώς συμβαίνει σε
πολλά καταναλωτικά προϊόντα. Για παράδειγμα, υπήρχε μια περίοδος που η
οδοντόκρεμα λεγόταν kolynos και η χλωρίνη καθαρισμού λεγόταν kleenex.
Αντίστοιχα, ο παγκόσμιος ιστός δεν είναι τεχνολογία, αλλά ένα δημοφιλές
προϊόν της τεχνολογικής κατηγορίας των υπερμέσων. Το ίδιο ισχύει και για
τις δημοφιλείς γλώσσες αντικειμενοστραφούς προγραμματισμού, όπως είναι η
Java, η οποία δημιουργήθηκε για εξυπηρετήσει τις ανάγκες μιας εποχής και
κυρίως αυτές μια εταιρείας που λειτουργούσε σε δεδομένο πολιτισμικό
πλαίσιο, οπότε έχει πολλές ιδιότητες διαφορετικές από αυτές της
Smalltalk,<a href="#fn1" id="fnref1" class="footnote-ref"
role="doc-noteref"><sup>1</sup></a> που ήταν η πρώτη γλώσσα του είδους
είκοσι χρόνια νωρίτερα. <a href="#fn2" id="fnref2" class="footnote-ref"
role="doc-noteref"><sup>2</sup></a> Η διάκριση ανάμεσα σε τεχνολογία και
προϊόν γίνεται ακόμη δυσκολότερη στην περίπτωση που πολλές διαφορετικές
εταιρείες χρησιμοποιούν την ίδια έννοια, όπως για παράδειγμα τα αρχεία
και τις εφαρμογές. Η συμφωνία χρήσης αρχείων και εφαρμογών σε προϊόντα
διαφορετικών εταιρειών δημιουργεί την ψευδαίσθηση ότι αυτά είναι βασικές
τεχνολογίες διάδρασης, αλλά στην πράξη είναι απλά δημοφιλείς και οικείες
συμβάσεις για χρήστες που δεν θέλουν να κατανοήσουν άλλες κατευθύνσεις
της τεχνολογίας διάδρασης. <a href="#fn3" id="fnref3"
class="footnote-ref" role="doc-noteref"><sup>3</sup></a> <a href="#fn4"
id="fnref4" class="footnote-ref" role="doc-noteref"><sup>4</sup></a></p>
<figure id="fig:norton-commander">
<img src="../images/norton-commander.png"
alt="Ο κεντρικός ρόλος των αρχείων στα περισσότερα δημοφιλή λειτουργικά συστήματα φαίνεται και από την αποδοχή που έχουν οι αντίστοιχες εφαρμογές διαχείρισης αρχείων. Ο διαχειριστής αρχείων αρχικά βασιζόταν μόνο σε μια διεπαφή κειμένου για να διευκολύνει τις βασικές εντολές πάνω στα αρχεία ενός συστήματος." />
<figcaption aria-hidden="true">Ο κεντρικός ρόλος των αρχείων στα
περισσότερα δημοφιλή λειτουργικά συστήματα φαίνεται και από την αποδοχή
που έχουν οι αντίστοιχες εφαρμογές διαχείρισης αρχείων. Ο διαχειριστής
αρχείων αρχικά βασιζόταν μόνο σε μια διεπαφή κειμένου για να διευκολύνει
τις βασικές εντολές πάνω στα αρχεία ενός συστήματος.</figcaption>
</figure>
<figure id="fig:sugar-neighborhood">
<img src="../images/sugar-neighborhood.png"
alt="Στο λειτουργικό σύστημα SugarOS που απευθύνεται σε μικρά παιδιά δεν υπάρχει γραφική διεπαφή με αρχεία, φακέλους, και εφαρμογές, όπως στην επιφάνεια εργασίας, αλλά η έμφαση βρίσκεται στις δραστηριότητες και κυρίως σε μια οπτικοποίηση των συνδέσεων με άλλους χρήστες που βρίσκονται κοντά και είναι απευθείας συνδεδεμένοι με την ασύρματη σύνδεση." />
<figcaption aria-hidden="true">Στο λειτουργικό σύστημα SugarOS που
απευθύνεται σε μικρά παιδιά δεν υπάρχει γραφική διεπαφή με αρχεία,
φακέλους, και εφαρμογές, όπως στην επιφάνεια εργασίας, αλλά η έμφαση
βρίσκεται στις δραστηριότητες και κυρίως σε μια οπτικοποίηση των
συνδέσεων με άλλους χρήστες που βρίσκονται κοντά και είναι απευθείας
συνδεδεμένοι με την ασύρματη σύνδεση.</figcaption>
</figure>
<p>Η κατανόηση της τεχνολογίας απαιτεί αρχικά μια σημειωτική ανάλυση των
βασικών λέξεων που χρησιμοποιούμε,<a href="#fn5" id="fnref5"
class="footnote-ref" role="doc-noteref"><sup>5</sup></a> γιατί υπάρχουν
πολλά προϊόντα τα οποία θεωρούνται τεχνολογίες, αλλά δεν είναι.<a
href="#fn6" id="fnref6" class="footnote-ref"
role="doc-noteref"><sup>6</sup></a> Αν θέλουμε να έχουμε κατανόηση πέρα
από τα συμφέροντα των κατασκευαστών και τις εμπορικές συγκυρίες, τότε η
ονομασία μιας τεχνολογίας διάδρασης θα πρέπει να σχετίζεται άμεσα με την
λειτουργία που πραγματικά κάνει. Για παράδειγμα, το σύστημα SwyftWare
σχεδιάστηκε από τον Jef Raskin για να κάνει επεξεργασία κειμένου, που
είναι μια από τις πιο δημοφιλείς χρήσεις για τον επιτραπέζιο
υπολογισμό.<a href="#fn7" id="fnref7" class="footnote-ref"
role="doc-noteref"><sup>7</sup></a> Για αυτόν τον σκοπό, από την πλευρά
του χρήστη, δεν έχει ούτε λειτουργικό σύστημα, ούτε σύστημα αρχείων,
ούτε εφαρμογές, αφού όλα αυτά είναι απλά προϊόντα και όχι βασικές
τεχνολογίες που είναι απαραίτητες για να έχουμε μια ποιοτική διάδραση με
την επεξεργασία μικρών ή μεγάλων κειμένων και με ότι αυτή συνδέεται,
όπως σημειώσεις και αλληλογραφία.</p>
<p>Το σύστημα αρχείων είναι η πιο δημοφιλής περίπτωση προϊόντος που οι
περισσότεροι θεωρούν πως είναι τεχνολογία. Στην πραγματικότητα, η
θεώρηση ενός συστήματος λογισμικού ως σύνολο αρχείων έγινε δημοφιλής με
το σύστημα UNIX. Η σημασία των αρχείων ενδυναμώθηκε στην συνέχεια από
την επιφάνεια εργασίας και τα έγγραφα που αναπαραστάθηκαν ως αρχεία.
Τόσο το υλικό του συστήματος, όσο και το βασικό επίπεδο λογισμικού δεν
έχουν αρχεία, τα οποία είναι ένα κατασκεύασμα που εξυπηρετεί καλά
πολλούς σκοπούς, αλλά σίγουρα δεν είναι ο μόνος τρόπος οργάνωσης του
λογισμικού. Για παράδειγμα, την ίδια περίοδο που οι μηχανικοί στα Bell
Labs κατασκεύασαν το σύστημα αρχείων του UNIX, οι μηχανικοί στο Xerox
PARC κατασκεύασαν μια εναλλακτική οργάνωση του λογισμικού που βασίζεται
στα αντικείμενα, τα οποία ανταλλάσσουν μηνύματα. Επίσης, η επεξεργασία
εγγράφων κειμένου στο SwyftWare δεν είχε αρχεία, όπως αρχεία δεν είχαν
οι αρχικές εκδόσεις του λειτουργικού συστήματος iOS για τις κινητές
συσκευές της Apple.</p>
<p>Αμέσως μετά τα αρχεία, το λειτουργικό σύστημα και οι εφαρμογές του
επιτραπέζιου και κινητού υπολογισμού αποτελούν σημαντικά παραδείγματα
προϊόντων, τα οποία όμως δεν είναι βασική τεχνολογία για το λογισμικό
διάδρασης. Το λειτουργικό σύστημα παρέχει στον προγραμματιστή και στον
απλό χρήση ένα ενιαίο περιβάλλον διάδρασης για πολλές διαφορετικές
εφαρμογές. Το λειτουργικό σύστημα είναι μια ιδέα χρήσιμη για πολύ ακριβά
μηχανήματα για τα οποία δεν γνωρίζουμε τις πιθανές εφαρμογές τους. Από
την πλευρά του χρήστη, για μια δεδομένη λειτουργία, όπως η επεξεργασία
κειμένου, το λογισμικό διάδρασης δεν χρειάζεται να έχει ενδιάμεσα
επίπεδα ή αρχιτεκτονικές της πληροφορίας που εξυπηρετούν και άλλους
σκοπούς. Ειδικά οι εφαρμογές, όπως τις γνωρίζουμε από τις δημοφιλείς
γραφικές διεπαφές σε επιτραπέζια και κινητά συστήματα δημιουργούν ένα
περιβάλλον χρήστη με έμφαση στην κατανάλωση παρά στην δημιουργία.
Πράγματι, αν μια εφαρμογή δεν έχει μια λειτουργία, τότε ο χρήστης θα
πρέπει να αγοράσει κάποια άλλη εφαρμογή που πιθανόν είναι πολύ παρόμοια
με την αρχική. Επίσης, πολλές λειτουργίες παγιδεύονται σε μια εφαρμογή
και δεν μπορούν να χρησιμποιηθούν σε άλλη ή να γίνει μια σύνθεση τους με
τρόπο που να βολεύει. Για παράδειγμα, η γραμμή εντολών όπως έγινε αρχικά
γνωστή με το Unix δεν περιέχει εφαρμογές, αλλά την δυνατότητα
διασύνδεσης εντολών για την δημιουργία σύνθετων προγραμμάτων, που
μπορούν να κάνουν ότι και μια εφαρμογή, χωρίς να παγιδεύονται σε ένα
κλειστό κουτί. Από τις αρχές της δεκαετίας του 1980, ο Gary Gildall είχε
διαπιστώσει ότι ακόμη και όταν υπάρχει ανάγκη για διακριτό λειτουργικό
σύστημα και εφαρμογές, αυτά δεν θα πρέπει να φτιάχνονται από τον ίδιο
κατασκευαστή, γιατί δημιουργείται σύγκρουση συμφερόντων.<a href="#fn8"
id="fnref8" class="footnote-ref" role="doc-noteref"><sup>8</sup></a></p>
<p>Η γραφική διεπαφή των δημοφιλών επιτραπέζιων συστημάτων όπως είναι τα
Windows, MacOS, GNOME, συνήθως αποτελείται από παράθυρα που
αντιπροσωπεύουν εφαρμογές ή έγγραφα, καθώς επίσης και από μενού
εργαλείων που εμφανίζονται ως εικονίδια. Όπως ακριβώς είδαμε και στις
προηγούμενες περιπτώσεις προϊόντων παραπάνω, αυτή η τόσο δημοφιλής
οργάνωση και η σημασιολογία των γραφικών στοιχείων είναι ένα ακόμη
δημοφιλές προϊόν, το οποίο οι περισσότεροι θεωρούν ως τεχνολογία χωρίς
εναλλακτικές. Πράγματι είναι πολύ δύσκολο να εντοπίσουμε εμπορικές
εναλλακτικές καθώς η ευχρηστία αυτού του μοντέλου έχει επικρατήσει για
πολλές δεκαετίες και οποιαδήποτε αλλαγή είναι τουλάχιστον τόσο δύσκολη
όσο η οδήγηση από την αντίθετη κατεύθυνση. Η ευχρηστία αυτού του
μοντέλου διάδρασης μπορεί να ερμηνευτεί τόσο από καθολική επικράτηση
του, όσο και από την οικειότητα που έχει δημιουργηθεί, καθώς είναι το
πιο απλό στην εκμάθηση, ειδικά για περιστασιακούς χρήστες. Τα
εναλλακτικά συστήματα γραφικής διεπαφής που υπάρχουν βασίζονται
περισσότερο στις προσαρμογές που θα κάνει ένας προγραμματιστής ή είναι
λιγότερο εύχρηστα γιατί απευθύνονται σε συχνούς χρήστες μεγαλύτερης
δεξιότητας. Για παράδειγμα τα συστήματα Xerox Cedar και Oberon
δημιουργήθηκαν με έμπνευση το Alto, αλλά με χρήση δομημένης γλώσσας
προγραμματισμού όπως είναι οι Mesa και η Pascal. Αυτά τα ερευνητικά
συστήματα δίνουν κεντρικό ρόλο στα έγγραφα, τα οποία εμφανίζονται στα
παράθυρα, ενώ η διάδραση γίνεται με σύνθεση εντολών όπως στο UNIX, οι
οποίες επιτρέπουν τους υπερσυνδέσμους ανάμεσα στα έγγραφα καθώς και τον
διαμοιρασμό τους με άλλους χρήστες. Ο παγκόσμιος ιστός και τα κοινωνικά
δίκτυα είναι τα πιο πρόσφατα παραδείγματα προϊόντων, τα οποία όμως δεν
αποτελούν βασικές τεχνολογίες.</p>
<p>Η τεχνολογία του αντικειμενοστραφούς προγραμματισμού έχει γίνει
δημοφιλείς με γλώσσες προγραμματισμού όπως η Java και η C++, αλλά αυτές
όχι μόνο είναι απλά προϊόντα, αλλά και έχουν συγκεκριμένες ιδιότητες που
δεν ταιριάζουν με την αρχική σχεδίαση. Η αρχική σχεδίαση και υλοποίηση
του αντικειμενοστραφούς προγραμματισμού από τον Άλαν Κέη ήταν
εμπνευσμένη από την περιοχή της βιολογίας, τα κύταρα, και την πολύπλοκη
κλίμακα των ζωντανών οργανισμών. Αντί να βασίζεται σε πολύπλοκες δομές
δεδομένων, η Smalltalk βασίζεται σε πολύ απλές δομές που ανταλλάσσουν
μηνύματα μεταξύ τους, έτσι ώστε να είναι εφικτή η δημιουργία κλίμακας
από απλά δομικά στοιχεία. Για την δημιουργία πολύπλοκων συστημάτων δεν
υπάρχει λόγος να έχουμε πολύπλοκες γλώσσες προγραμματισμού, αφού αρκεί
να έχουμε ένα συμβολικό σύστημα που ταιριάζει στο πεδίο εφαρμογής. Για
τον σκοπό αυτό, τα σύγχρονα συστήματα που βασίζονται στην φιλοσοφία της
Smalltalk κατασκευάζονται με την σταδιακή υλοποίηση ενός μεταφραστή που
είναι γραμμένος στην ίδια γλώσσα πρόγραμματισμού με αυτήν που μετατρέπει
σε εκτελέσιμο. Με αυτόν τον τρόπο, οι προδιαγραφές του συστήματος είναι
καθολικές ανάμεσα σε συστήματα με διαφορετικό υλικό. Τα παραπάνω δεν
σημαίνουν ότι υπάρχει κάποια σωστή ή λάθος σχεδίαση, αλλά σίγουρα
σημαίνει ότι πολλές τεχνολογικές ετικέτες θα πρέπει να χρησιμοποιούνται
με περισσότερες εξηγήσεις σχετικά με το πεδίο ερφαρμογής και τους
τυπικούς χρήστες έτσι ώστε να είναι διακριτό το πραγματικό τους νόημα.
Ταυτόχρονα, μπορούμε να εντοπίσουμε καινοτόμα συστήματα, όπως το
Superpaint, τα οποία δεν βασίζονται ούτε σε κάποιο λειτουργικό σύστημα
ούτε σε κάποια γλώσσα προγραμματισμού. Πράγματι, ένα σύστημα διάδρασης
μπορεί να φτιαχτεί για έναν σημαντικό σκοπό, όπως είναι η ψηφιακή
επεξεργασία εικόνας, χωρίς την φιλοδοξία να γίνει πλατφόρμα για κάτι
άλλο.</p>
<section id="footnotes" class="footnotes footnotes-end-of-section"
role="doc-endnotes">
<hr />
<ol>
<li><div id="fn1">
<p><span class="citation" data-cites="ingalls2020evolution">Ingalls
(2020)</span><a href="#fnref1" class="footnote-back"
role="doc-backlink">↩︎</a></p>
</div></li>
<li><div id="fn2">
<p><span class="citation" data-cites="roszak1986satori">Roszak
(1986)</span><a href="#fnref2" class="footnote-back"
role="doc-backlink">↩︎</a></p>
</div></li>
<li><div id="fn3">
<p>fig:norton-commander<a href="#fnref3" class="footnote-back"
role="doc-backlink">↩︎</a></p>
</div></li>
<li><div id="fn4">
<p>fig:sugar-neighborhood<a href="#fnref4" class="footnote-back"
role="doc-backlink">↩︎</a></p>
</div></li>
<li><div id="fn5">
<p><span class="citation" data-cites="mumford2010technics">Mumford
(2010)</span> <span class="citation" data-cites="ihde2012technics">Ihde
(2012)</span><a href="#fnref5" class="footnote-back"
role="doc-backlink">↩︎</a></p>
</div></li>
<li><div id="fn6">
<p><span class="citation" data-cites="nelson2010possiplex">Nelson
(2010)</span><a href="#fnref6" class="footnote-back"
role="doc-backlink">↩︎</a></p>
</div></li>
<li><div id="fn7">
<p><span class="citation" data-cites="raskin2000humane">Raskin
(2000)</span><a href="#fnref7" class="footnote-back"
role="doc-backlink">↩︎</a></p>
</div></li>
<li><div id="fn8">
<p><span class="citation" data-cites="computer1993connections">Gildall
(1993)</span><a href="#fnref8" class="footnote-back"
role="doc-backlink">↩︎</a></p>
</div></li>
</ol>
</section>
<h2 id="εξομοίωση-και-προσομοίωση">Εξομοίωση και προσομοίωση</h2>
<figure id="fig:paper-simulation">
<img src="../images/paper-simulation.jpg"
alt="Καθώς η εταιρεία Xerox ασχολείται διαχρονικά με το φυσικό χαρτί και τις εκτυπώσεις οι πελάτες της είναι κυρίως εκδοτικοί οργανισμοί και γενικά όποιος δουλεύει στο γραφείο με έγγραφα που αποθηκεύονται σε φυσικό χαρτί. Με αυτόν τον τρόπο, όλες οι καινοτομίες του Alto μεταφέρθηκαν στο Star με έμφαση στην δυνατότητα προσομοίωσης του φυσικού χαρτιού στην οθόνη του υπολογιστή και γενικά στην επιφάνεια εργασίας με τις αντίστοιχες μεταφορές από το φυσικό γραφείο." />
<figcaption aria-hidden="true">Καθώς η εταιρεία Xerox ασχολείται
διαχρονικά με το φυσικό χαρτί και τις εκτυπώσεις οι πελάτες της είναι
κυρίως εκδοτικοί οργανισμοί και γενικά όποιος δουλεύει στο γραφείο με
έγγραφα που αποθηκεύονται σε φυσικό χαρτί. Με αυτόν τον τρόπο, όλες οι
καινοτομίες του Alto μεταφέρθηκαν στο Star με έμφαση στην δυνατότητα
προσομοίωσης του φυσικού χαρτιού στην οθόνη του υπολογιστή και γενικά
στην επιφάνεια εργασίας με τις αντίστοιχες μεταφορές από το φυσικό
γραφείο.</figcaption>
</figure>
<figure id="fig:magic-cap">
<img src="../images/magic-cap.png"
alt="Η χρήση της μεταφοράς αντικειμένων από τον πραγματικό κόσμο στο λειτουργικό σύστημα Magic Cap του φορητού υπολογιστή επικοινωνίας της General Magic είναι εμπνευσμένη από την επιτυχία που είχαν οι ανάλογες μεταφορές στον επιτραπέζιο υπολογιστή, αν και σε αυτήν την περίπτωση δεν μεταφράστηκαν σε αντίστοιχη εμπορική επιτυχία." />
<figcaption aria-hidden="true">Η χρήση της μεταφοράς αντικειμένων από
τον πραγματικό κόσμο στο λειτουργικό σύστημα Magic Cap του φορητού
υπολογιστή επικοινωνίας της General Magic είναι εμπνευσμένη από την
επιτυχία που είχαν οι ανάλογες μεταφορές στον επιτραπέζιο υπολογιστή, αν
και σε αυτήν την περίπτωση δεν μεταφράστηκαν σε αντίστοιχη εμπορική
επιτυχία.</figcaption>
</figure>
<p>Η εξομοίωση και η προσομοίωση παρέχουν δύο σημαντικούς τρόπους
θεώρησης της λειτουργίας του υπολογισμού και των εφαρμογών του.
Χρονολογικά, η εξομοίωση είναι προγενέστερη της προσομοίωσης, καθώς
περιγράφεται από τον Άλαν Τούρινγκ ως ένα χαρακτηριστικό της γενικής
μηχανής υπολογισμού. Η δυνατότητα της εξομοίωσης επιτρέπει σε ένα
μηχάνημα να εξομοιώνει την λειτουργία κάποιου άλλου διαφορετικού
μηχανήματος.Υπάρχουν πολλές δημοφιλείς μηχανές εξομοίωσης για τους
μικροϋπολογιστές και τις παιχνιδομηχανές της δεκαετίας του 1980. Η
προσομοίωση αναφέρεται στην δυνατότητα ενός μηχανήματος να υπολογίζει
και να οπτικοποιεί την συμπεριφορά συστήματων για τα οποία δεν μπορεί να
γνωρίζει ακριβώς την λειτουργία τους, όπως είναι τα πολύπλοκα φυσικά ή
βιολογικά φαινόμενα. Για παράδειγμα, οι πρώτοι υπολογιστές
χρησιμοποιήθηκαν για τον υπολογισμό της τροχιάς ενός πυραύλου καθώς και
για την πρόβλεψη του καιρού, ενώ οι πιο πρόσφατες εφαρμογές της
προσομοίωσης περιλαμβάνουν την λειτουργία των βιολογικών κυτάρων καθώς
και των μικροσκοπικών σωματιδίων της ύλης.</p>
<p>Οι εφαρμογές της προσομοίωσης είναι από τις πιο πετυχημένες εμπορικά
εφαρμογές των υπολογιστών, αλλά αυτή η επιτυχία τους έχει επισκιάσει την
συμπληρωματική θεώρηση του υπολογισμού που βρίσκεται στην εξομοίωση.
Πράγματι, οι σύγχρονες προσομοιώσεις είναι τόσο εξελιγμένες σε
συμπεριφορά που μοιάζουν πολύ με το αντίστοιχο φαινόμενο που
προσομοιώνουν. Για παράδειγμα, ένας προσομοιωτής πτήσης, από τον πιο
απλό οικιακό, μέχρι τον πιο εξελιγμένο που χρησιμοποιείται για την
εκπαίδευση των πιλότων, μοιάζει πάρα πολύ με τον χειρισμό ενός αληθινού
αεροσκάφους. H θεώρηση της εξομοίωσης δεν έχει γίνει ακόμη τόσο
δημοφιλής όσο η προσομοίωση γιατί είναι πιο δύσκολη και απαιτεί
δημιουργικότητα και φαντασία. Η προσομοίωση ενός φυσικού φαινομένου
απαιτεί από εμάς την παρατήρηση και την κατανόηση του, αλλά η εξομοίωση
ενός νέου μηχανήματος απαιτεί από εμάς να το σχεδιάσουμε και να
φανταστούμε κάτι που δεν υπάρχει. Για παράδειγμα, πολλά βιντεοπαιχνίδια,
αν και αρχικά ο κλάδος ξεκίνησε επίσης ως προσομοίωση, παρουσιάζουν
γραφικά και συμπεριφορές που δεν βασίζονται σε προσομοίωση της
πραγματικότητας.</p>
<p>Η δημοφιλία της προσομοίωσης και η δυσκολία που παρουσιάζει η
εξομοίωση έχουν οδηγήσει τις περισσότερες εφαρμογές του παραδοσιακού
επιτραπέζιου υπολογισμού στην κατεύθυνση της προσομοίωσης του
πραγματικού κόσμου. Για παράδειγμα, η γραφική διεπαφή στον επιτραπέζιο
υπολογιστή είναι μια προσομοίωση της επιφάνειας εργασίας στον αληθινό
χώρο του γραφείου. <a href="#fn9" id="fnref9" class="footnote-ref"
role="doc-noteref"><sup>9</sup></a> <a href="#fn10" id="fnref10"
class="footnote-ref" role="doc-noteref"><sup>10</sup></a> Αντίστοιχα, οι
εφαρμογές επεξεργασίας εγγράφων είναι μια προσομοίωση των χάρτινων
εγγράφων του αληθινού κόσμου. Στην πραγματικότητα όμως, ο υπολογιστής,
με γραφικά ή χωρίς, δεν έχει κανένα περιορισμό για το πως θα είναι μια
γραφική διεπαφή ή μια εφαρμογή επεξεργασιάς εγγράφων. Σίγουρα η
προσομοίωση του αληθινού κόσμου στον κόσμο του υπολογιστή δημιουργεί μια
αρχική αίσθηση ευχρηστίας μέσα από την οικειότητα. Επομένως, για τα
μηχανήματα εκείνα που πρέπει να είναι εύχρηστα για ευκαιριακούς χρήστες
η προσομοίωση είναι μια χρήσιμη τεχνική, αλλά σίγουρα δεν είναι
αντιπροσωπευτική των δυνατοτήτων που θέλουμε να έχουμε αν ο στόχος μας
είναι η επαύξηση της ανθρώπινης νοημοσύνης. Επιπλέον, για κάποιες
εφαρμογές διάδρασης σε πραγματικό χρόνο, όπως είναι η μουσική και η
ζωγραφική, η προσομοίωση τους στον συμβολικό χώρο του υπολογισμού
αφαιρεί δυνατότητες που βρίσκονται πέρα από τις γνώσεις μας, αλλά ήταν
προσβάσιμες στα αρχικά αναλογικά εργαλεία ήχου και χρώματος.</p>
<p>Η πιο δημοφιλής μορφή και ταυτόχρονα ιδιάζουσα περίπτωση προσομοίωσης
συναντάται στον κινητό υπολογισμό της δεκαετίας του 2010, όπου οι
συσκευές διάδρασης μικραίνουν σε μέγεθος και προσομοιώνουν τις εφαρμογές
του επιτραπέζιου υπολογισμού, αντί να ορίσουν νέα παραδείγματα συμβατά
με το κινητό πλαίσιο χρήσης. Για παράδειγμα, τα πρώτα κινητά λειτουργικά
συστήματα της Microsoft έχουν γραφικό περιβάλλον με κουμπί εκκίνησης,
ενώ όλα τα συστήματα βασίζονται στην ιδέα των εφαρμογών για την οργάνωση
του λογισμικού τους. Όπως έχουμε ήδη αναλύσει στην ενότητα των Μορφών,
οι εφαρμογές λογισμικού είναι μια πολύ συγκεκριμένη μορφή οργάνωσης του
λογισμικού, η οποία ωφελεί κυρίως την κυρίαρχη πλατφόρμα λειτουργικού
συστήματος. Με άλλα λόγια, οι κατασκευαστές λογισμικού επέλεξαν, για
άλλη μια φορά, να βελτιστοποιήσουν τα συμφέροντα τους, τα οποία
παρουσιάζουν στους χρήστες ως οικειότητα και ευχρηστία. Στην πράξη όμως,
αυτό που πραγματικά προσφέρουν στους τελικούς χρήστες είναι μια
προσομοίωση ενός παραδείγματος του επιτραπέζιου υπολογισμού σε ένα νέο
πλαίσιο χρήσης, το οποίο είναι πολύ διαφορετικό. Με αυτόν τον τρόπο, τα
κινητά συστήματα είναι μια ακόμη χαμένη ευκαιρία, μετά τα επιτραπέζια,
αφού παγιδεύονται στην θεώρηση της προσομοίωσης και δεν εξετάζουν
καθόλου την εξομοίωση νέων συστήματων διάδρασης.</p>
<figure id="fig:ed-editor">
<img src="../images/ed-editor.jpg"
alt="Ο επεξεργαστής κειμένου ED λειτουργεί σε επίπεδο γραμμής, γιατί ανάπτυχθηκε σε ένα περιβάλλον χρήστη, όπου η βασική συσκευή εισόδου και εξόδου είναι ο τηλέτυπος. Αν και δεν είναι εύχρηστος, παραμένει από την δημιουργία του συστήματος UNIX ο βασικός επεξεργαστής κειμένου, καθώς είναι απλός στην υλοποίηση και συμβατός με τις γλώσσες προγραμματισμού σε γραμμή εντολών." />
<figcaption aria-hidden="true">Ο επεξεργαστής κειμένου ED λειτουργεί σε
επίπεδο γραμμής, γιατί ανάπτυχθηκε σε ένα περιβάλλον χρήστη, όπου η
βασική συσκευή εισόδου και εξόδου είναι ο τηλέτυπος. Αν και δεν είναι
εύχρηστος, παραμένει από την δημιουργία του συστήματος UNIX ο βασικός
επεξεργαστής κειμένου, καθώς είναι απλός στην υλοποίηση και συμβατός με
τις γλώσσες προγραμματισμού σε γραμμή εντολών.</figcaption>
</figure>
<figure id="fig:unix-tmg">
<img src="../images/unix-tmg.png"
alt="Για τον μετασχηματισμό από την αρχική έκδοση του UNIX που ήταν γραμμένη σε συμβολική γλώσσα μηχανής σε μια έκδοση που βασίζεται σε μια γλώσσα υψηλού επιπέδου όπως η B και η C, χρειάστηκε να δημιουργηθεί από την αρχή ένας μεταφραστής. Η διαδικασία δημιουργίας του μεταφραστή είναι σημαντική γιατί είναι μια δεξιότητα που επιτρέπει την δημιουργία μιας νέας γλώσσας, αφού η αρχική εκδοχή του μεταφραστή μπορεί να είναι πού απλή και να γραφεί απευθείας σε συμβολική γλώσσα μηχανής." />
<figcaption aria-hidden="true">Για τον μετασχηματισμό από την αρχική
έκδοση του UNIX που ήταν γραμμένη σε συμβολική γλώσσα μηχανής σε μια
έκδοση που βασίζεται σε μια γλώσσα υψηλού επιπέδου όπως η B και η C,
χρειάστηκε να δημιουργηθεί από την αρχή ένας μεταφραστής. Η διαδικασία
δημιουργίας του μεταφραστή είναι σημαντική γιατί είναι μια δεξιότητα που
επιτρέπει την δημιουργία μιας νέας γλώσσας, αφού η αρχική εκδοχή του
μεταφραστή μπορεί να είναι πού απλή και να γραφεί απευθείας σε συμβολική
γλώσσα μηχανής.</figcaption>
</figure>
<p>Η περίπτωση των συστημάτων διάδρασης ανοιχτού κώδικα είναι εξίσου
ιδιάζουσα με αυτή του κινητού υπολογισμού γιατί προσομοιώνει το γραφικό
περιβάλλον εργασίας και τις εφαρμογές των κυρίαρχων συστήματων. Για
παράδειγμα, τα πιο δημοφιλή γραφικά περιβάλλοντα με επιφάνεια εργασίας
όπως τα Gnome, KDE, είναι αντίγραφα των Windows, MacOS. Ταυτόχρονα, οι
αντίστοιχες εφαρμογές γραφείου ανοιχτού κώδικα OpenOffice, LibreOffice
είναι επίσης αντίγραφα των αντίστοιχων εφαρμογών Microsoft Office, Apple
iWork. Ο ανοιχτός κώδικας σε επίπεδο εφαρμογής και περιβάλλοντος ήταν
δεδομένος στο σύστημα Smalltalk του Alto, αλλά οι κατασκευαστές του
είχαν κάνει πολλές ακόμη αρχιτεκτονικές επιλογές που αναλύουμε σε άλλα
μέρη του κειμένου. Ακόμη και πέρα από τον χώρο της διάδρασης που
διαπραγματευόμαστε εδώ, οι κατασκευαστές ανοιχτού λογισμικού φαίνονται
παγιδευμένοι στην αναπαραγωγή της υπάρχουσας κατάστασης παρά στην
καινοτομία. Πράγματι, ο κατασκευαστής του πυρήνα του Linux επέλεξε στις
αρχές τις δεκαετίας του 1990 να φτιάξει μια εκδοχή ενός παραδοσιακού
πυρήνα που υπάρχει από τις αρχές του 1970 και ταυτόχρονα να βρει
καθολική ανταπόκριση από πολλές διαφορετικές ομάδες χρηστών. Σίγουρα η
διάθεση του λογισμικού με ανοιχτού κώδικα έχει περισσότερα πλεονεκτήματα
από το ίδιο με κλειστό κώδικα, αλλά αν η αρχιτεκτονική του και η
διάδραση του είναι ίδια ακριβώς με αυτή του κλειστού κώδικα, τελικά το
κίνημα του ανοιχτού κώδικα καταλήγει να εξυπηρετεί όχι μόνον τον εαυτό
του, αλλά κυρίως τα συμφέροντα των κατασκευαστών κλειστού λογισμικού, οι
οποίοι μπορούν πλέον να ετεροπροσδιορίζονται ως τεχνολογία. Τελικά αυτό
δεν εξυπηρετεί την πραγματική βελτίωση της ποιότητας του λογισμικού
διάδρασης, που μπορεί να γίνει μόνο με τους κατάλληλους εξομοιωτές για
νέα συστήματα που δεν υπάρχουν, καθώς και με εξομοίωση συστημάτων
εισόδου και εξόδου δεδομένων. <a href="#fn11" id="fnref11"
class="footnote-ref" role="doc-noteref"><sup>11</sup></a> <a
href="#fn12" id="fnref12" class="footnote-ref"
role="doc-noteref"><sup>12</sup></a></p>
<p>Τόσο τα πρώτα πειραματικά βιντεοπαιχνίδια, όσο και τα δημοφιλή
προϊοντα των επόμενων δεκαετιών συνήθως βασίζονται στην θεώρηση της
προσομοίωσης. Για παράδειγμα, το βιντεοπαιχνίδι Tennis for two <a
href="#fn13" id="fnref13" class="footnote-ref"
role="doc-noteref"><sup>13</sup></a> δημιουργήθηκε για έναν αναλογικό
υπολογιστή με οπτικοποίηση στην οθόνη ενός φασματοσκόπιου, όπου οι δύο
παίκτες έπαιζαν τένις σε πρόσοψη. Μερικά χρόνια αργότερα, το δημοφιλές
βιντεοπαιχνίδι Pong αντιγράφει το Table Tennis for Two <a href="#fn14"
id="fnref14" class="footnote-ref" role="doc-noteref"><sup>14</sup></a>
και χρησιμοποιεί την οπτικοποίηση της κάτοψης. Επίσης, ένα από τα πρώτα
δημοφιλή βιντεοπαιχνίδια την δεκαετία του 1960 σε μίνι-υπολογιστές είναι
το Spacewar, στο οποίο οι παίκτες κάνουν μια αερομαχία στο διάστημα σε
συνθήκες βαρύτητας γύρω από πλανητικό κέντρο. Αντίστοιχα, την δεκαετία
του 1970, πολλοί προγραμματιστές αποκτούν την πρώτη τους επαφή με τον
υπολογιστή με τον ευρέως διαθέσιμο κώδικα του βιντεοπαιχνιδιού Lunar
Lander, όπου ο παίκτης προσπαθεί να προσγειώσει ένα διαστημόπλοιο στην
σελήνη. Παρατηρούμε, ότι και στις δύο περιπτώσεις, εκτός από την
προσομοίωση της φυσικής πραγματικότητας, η θεματολογία των
βιντεοπαιχνιδιών είναι έντονα επηρεασμένη από την τότε πολιτική και
πολιτιστική πραγματικότητα ή από μια αθλητική και παιγνιώδη
δραστηριότητα. Μετά την δεκαετία του 1970 εμφανίζονται, πολύ δειλά και
ως αφαιρετικοί μετασχηματισμοί των προηγούμενων, τα πρώτα καινοτόμα
βιντεοπαιχνίδια, όπως ήταν τα Breakout και Space Invaders, αλλά το
παράδειγμα της προσομοίωσης παραμένει κυρίαρχο.</p>
<figure id="fig:tennis-for-two">
<img src="../images/tennis-for-two.jpg"
alt="Το βιντεοπαιχνίδι Tennis for Two είναι μια σχετικά πιστή προσομοίωση του τένις για δύο παίκτες όπως αυτό φαίνεται από το πλάϊ σε πρόσοψη. Κατασκευάστηκε σε αναλογικό ηλεκτρονικό υπολογιστή και για την οπτικοποίηση του χρησιμοποιήθηκε ένα φασματοσκόπιο. Η επίδραση του ήταν καταλυτική αφού έδωσε την έμπνευση για το δημοφιλές Pong, ενώ για πολλές δεκαετίες μετά τα βιντεοπαιχνίδια προσομοίωσης αθλημάτων παραμένουν πολύ δημοφιλή." />
<figcaption aria-hidden="true">Το βιντεοπαιχνίδι Tennis for Two είναι
μια σχετικά πιστή προσομοίωση του τένις για δύο παίκτες όπως αυτό
φαίνεται από το πλάϊ σε πρόσοψη. Κατασκευάστηκε σε αναλογικό ηλεκτρονικό
υπολογιστή και για την οπτικοποίηση του χρησιμοποιήθηκε ένα
φασματοσκόπιο. Η επίδραση του ήταν καταλυτική αφού έδωσε την έμπνευση
για το δημοφιλές Pong, ενώ για πολλές δεκαετίες μετά τα βιντεοπαιχνίδια
προσομοίωσης αθλημάτων παραμένουν πολύ δημοφιλή.</figcaption>
</figure>
<figure id="fig:magnavox-odyssey">
<img src="../images/magnavox-odyssey.jpg"
alt="Η πρώτη εμπορικά πετυχημένη οικιακή κονσόλα βιντεοπαιχνιδιών είχε μόνο την δυνατότητα να μετακινεί τρία σημεία στην τηλεόραση του χρήστη με τα δύο χειριστήρια με τροχαλία, ενώ δεν είχε την δυνατότητα να εκτελέσει νέα παιχνίδια εκτός από αυτά που ήταν ήδη αποθηκευμένα στην εσωτερική μνήμη ανάγνωσης. Με την βοήθεια ενός σετ από περιφερειακά όπως χρωματισμένες ημιδιαφανείς ζελατίνες για την τηλεόραση και κάρτες επιτραπέζιων παιχνιδιών δημιούργησε την βιομηχανία των βιντεοπαιχνιδιών. To πιο γνωστό παιχνίδι ήταν το Table Tennis for Two, το οποίο πολύ γρήγορα βελτιώθηκε από την Atari με το δημοφιλές Pong." />
<figcaption aria-hidden="true">Η πρώτη εμπορικά πετυχημένη οικιακή
κονσόλα βιντεοπαιχνιδιών είχε μόνο την δυνατότητα να μετακινεί τρία
σημεία στην τηλεόραση του χρήστη με τα δύο χειριστήρια με τροχαλία, ενώ
δεν είχε την δυνατότητα να εκτελέσει νέα παιχνίδια εκτός από αυτά που
ήταν ήδη αποθηκευμένα στην εσωτερική μνήμη ανάγνωσης. Με την βοήθεια
ενός σετ από περιφερειακά όπως χρωματισμένες ημιδιαφανείς ζελατίνες για
την τηλεόραση και κάρτες επιτραπέζιων παιχνιδιών δημιούργησε την
βιομηχανία των βιντεοπαιχνιδιών. To πιο γνωστό παιχνίδι ήταν το Table
Tennis for Two, το οποίο πολύ γρήγορα βελτιώθηκε από την Atari με το
δημοφιλές Pong.</figcaption>
</figure>
<p>Τα βιντεοπαιχνίδια σε κονσόλες και σε μικροϋπολογιστές των δεκαετιών
του 1970 και 1980 απέκτησαν μια δεύτερη ζωή μακρυά από το αρχικό υλικό
τους με την τεχνολογία της εξομοίωσης μετά το 2000. Η βελτιωμένη
επεξεργαστική ισχύς των επιτραπέζιων συστημάτων επέτρεψε την ανάπτυξη
εξομοιωτών που μπορούσαν να εκτελέσουν το παλαιότερο λογισμικό σε μια
αντίστροφη κίνηση, όπου τα διαθέσιμα συστήματα και η θεώρηση της
εξομοίωσης δεν χρησιμοποιούνται για να μας πάνε παρακάτω, αλλά πίσω στον
χρόνο. Με αυτόν τον τρόπο, μια νέα γενιά χρηστών χρησιμοποιεί συστήματα
που δεν υπάρχουν, ενώ και πολλοί παλιότεροι ζουν στην πράξη τις
αναμνήσεις τους. Σίγουρα η εξομοίωση παλιών συστήματων που δεν είναι
πλέον ευρέως διαθέσιμα είναι μια άριστη πρακτική για να έχουμε πρόσβαση
σε παλαιότερο λογισμικό, ακόμη και για να αναπτύξουμε νέο λογισμικό για
αυτό το δυσεύρετο πλέον υλικό. Ταυτόχρονα όμως αυτή η κάπως
οπισθοδρομική εφαρμογή της θεώρησης της εξομοίωσης επιβεβαιώνει ότι τόσο
οι κατασκευαστές όσο και η χρήστες έχουν μια έμφυτη τάση στην
αναπαραγωγή της υπάρχουσας κατάστασης, παρά στην δημιουργία καινοτομίας,
ακόμη και όταν έχουν στην διάθεση τους τα κατάλληλα εργαλεία, όπως είναι
οι ισχυροί και δικτυωμένοι προσωπικοί υπολογιστές και η τεχνική της
εξομοίωσης.</p>
<p>Πέρα από το γραφικό περιβάλλον και τα έγγραφα στον επιτραπέζιο
υπολογισμό, η μονοθεματική θεώρηση της προσομοίωσης είναι επίσης το
κυρίαρχο παράδειγμα ακόμη και σε καινοτόμα συστήματα διάδρασης, όπως
είναι η εικονική πραγματικότητα. Η εικονική πραγματικότητα όπως
περιγράφηκε αρχικά από τον Jaron Lanier ήταν μια προσπάθεια εξομοίωσης
ενός κόσμου που δεν υπάρχει. Δεν είναι τυχαίο ότι ο δημιουργός και νονός
της θεωρεί ατυχές το όνομα εικονική πραγματικότητα, αφού δηλώνει μια
προσομοίωση. Πράγματι, στις δικές του πειραματικές εφαρμογές εικονικής
πραγματικότητας, ο χαρακτήρας δεν μοιάζει με άνθρωπο, αλλά με χταπόδι, ή
με κάποιο άλλο δημιούργημα που δεν υπάρχει. Ταυτόχρονα η οπτικοποίηση
και η συμπεριφορά του εικονικού κόσμου δεν προσομοιώνει τον πραγματικό
κόσμο της ανθρώπινης εμπειρίας, αλλά έναν κόσμο που δεν υπάρχει. Ο
στόχος της εξομοίωσης μιας δυνητικής πραγματικότητας είναι να
εμπλουτίσει την ανθρώπινη εμπειρία και να επαυξήσει την ανθρώπινη
νοημοσύνη σε ευρύτερα πεδία, όπου δεν υπάρχει απευθείας πρόσβαση μέσα
από το φυσικό περιβάλλον.<a href="#fn15" id="fnref15"
class="footnote-ref" role="doc-noteref"><sup>15</sup></a> Αντίθετα, οι
περισσότερες εφαρμογές εικονικής πραγματικότητας προσπαθούν να
προσομοιώσουν την πραγματικότητα όσο πιο πιστά γίνεται, τόσο στην
εμφάνιση της με γραφικά, όσο και στην συμπεριφορά του κόσμου και των
χαρακτήρων. Αν και τα συστήματα εικονικής πραγματικότητας είχαν μικρή
εμβέλεια για πολλές δεκαετίες, αποτελούν άλλη μια σημαντική χαμένη
ευκαιρία για την εξερεύνηση της εξομοίωσης ως βασικής θεώρησης
κατασκευής νέων διαδραστικών συστημάτων.</p>
<figure id="fig:lisa-bootstrapping">
<img src="../images/lisa-bootstrapping.jpg"
alt="Η κατασκευή λογισμικού για ένα νέο υλικό υπολογιστή που δεν υπάρχει ακόμη μπορεί να ξεκινήσει με έναν διαθέσιμο υπολογιστή στον οποίο γίνεται εξομοίωση της αρχιτεκτονικής του νέου συστήματος. Με αυτόν τον τρόπο, ο διαθέσιμος Apple II χρησιμοποιήθηκε για την κατασκευή της γραφικής διεπαφής του Apple Lisa σε μια επαναληπτική διαδικασία που ξεκίνησε από τα διαθέσιμα εργαλεία τα οποία υποστήριζαν μόνο χαρακτήρες κειμένου σε μια μαύρη οθόνη." />
<figcaption aria-hidden="true">Η κατασκευή λογισμικού για ένα νέο υλικό
υπολογιστή που δεν υπάρχει ακόμη μπορεί να ξεκινήσει με έναν διαθέσιμο
υπολογιστή στον οποίο γίνεται εξομοίωση της αρχιτεκτονικής του νέου
συστήματος. Με αυτόν τον τρόπο, ο διαθέσιμος Apple II χρησιμοποιήθηκε
για την κατασκευή της γραφικής διεπαφής του Apple Lisa σε μια
επαναληπτική διαδικασία που ξεκίνησε από τα διαθέσιμα εργαλεία τα οποία
υποστήριζαν μόνο χαρακτήρες κειμένου σε μια μαύρη οθόνη.</figcaption>
</figure>
<figure id="fig:emulators">
<img src="../images/emulators.jpg"
alt="Ο εξομοιωτής σε ένα σύγχρονο γραφικό περιβάλλον μπορεί να εκτελέσει το λογισμικό για ένα παλιότερο γραφικό περιβάλλον, το οποίο με την σειρά του μπορεί να εκτελέσει έναν εξομοιωτή για ένα ακόμη παλιότερο σύστημα με γραμμή εντολών. Με αυτόν τον τρόπο, μπορούμε να εξομοιώσουμε ένα παλιότερο σύστημα ακόμη και αν δεν έχουμε εξομοιωτή για αυτό, αρκεί να έχουμε για μια σειρά από ενδιάμεσα συστήματα. Το ιδανικό είναι να εκμεταλευτούμε αυτήν την τεχνική για νέα συστήματα και όχι μόνο για αναβίωση των παλιότερων." />
<figcaption aria-hidden="true">Ο εξομοιωτής σε ένα σύγχρονο γραφικό
περιβάλλον μπορεί να εκτελέσει το λογισμικό για ένα παλιότερο γραφικό
περιβάλλον, το οποίο με την σειρά του μπορεί να εκτελέσει έναν εξομοιωτή
για ένα ακόμη παλιότερο σύστημα με γραμμή εντολών. Με αυτόν τον τρόπο,
μπορούμε να εξομοιώσουμε ένα παλιότερο σύστημα ακόμη και αν δεν έχουμε
εξομοιωτή για αυτό, αρκεί να έχουμε για μια σειρά από ενδιάμεσα
συστήματα. Το ιδανικό είναι να εκμεταλευτούμε αυτήν την τεχνική για νέα
συστήματα και όχι μόνο για αναβίωση των παλιότερων.</figcaption>
</figure>
<p>Μια ερμηνεία για αυτήν την τάση εξομοίωσης μπορούμε να αντλήσουμε από
το γνωστικο πεδίο των μέσων επικοινωνίας. Για παράδειγμα, στο παρελθόν η
εισαγωγή της τεχνολογίας της τηλεόρασης θεωρήθηκε μια συνέχεια της
τεχνολογίας του ραδιοφώνου. Οπότε, η παραγωγή του περιεχομένου που θα
φιλοξενούσε το νέο μέσο θα ήταν μια γραμμική βελτίωση του περιεχομένου
που υπήρχε στο ραδιόφωνο. Με αυτό το σκεπτικό δεν ήταν καθόλου περίεργο
που η τηλεόραση αρχικά ορίστηκε ως “ραδιόφωνο με εικόνα” και με δεδομένο
αυτόν τον σχετικά στενό ορισμό, ήταν επόμενο το περιεχόμενο των εκπομπών
τηλεόρασης, τα πρώτα χρόνια, να μην είναι κάτι παραπάνω από μια στατική
εικόνα με ήχο.<a href="#fn16" id="fnref16" class="footnote-ref"
role="doc-noteref"><sup>16</sup></a> Μια ακόμη ερμηνεία, για την ανάγκη
να χρησιμοποιούμε μεταφορές από τον πραγματικό κόσμο, τις οποίες τις
προσαρμόζουμε στον ψηφιακό κόσμο των υπολογιστών μπορούμε να αντλήσουμε
από το γνωστικό πεδίο της φιλοσοφίας. Πράγματι, είναι ευκολότερο να
κατανοήσουμε κάτι νέο αν το χρησιμοποιήσουμε σαν κάτι παλιότερο.<a
href="#fn17" id="fnref17" class="footnote-ref"
role="doc-noteref"><sup>17</sup></a></p>
<p>Όσο εύκολο είναι να περιγράψουμε τα δημοφιλή συστήματα διάδρασης που
βασίζονται στην θεώρηση της προσομοίωσης, άλλο τόσο δύσκολο είναι να
περιγράψουμε εκείνα που βασίζονται στην εξομοίωση, <a href="#fn18"
id="fnref18" class="footnote-ref" role="doc-noteref"><sup>18</sup></a>
αφού δεν έχουμε κρίσιμη μάζα γνώσης για αυτά.<a href="#fn19"
id="fnref19" class="footnote-ref" role="doc-noteref"><sup>19</sup></a>
Ένα από τα λίγα γνωστά συστήματα διάδρασης που βασίζονται στην εξομοίωση
περιγράφεται από τον Alan Kay στην κατασκευή του Alto. Το λογισμικό για
το λειτουργικό υπόδειγμα του Alto που βασίζεται στην περιβάλλον
προγραμματισμού Smalltalk κατασκευάστηκε με την εξομοίωση του πάνω σε
έναν μίνι-υπολογιστή στις αρχές του 1970 και πολύ πριν οι ερευνητές του
Xerox PARC κατασκευάσουν το πραγματικό υλικό του Alto.<a href="#fn20"
id="fnref20" class="footnote-ref" role="doc-noteref"><sup>20</sup></a>
Εκείνος ο μίνι-υπολογιστής δούλευε με τηλέτυπο χωρίς οθόνη γραφικών και
ποντίκι ενώ και η γλώσσα προγραμματισμού του ήταν πολύ διαφορετική από
την Smalltalk, αλλά αυτά δεν εμπόδισαν τους κατασκευαστές του Alto να
φανταστούν ένα διαδραστικό γραφικό περιβάλλον και να το εξομοιώσουν
αρχικά πάνω σε ξένο υλικό, πριν τελικά το κατασκευάσουν και στην
πραγματικότητα. Παρόμοια τεχνική εξομοίωσης χρησιμοποίησε και ο Bill
Atkinson για την κατασκευή του λογισμικού διάδρασης για το Apple Lisa.
<a href="#fn21" id="fnref21" class="footnote-ref"
role="doc-noteref"><sup>21</sup></a> Για τον σκοπό αυτό, χρησιμοποίησε
μια επέκταση του δημοφιλούς εκείνη την εποχή Apple II για να
κατασκευάσει σταδιακά με την γλώσσα PASCAL ένα γραφικό περιβάλλον που
λίγο διαφέρει από αυτό των σύγχρονων επιτραπέζιων συστημάτων και όλα
αυτά ενώ είχε μπροστά του μόνο έναν μικροϋπολογιστή με διάδραση σε
γραμμή εντολών και χωρίς ποντίκι και παραθυρικό περιβάλλον. Επομένως,
ένα βασικό συστατικό διάδρασης που εμφανίζουν τα συστήματα που έχουν
κατεύθυνση την εξομοίωση είναι ότι επιτρέπουν την κατασκευή νέων
εργαλείων, που δεν περιορίζονται από εσωτερικές παραδοχές και κανόνες,
όπως συνήθως συμβαίνει στα συστήματα προσομοίωσης.</p>
<figure id="fig:nova">
<img src="../images/nova.jpg"
alt="Ακόμη και ο μικρότερος μίνι-υπολογιστής στα τέλη της δεκαετίας του 1960 δεν μοιάζει καθόλου με έναν επιτραπέζιο σύστημα διάδρασης, αφού το βασικό μοντέλο έχει μόνο διάκοπτες με φωτάκια και με μια επέκταση μπορεί να συνδεθεί σε έναν τηλέτυπο. Αυτό δεν ήταν εμπόδιο για τους ερευνητές του Xerox PARC που με την τεχνική της εξομοίωσης άρχισαν πάνω σε αυτό το μηχάνημα την κατασκευή του λογισμικού για το Alto που είναι πολύ διαφορετικό αφού βασίζεται στο ποντίκι και στην γραφική διεπαφή." />
<figcaption aria-hidden="true">Ακόμη και ο μικρότερος μίνι-υπολογιστής
στα τέλη της δεκαετίας του 1960 δεν μοιάζει καθόλου με έναν επιτραπέζιο
σύστημα διάδρασης, αφού το βασικό μοντέλο έχει μόνο διάκοπτες με φωτάκια
και με μια επέκταση μπορεί να συνδεθεί σε έναν τηλέτυπο. Αυτό δεν ήταν
εμπόδιο για τους ερευνητές του Xerox PARC που με την τεχνική της
εξομοίωσης άρχισαν πάνω σε αυτό το μηχάνημα την κατασκευή του λογισμικού
για το Alto που είναι πολύ διαφορετικό αφού βασίζεται στο ποντίκι και
στην γραφική διεπαφή.</figcaption>
</figure>
<figure id="fig:altair-teletype">
<img src="../images/altair-teletype.jpg"
alt="O Altair θεωρείται ο πρώτος δημοφιλής μικροϋπολογιστής και ήταν διαθέσιμος σε οικονομικό κιτ το οποίο ο χρήστης συναρμολογούσε μόνος του και στην συνέχεια θα έπρεπε να αγοράσει και τα σχετικά περιφεριακά εισόδου και εξόδου, όπως ο τηλέτυπος για την είσοδο και έξοδο κειμένου, τα οποία κόστιζαν ακόμη περισσότερο. Ήταν όμως πολύ πιο προσιτός από τους μίνιϋπολογιστές εκείνης της εποχής και επιπλέον ήταν διαθέσιμοι με την επίσης προσιτή γλώσσα προγραμματισμού BASIC." />
<figcaption aria-hidden="true">O Altair θεωρείται ο πρώτος δημοφιλής
μικροϋπολογιστής και ήταν διαθέσιμος σε οικονομικό κιτ το οποίο ο
χρήστης συναρμολογούσε μόνος του και στην συνέχεια θα έπρεπε να αγοράσει
και τα σχετικά περιφεριακά εισόδου και εξόδου, όπως ο τηλέτυπος για την
είσοδο και έξοδο κειμένου, τα οποία κόστιζαν ακόμη περισσότερο. Ήταν
όμως πολύ πιο προσιτός από τους μίνιϋπολογιστές εκείνης της εποχής και
επιπλέον ήταν διαθέσιμοι με την επίσης προσιτή γλώσσα προγραμματισμού
BASIC.</figcaption>
</figure>
<p>Αμέσως μετά τους πρωτοπόρους του δημιουργικού μετασχηματισμού του
υπολογιστών σε μια νέα μορφή Douglas Engelbart και Ivan Sutherland, οι
ερευνητές του Xerox PARC εφάρμοσαν την τεχνική της εξομοίωσης, έτσι ώστε
να μπορούν να εργάζονται με το σύστημα που ήθελαν και όχι απλά με αυτό
που είχαν διαθέσιμο. Πράγματι, η Xerox μόλις είχε αγοράσει την
Scientific Data Systems (SDS) και αγνόησε το αίτημα των ερευνητών του
PARC για την αγορά του ανταγωνιστικού DEC PDP, το οποίο ήταν πολύ
δημοφιλές ανάμεσα στους συναδέλφους ερευνητές σε άλλους οργανισμούς και
στο δίκτυο ερευνητικής συνεργασίας ARPANET. Στην πράξη όμως αυτό δεν
ήταν μεγάλο πρόβλημα, αφού με την τεχνική της εξομοίωσης οι ερευνητές
του PARC δημιούργησαν το PDP με μικροκώδικα πάνω στο φυσικό μηχάνημα της
SDS. Με τον ίδιο ακριβώς τρόπο, χρησιμοποίησαν το μηχάνημα Data General
Nova για να αναπτύξουν το λογισμικό για το Alto, πολύ πριν έχουν στην
διάθεση τους το υλικό της αρχική έκδοση του Alto. Παρόμοια ο Niklaus
Wirth θα καταφέρει να εκτελέσει και να ενημερώσει είκοσι-πέντε χρόνια
μετά την βάση για το αρχικό λογισμικό διάδρασης για το σύστημα Oberon<a
href="#fn22" id="fnref22" class="footnote-ref"
role="doc-noteref"><sup>22</sup></a> με την δημιουργία ενός νέου
υπολογιστή με την τεχνική των προγραμμάτων για FPGA, δηλαδή υλικό που
επιτρέπει την εξομοίωση άλλου υλικού υπολογιστή. Για τους ερευνητές του
PARC και τους συνεργάτες τους, η διάδραση με τους υπολογιστές σημαίνει
κυρίως την κατασκευή ενός νέου υπολογιστή και του περιβάλλοντος
ανάπτυξης που περιλαμβάνει τον μεταγλωτιστή και τον επεξεργαστή
κειμένου, τα οποία αρχικά θα πρέπει να εξομοιωθούν στα πρώτα στάδια της
ανάπτυξης πάνω σε ένα διαφορετικό από το τελικό φυσικό μηχάνημα. Η
επιλογή της εξομοίωσης μπορεί να γίνει αρχιτεκτονική επιλογή, όπως στην
περίπτωση της JAVA όπου ο κατασκευαστής φροντίζει για την εκτέλεση μόνο
πάνω σε μια εικονική μηχανή και αφήνει την υλοποίηση του κατώτερου
επιπέδου στους επιμέρους κατασκευαστές υλικού. <a href="#fn23"
id="fnref23" class="footnote-ref" role="doc-noteref"><sup>23</sup></a>
<a href="#fn24" id="fnref24" class="footnote-ref"
role="doc-noteref"><sup>24</sup></a></p>
<section id="footnotes" class="footnotes footnotes-end-of-section"
role="doc-endnotes">
<hr />
<ol start="9">
<li><div id="fn9">
<p>fig:paper-simulation<a href="#fnref9" class="footnote-back"
role="doc-backlink">↩︎</a></p>
</div></li>
<li><div id="fn10">
<p>fig:magic-cap<a href="#fnref10" class="footnote-back"
role="doc-backlink">↩︎</a></p>
</div></li>
<li><div id="fn11">
<p>fig:ed-editor<a href="#fnref11" class="footnote-back"
role="doc-backlink">↩︎</a></p>
</div></li>
<li><div id="fn12">
<p>fig:unix-tmg<a href="#fnref12" class="footnote-back"
role="doc-backlink">↩︎</a></p>
</div></li>
<li><div id="fn13">
<p>fig:tennis-for-two<a href="#fnref13" class="footnote-back"
role="doc-backlink">↩︎</a></p>
</div></li>
<li><div id="fn14">
<p>fig:magnavox-odyssey<a href="#fnref14" class="footnote-back"
role="doc-backlink">↩︎</a></p>
</div></li>
<li><div id="fn15">
<p><span class="citation" data-cites="engelbart1962augmenting">Engelbart
(1962)</span> <span class="citation" data-cites="lanier2010you">Lanier
(2010)</span><a href="#fnref15" class="footnote-back"
role="doc-backlink">↩︎</a></p>
</div></li>
<li><div id="fn16">
<p><span class="citation" data-cites="bolter2000remediation">Bolter και
Grusin (2000)</span><a href="#fnref16" class="footnote-back"
role="doc-backlink">↩︎</a></p>
</div></li>
<li><div id="fn17">
<p>lakoff2008metaphors<a href="#fnref17" class="footnote-back"
role="doc-backlink">↩︎</a></p>
</div></li>
<li><div id="fn18">
<p>fig:emulators<a href="#fnref18" class="footnote-back"
role="doc-backlink">↩︎</a></p>
</div></li>
<li><div id="fn19">
<p><span class="citation" data-cites="bardini2000bootstrapping">Bardini
(2000)</span><a href="#fnref19" class="footnote-back"
role="doc-backlink">↩︎</a></p>
</div></li>
<li><div id="fn20">
<p><span class="citation" data-cites="hiltzik1999dealers">Hiltzik
(1999)</span><a href="#fnref20" class="footnote-back"
role="doc-backlink">↩︎</a></p>
</div></li>
<li><div id="fn21">
<p>fig:lisa-bootstrapping<a href="#fnref21" class="footnote-back"
role="doc-backlink">↩︎</a></p>
</div></li>
<li><div id="fn22">
<p><span class="citation" data-cites="wirth1992project">Wirth και
Gutknecht (1992)</span><a href="#fnref22" class="footnote-back"
role="doc-backlink">↩︎</a></p>
</div></li>
<li><div id="fn23">
<p>fig:nova<a href="#fnref23" class="footnote-back"
role="doc-backlink">↩︎</a></p>
</div></li>
<li><div id="fn24">
<p>fig:altair-teletype<a href="#fnref24" class="footnote-back"
role="doc-backlink">↩︎</a></p>
</div></li>
</ol>
</section>
<h2 id="μοντελοποίηση-και-αναλογία">Μοντελοποίηση και Αναλογία</h2>
<figure id="fig:digital-desk">
<img src="../images/digital-desk.jpg"
alt="Το σύστημα Digital Desk δημιουργήθηκε στις αρχές του 1990 με στόχο να φέρει τις δυνατότητες διάδρασης μεταξύ του ψηφιακού και φυσικού κόσμου πάνω στο τραπέζι, ακριβώς δηλαδή, το αντίθετο από την κατεύθυνση που ακολουθεί ο επιτραπέζιος υπολογισμός από το 1980." />
<figcaption aria-hidden="true">Το σύστημα Digital Desk δημιουργήθηκε
στις αρχές του 1990 με στόχο να φέρει τις δυνατότητες διάδρασης μεταξύ
του ψηφιακού και φυσικού κόσμου πάνω στο τραπέζι, ακριβώς δηλαδή, το
αντίθετο από την κατεύθυνση που ακολουθεί ο επιτραπέζιος υπολογισμός από
το 1980.</figcaption>
</figure>
<figure id="fig:mit-clearboard">
<img src="../images/mit-clearboard.jpg"
alt="Το σύστημα συνεργασίας Clearboard του MIT Media Lab προβάλει το βίντεο από δύο συνεργάτες πάνω στην κοινή εφαρμογή ζωγραφικής, έτσι ώστε να υπάρχει σύγχρονη επίγνωση του βλέματος και των χειρονομιών." />
<figcaption aria-hidden="true">Το σύστημα συνεργασίας Clearboard του MIT
Media Lab προβάλει το βίντεο από δύο συνεργάτες πάνω στην κοινή εφαρμογή
ζωγραφικής, έτσι ώστε να υπάρχει σύγχρονη επίγνωση του βλέματος και των
χειρονομιών.</figcaption>
</figure>
<p>Η βασική τεχνολογία για την κατασκευή της διάδρασης παραμένει
διαχρονικά ο προγραμματισμός ενός υπολογιστή. Ο προγραμματισμός με την
σειρά του είναι μια σημαντική αλλά ξεχωριστή περίπτωση διάδρασης με τον
υπολογιστή που έχει περάσει από πολλά στάδια και συνεχίζει να
εξελίσεται. Οι πρώτοι κεντρικοί υπολογιστές όπως και ο πρώτος
μικροϋπολογιστής Altair προγραμματίζονταν με τους φυσικούς διακόπτες,
αλλά αυτό ήταν δύσκολο ειδικά για μεγάλα προγράμματα και σετ δεδομένων.
Για αυτόν τον λόγο, ο προγραμματισμός των υπολογιστών ξεκίνησε να
γίνεται με ασύγχρονο τρόπο μέσω της χρήσης διάτριτων καρτών σε σετ, ή
ακόμη καλύτερα με την χρήση διάτρητης χαρτοταινίας. Η εγγραφή και
ανάγνωση από διάτρητη χαρτοταινία ήταν πολύ οικονομική και τόσο
δημοφιλής για να βρίσκεται ενσωματωμένη ακόμη και πάνω στα νέα μοντέλα
συσκευής εισόδου και εξόδου που βασίζονταν στον τηλέτυπο, ο οποίος ήταν
για πολλές δεκαετίες ο βασικός τρόπος συγγραφής προγραμμάτων υπολογιστή
και επόμενως διάδρασης, αφού το πληκτρολόγιο και η διάτρητη χαρτοταινία
ήταν τα συστήματα εισόδου, ενώ η χαρτοταινία πάλι και η εκτύπωση ήταν τα
συστήματα εξόδου. Με αυτόν τον τρόπο, φτιάχτηκαν και τα πρώτα συστήματα
διάδρασης σε πραγματικό χρόνο, όπως ήταν η LISP και το JOSS, αλλά η
πλειοψηφία των συστημάτων λειτουργούσε ασύγχρονα με εργασίες δέσμης. Όλα
αυτά τα ηλεκτρομηχανικά συστήματα εισόδου και εξόδου από τον υπολογιστή
που βασίζονταν στο χάρτι θα αντικατασταθούν από τις ηλεκτρονικές και
αργότερα ψηφιακές οθόνες και το ποντίκι την δεκαετία του 1980, αλλά ο
προγραμματισμός του υπολογιστή θα παραμείνει μια διαδικασία που
βασίζεται σε γραπτές γλώσσες κειμένου που εισάγονται με το
πληκτρολόγιο.</p>
<p>Ανάμεσα στις πολλές τεχνολογίες λογισμικού για την κατασκευή νέων
διαδραστικών συστημάτων, οι γλώσσες προγραμματισμού που επιτρέπουν τόσο
την ανάπτυξη νέων συστημάτων όσο και την εξέλιξη της ίδιας της γλώσσας
έχουν διαχρονική αποτελεσματικότητα, αλλά με μεγάλο κόστος στην
εκμάθηση. Για παράδειγμα, η εκφραστική δύναμη της αρχικής γλώσσας Lisp
επιτρέπει την συγγραφή του μεταγλωτιστή της στην ίδια την γλώσσα, μια
επιλογή που δείχνει προς την κατεύθυνση της συνεχούς βελτίωσης της
γλώσσας προγραμματισμού, η οποία δεν είναι πλέον κάτι στατικό. Αυτή η
τεχνική χρησιμοποιήθηκε και κατά την δημιουργία του διαδραστικού
περιβάλλοντος Smalltalk, η οποία εκτός από γλώσσα πρόγραμματισμού για
τον χρήστη επιτρέπει και την μεταβολή του αρχικού συστήματος, δηλαδή και
της ίδιας της γλώσσας. Παρόμοια τακτική ακολούθησαν και άλλοι
κατασκευαστές για να δημιουργήσουν από την αρχή νέα διαδραστικά
συστήματα, όπως είναι τα Lilith, Oberon, τα οποία υλοποιήθηκαν με τις
Modula, Oberon, οι οποίες με την σειρά τους δεν ήταν εντελώς νέες αλλά
επεκτάσεις της δομημένης και στατικής Pascal, ώστε να είναι συμβατή με
το πλαίσιο ανάπτυξης του νέου διαδραστικού συστήματος. Η βασική διαφορά
που έχουν αυτά τα συστήματα από το αρχικό Alto και την Smalltalk είναι
ότι επιλέγουν μια δομημένη γλώσσα προγραμματισμού με στατικό ορισμό
τύπων, παρότι και στις δύο περιπτώσεις αυτά τα συστήματα στόχευαν στο
ίδιο κοινό, δηλαδή στην εκπαίδευση. Από αυτές τις προσπάθειες προκύπτει
ότι οι ίδιες οι γλώσσες και τα περιβάλλοντα προγραμματισμού δεν είναι
ποτέ τεχνολογίες, οι οποίες αναφέρονται κυρίως σε κάποιες σημαντικές
ιδιότητες τους. Επίσης, προκύπτει η κατανόηση ότι η δεξιότητα χρήσης
ενός ισχυρού και εκφραστικού συστήματος διαδραστικής κατασκευής και
δημιουργίας είναι συνήθως αντιστρόφως ανάλογο με την ευκολία εκμάθησης
του.</p>
<figure id="fig:terminal-emulator">
<img src="../images/terminal-emulator.png"
alt="Η απλότητα και η διαχρονικότητα του πληκτρολογίου και της οθόνης κειμένου για την διάδραση με τον υπολογιστή οδήγησαν στην δημιουργία εφαρμογών εξομοίωσης, οι οποίες δίνουν πρόσβαση σε έναν υπολογιστή ανεξάρτητα από την τοποθεσία του. Η εφαρμογή εξομοίωσης τερματικού επιτρέπει σε έναν χρήστη να αλληλεπιδράση τόσο με τον προσωπικό υπολογιστή, όσο και με ένα συστήματα που βρίσκεται κάπου αλλού ή ακόμη και με ένα εικονικό σύστημα στο υπολογιστικό νέφος." />
<figcaption aria-hidden="true">Η απλότητα και η διαχρονικότητα του
πληκτρολογίου και της οθόνης κειμένου για την διάδραση με τον υπολογιστή
οδήγησαν στην δημιουργία εφαρμογών εξομοίωσης, οι οποίες δίνουν πρόσβαση
σε έναν υπολογιστή ανεξάρτητα από την τοποθεσία του. Η εφαρμογή
εξομοίωσης τερματικού επιτρέπει σε έναν χρήστη να αλληλεπιδράση τόσο με
τον προσωπικό υπολογιστή, όσο και με ένα συστήματα που βρίσκεται κάπου
αλλού ή ακόμη και με ένα εικονικό σύστημα στο υπολογιστικό
νέφος.</figcaption>
</figure>
<figure id="fig:vnc">
<img src="../images/vnc.png"
alt="Σε αναλογία με την τεχνολογία εξομοιωτή τερματικού κειμένου, η τεχνολογία εικονικού υπολογιστή επιτρέπει την διάδραση με γραφικές διεπαφές και συσκευές εισόδου πέρα από το πληκτρολόγιο. Η διαθεσιμότητα των ευρυζωνικών δικτύων έδωσε την δυνατότητα της μετάδοσης σε πραγματικό χρόνο μιας γραφικής διεπαφής από έναν απομακρυσμένο υπολογιστή σε ένα απλό τερματικό που έχει μόνο συστήματα εισόδου και εξόδου με τον χρήστη. Το τερματικό αναλαμβάνει την απεικόνιση της διεπαφής και την είσοδο από τον χρήστη, αλλά όλη η επεξεργασία καθώς και η σύνθεση της εικόνας γίνεται στον απομακρυσμένο υπολογιστή και στέλνεται ως συμπιεσμένη εικόνα." />
<figcaption aria-hidden="true">Σε αναλογία με την τεχνολογία εξομοιωτή
τερματικού κειμένου, η τεχνολογία εικονικού υπολογιστή επιτρέπει την
διάδραση με γραφικές διεπαφές και συσκευές εισόδου πέρα από το
πληκτρολόγιο. Η διαθεσιμότητα των ευρυζωνικών δικτύων έδωσε την
δυνατότητα της μετάδοσης σε πραγματικό χρόνο μιας γραφικής διεπαφής από
έναν απομακρυσμένο υπολογιστή σε ένα απλό τερματικό που έχει μόνο
συστήματα εισόδου και εξόδου με τον χρήστη. Το τερματικό αναλαμβάνει την
απεικόνιση της διεπαφής και την είσοδο από τον χρήστη, αλλά όλη η
επεξεργασία καθώς και η σύνθεση της εικόνας γίνεται στον απομακρυσμένο
υπολογιστή και στέλνεται ως συμπιεσμένη εικόνα.</figcaption>
</figure>
<p>Μια θεμελιώδης τεχνική που διατρέχει την δημιουργία όλων των
καινοτόμων τεχνολογιών διάδρασης είναι ότι βασίζονται σε ένα μικρό
σύνολο από αρχιτεκτονικές επιλογές περισσότερο ως αναλογία και λιγότερο
ως προσομοίωση του πραγματικού κόσμου. Για παράδειγμα, η δημιουργία της
Smalltalk και της ανταλλαγής μηνυμάτων ανάμεσα σε αντικείμενα είναι
εμπνευσμένη από την λειτουργία του βιολογικού κυτάρου. Όπως δηλαδή ένα
κύταρο αλληλεπιδρά δυναμικά και χωρίς κάποιο πλάνο και δομή με διπλανά
του κύταρα, έτσι ακριβώς και τα αντικείμενα στην Smalltalk ανταλλάσσουν
μηνύματα δημιουργώντας συνδέσμους δυναμικά κατά την εκτέλεση, ακόμη και
αν αυτές οι διαδράσεις δεν είχαν αρχικά σχεδιαστεί. Αν και η
αρχιτεκτονική για την κατασκευή της Smalltalk βασίζεται στην εξομοίωση,
ένα από τα βασικά κίνητρα της δημιουργίας καθώς και ένα από τα πεδία
εφαρμογής έχει να κάνει με την προσομοίωση του φυσικού κόσμου, έτσι ώστε
οι προγραμματιστές να μπορούν να μελετήσουν την συμπεριφορά πολύπλοκων
συστημάτων που θα μοντελοποιήσουν. Βλέπουμε δηλαδή ότι οι κατασκευαστές
του Alto και της Smalltalk όχι μόνο δεν είναι αντίθετοι στην
προσομοίωση, αλλά είναι πολύ θετικοί, αρκεί όμως αυτό να μην γίνεται
εμπόδιο για την διαδικασία κατασκευής η οποία θα πρέπει να βασίζεται
στην εξομοίωση ενός νέου καινοτόμου συστήματος.<a href="#fn25"
id="fnref25" class="footnote-ref" role="doc-noteref"><sup>25</sup></a>
Μια αντίστοιχη αλλά πολύ διαφορετική αναλογία μπορούμε να εντοπίσουμε
και στην περίπτωση του UNIX, όπου οι κατασκευαστές χρειάστηκε μαζί με το
λειτουργικό σύστημα να δημιουργήσουν και την νέα γλώσσα προγραμματισμού
C, η οποία σχεδιάστηκε έτσι ώστε να είναι κατάλληλη για την συνεχή
βελτίωση αυτού του λειτουργικού συστήματος και του διαδραστικού κελύφους
γραμμής εντολών, το οποίο απευθύνεται αρχικά σε εργαζόμενους τηλεφωνικών
οργανισμών που πρέπει να διαχειριστούν δεδομένα σε αρχεία και να
ετοιμάσουν τεκμηρίωση για τις τηλεπικοινωνιακές τεχνολογίες. Στην
περίπτωση του UNIX, η αναλογία είναι ότι όλα τα δομικά στοιχεία του
συστήματος είναι αρχεία, μια αναλογία που έφτασε στην ωρίμανση της με το
επόμενο δημιούργημα των ερευνητών στα Bell Labs, το Plan9.</p>
<p>Στις προηγούμενες ενότητες είδαμε τον κεντρικό ρόλο του τηλέτυπου, ο
οποίος μετασχηματίστηκε σταδιακά από ένα αυτόνομο τερματικό για την
αποστολή μηνυμάτων στην βασική συσκευή διάδρασης για την κατασκευή
πολλών καινοτόμων συστήματων όπως τα Sketchpad, NLS, UNIX, Smalltalk,
JOSS, CPM, MS-BASIC. Ταυτόχρονα παρατηρούμε ότι ο ρόλος του τηλέτυπου
στα ίδια αυτά συστήματα είχε πολύ διαφορετικό βαθμό επιροής στο τελικό
τερματικό διάδρασης με τον χρήστη. Για παράδειγμα, η διάδραση στο τελικό
σύστημα Sketchpad δεν περιλαμβάνει καθόλου στοιχεία ούτε από το
περιβάλλον ανάπτυξης, αλλά ούτε και από τις συσκευές διάδρασης κατά την
ανάπτυξη του. Στην πιο σύγχρονη εκδοχή του αυτό το σενάριο παρουσιάζεται
στην περίπτωση ανάπτυξης κινητών εφαρμογών σε έναν επιτραπέζιο
υπολογιστή, αλλά η διάδραση θα γίνει με διαφορετικά συστήματα εισόδου
και εξόδου στο έξυπνο κινητό. Σε ένα ενδιάμεσο επίπεδο συναντάμε το
σύστημα NLS καθώς και την Smalltalk όπου το κείμενο και η επεξεργασία
του έχουν κεντρικό ρόλο, αλλά αυτό είναι μόνο ένα μικρό υποσύνολο από
τις δυνατότητες του γραφικού περιβάλλοντος, αλλά και της συσκευής
εισόδου ποντίκι που είναι κάτι νέο. Στο αντίθετο άκρο τα συστήματα JOSS,
UNIX, όχι μόνο έχουν τον τηλέτυπο ως βασικό μοντέλο για την διάδραση με
τον χρήστη, αλλά ϋοθετούν τον τηλέτυπο και ως συσκευή εισόδου και εξόδου
για την διάδραση με τον τελικό χρήστη, όπου έχει κεντρικό ρόλο στο
τερματικό γραμμής εντολών. Μια διαφορετική αναλογία αντί για τον
τηλέτυπο μπορούμε να εντοπίσουμε στην τεχνολογία του εικονικού
τερματικού εικονοστοιχείων VNC, το οποίο επιτρέπει την διάδραση με
γραφική διεπαφή με έναν απομακρυσμένο υπολογιστή. Με αυτήν την
τεχνολογία η διάδραση σε ένα τερματικό χρήστη ενορχηστρώνεται σε έναν
απομακρυσμένο υπολογιστή, ο οποίος με την τεχνική της εξομοίωσης μπορεί
να έχει όποια συμπεριφορά μπορούμε να φανταστούμε και να υλοποιήσουμε.
<a href="#fn26" id="fnref26" class="footnote-ref"
role="doc-noteref"><sup>26</sup></a> <a href="#fn27" id="fnref27"
class="footnote-ref" role="doc-noteref"><sup>27</sup></a></p>
<section id="footnotes" class="footnotes footnotes-end-of-section"
role="doc-endnotes">
<hr />
<ol start="25">
<li><div id="fn25">
<p><span class="citation" data-cites="kay1993early">Kay (1993)</span><a
href="#fnref25" class="footnote-back" role="doc-backlink">↩︎</a></p>
</div></li>
<li><div id="fn26">
<p>fig:terminal-emulator<a href="#fnref26" class="footnote-back"
role="doc-backlink">↩︎</a></p>
</div></li>
<li><div id="fn27">
<p>fig:vnc<a href="#fnref27" class="footnote-back"
role="doc-backlink">↩︎</a></p>
</div></li>
</ol>
</section>
<h2 id="η-περίπτωση-του-xerox-alto">Η περίπτωση του Xerox Alto</h2>
<p>Ο προσωπικός υπολογιστής θεωρείται δεδομένος για τους χρήστες μετά
την δεκαετία του 1980, αλλά ήταν μόνο μια ιδέα για πολύ λίγους ερευνητές
την δεκαετία του 1970. Η αρχή έγινε με το όραμα για το Dynabook, το
οποίο έμοιαζε με ένα σύγχρονο τάμπλετ. Αν και ήταν αδύνατο να
κατασκευαστεί ένα τάμπλετ τότε, οι ερευνητές αποφάσισαν να
χρησιμοποιήσουν το υλικό της εποχής τους, ώστε να φτιάξουν ένα σχετικά
μικρό υπολογιστή, πάνω στον οποίο θα αναπτύξουν το λογισμικό του
μελλοντικού προσωπικού υπολογιστή.</p>
<figure id="fig:xerox-alto">
<img src="../images/xerox-alto.jpg"
alt="Ο επιτραπέζιος υπολογιστής της Xerox Alto ήταν ένα λειτουργικό πρωτότυπο πάνω στην ιδέα του Dynabook που βελτιωνόταν συνεχώς από τους ερευνητές του PARC και οδήγησε τελικά την κατασκευή του πρώτου σύγχρονου υπολογιστή με γραφική επιφάνεια εργασίας, του Xerox Star" />
<figcaption aria-hidden="true">Ο επιτραπέζιος υπολογιστής της Xerox Alto
ήταν ένα λειτουργικό πρωτότυπο πάνω στην ιδέα του Dynabook που
βελτιωνόταν συνεχώς από τους ερευνητές του PARC και οδήγησε τελικά την
κατασκευή του πρώτου σύγχρονου υπολογιστή με γραφική επιφάνεια εργασίας,
του Xerox Star</figcaption>
</figure>
<figure id="fig:smalltalk-paint">
<img src="../images/smalltalk-paint.png"
alt="Οι γραφικές διεπαφές μετατοπίζουν την σημασία της διάδρασης από το κείμενο προς τις εικόνες και τα γραφικά. Για αυτόν τον σκοπό, μαζί με την δημιουργία του περιβάλλοντος προγραμματισμού είναι εξίσου σημαντικό να δημιουργηθεί ένα πρόγραμμα επεξεργασίας εικόνας με το οποίο θα διευκολυνθεί η κατασκευή των πρόσθετων γραφικών στοιχείων καθως και των εικονιδίων και των γραμματοσειρών." />
<figcaption aria-hidden="true">Οι γραφικές διεπαφές μετατοπίζουν την
σημασία της διάδρασης από το κείμενο προς τις εικόνες και τα γραφικά.
Για αυτόν τον σκοπό, μαζί με την δημιουργία του περιβάλλοντος
προγραμματισμού είναι εξίσου σημαντικό να δημιουργηθεί ένα πρόγραμμα
επεξεργασίας εικόνας με το οποίο θα διευκολυνθεί η κατασκευή των
πρόσθετων γραφικών στοιχείων καθως και των εικονιδίων και των
γραμματοσειρών.</figcaption>
</figure>
<p>Ο προσωπικός υπολογιστής Xerox Alto<a href="#fn28" id="fnref28"
class="footnote-ref" role="doc-noteref"><sup>28</sup></a> δημιουργήθηκε
με το υλικό των μίνι-υπολογιστών εκείνης της εποχής, αλλά με έμφαση στην
διάδραση με έναν χρήστη που γινόταν με οθόνη γραφικών και ποντίκι.
Αρχικά, οι σχεδιαστές του χρησιμοποίησαν έναν μίνι-υπολογιστή για να
εξομοιώσουν την λειτουργία του και στην συνέχεια κατασκεύασαν
εκατοντάδες αντίγραφα του, έτσι ώστε πολλοί διαφορετικοί χρήστες να
αποκτήσουν πρόσβαση και να δημιουργηθεί μια κοινότητα γύρω από αυτόν. Με
αυτόν τον τρόπο, το Alto ήταν κάτι περισσότερο από ένα εύθραστο
εργαστηριακό πείραμα και επέτρεψε στους χρήστες του όχι απλά να πάρουν
μια γεύση από το μέλλον αλλά να μεταφερθούν σε αυτό.</p>
<p>Η επιτραπέζια μορφή του Alto ήταν απλά ένα ενδιάμεσο στάδιο πριν
φτάσουμε στους φορητούς προσωπικούς υπολογιστές, αλλά το λογισμικό του
αναπτύχθηκε με αφετηρία το όραμα του Dynabook για έναν υπολογιστή για
παιδιά, όλων των ηλικιών. Πράγματι, το σύστημα προγραμματισμού
Smalltalk<a href="#fn29" id="fnref29" class="footnote-ref"
role="doc-noteref"><sup>29</sup></a> διεύκολυνε την γρήγορη ανάπτυξη
εφαρμογών και κυρίως τον πειραματισμό με στόχο την κατανόηση της
επιστήμης και της τεχνολογίας. Τα παιδιά ανέπτυξαν εφαρμογές ζωγραφικής
και κίνησης, ενώ παράλληλα έμαθαν να σκέφτονται μαζί με το σύστημα Alto,
το οποίο εκτός από εργαλείο ήταν και μέσο επικοινωνίας.</p>
<p>Εκτός από τα παιδιά, οι προγραμματιστές του Alto ανέπτυξαν λογισμικό
και για πολλές άλλες κατηγορίες χρηστών όπως είναι οι υπάλληλοι
γραφείου, οι οποίοι αποτελούν βασικούς πελάτες της Xerox. Ο Larry Tesler
μετέτρεψε τον επεξεργαστή κειμένου Bravo στον Gypsy, έτσι ώστε η χρήση
του να είναι μη τρόπικη. Με αυτόν τον τρόπο, το Alto αποτέλεσε
παράδειγμα για την ανάπτυξη των επόμενων επιτραπέζιων προσωπικών
υπολογιστών όπως είναι το Xerox Star και ο Apple Macintosh, ενώ το
λογισμικό του έθεσε την βάση για τις αντικειμενοστραφείς γλώσσες
προγραμματισμού, τα παραθυρικά περιβάλλοντα, και τις δικτυακές
εφαρμογές.</p>
<section id="footnotes" class="footnotes footnotes-end-of-section"
role="doc-endnotes">
<hr />
<ol start="28">
<li><div id="fn28">
<p>fig:xerox-alto<a href="#fnref28" class="footnote-back"
role="doc-backlink">↩︎</a></p>
</div></li>
<li><div id="fn29">
<p>fig:smalltalk-paint<a href="#fnref29" class="footnote-back"
role="doc-backlink">↩︎</a></p>
</div></li>
</ol>
</section>
<h2 id="η-περίπτωση-του-ερευνητικού-κέντρου-xerox-parc">Η περίπτωση του
ερευνητικού κέντρου Xerox PARC</h2>
<p>Το ερευνητικό κέντρο της Xerox με την ονομασία PARC (Palo Alto
Research Center) δημιουργήθηκε το 1970 με στόχο να επενδύσει τα μεγάλα
κέρδη που είχε η μητρική εταιρεία από την αγορά των βιομηχανικών
εκτυπώσεων σε έρευνα και ανάπτυξη νέων προϊόντων και υπηρεσιών. Ειδικά η
πρώτη δεκαετία λειτουργίας του PARC θα είναι γεμάτη εφευρέσεις που θα
καθορίσουν το μέλλον του προσωπικού επιτραπέζιου υπολογιστή με επιφάνεια
εργασίας, αφού εκεί θα ωριμάσουν σημαντικές τεχνολογίες όπως το ποντίκι,
η γραφική επιφάνεια εργασίας, και οι αντικειμενοστραφεις γλώσσες
προγραμματισμού. Ειδικά, η δημιουργική σύνθεση αυτών των τεχνολογιών
στον Xerox Alto και αργότερα στον Xerox Star θα βάλουν τα θέμελια για
τον επιτραπέζιο υπολογιστή με γραφική επιφάνεια εργασίας.<a href="#fn30"
id="fnref30" class="footnote-ref"
role="doc-noteref"><sup>30</sup></a></p>
<figure id="fig:xerox-star-pc">
<img src="../images/xerox-star-pc.jpg"
alt="Ο επιτραπέζιος υπολογιστής με πληκτρολόγιο, ποντίκι, και γραφική επιφάνεια εργασίας (παράθυρα, εικονίδια, φάκελοι) που δημιουργήθηκε από τη Xerox στα τέλη της δεκαετίας του 1970 λίγο διαφέρει από τον μοντέρνο επιτραπέζιο υπολογιστή." />
<figcaption aria-hidden="true">Ο επιτραπέζιος υπολογιστής με
πληκτρολόγιο, ποντίκι, και γραφική επιφάνεια εργασίας (παράθυρα,
εικονίδια, φάκελοι) που δημιουργήθηκε από τη Xerox στα τέλη της
δεκαετίας του 1970 λίγο διαφέρει από τον μοντέρνο επιτραπέζιο
υπολογιστή.</figcaption>
</figure>
<figure id="fig:xerox-cedar">
<img src="../images/xerox-cedar.png"
alt="Το σύστημα Xerox Cedar αποτελεί την συνέχεια του αποτυχημένου εμπορικά Star δανειζόμενο στοιχεία από το πετυχημένο ερευνητικό πρωτότυπο Alto. Η διάδραση βασίζεται στα έγγραφα που είναι το βασικό αντικείμενο της εταιρείας και το σύστημα παρέχει την ομώνυμη γλώσσα προγραμματισμού, με την οποία ο χρήστης μπορεί να προσαρμόσει την διάδραση μέσα από ένα παραθυρικό περιβάλλον, που εμφανίζει παράλληλα τα έγγραφα και τον πηγαίο κώδικα των εντολών." />
<figcaption aria-hidden="true">Το σύστημα Xerox Cedar αποτελεί την
συνέχεια του αποτυχημένου εμπορικά Star δανειζόμενο στοιχεία από το
πετυχημένο ερευνητικό πρωτότυπο Alto. Η διάδραση βασίζεται στα έγγραφα
που είναι το βασικό αντικείμενο της εταιρείας και το σύστημα παρέχει την
ομώνυμη γλώσσα προγραμματισμού, με την οποία ο χρήστης μπορεί να
προσαρμόσει την διάδραση μέσα από ένα παραθυρικό περιβάλλον, που
εμφανίζει παράλληλα τα έγγραφα και τον πηγαίο κώδικα των
εντολών.</figcaption>
</figure>
<p>Ένας από τους βασικούς παράγοντες επιτυχίας του PARC είναι οι
άνθρωποι που δούλεψαν εκεί. Ένας από τους πρώτους ήταν ο Alan Kay, ο
οποίος, εκτός από την επιμέρους συμβολή του, είχε καταλυτικό ρόλο στην
ανθρωποκεντρική φιλοσοφία που διαπνέει τις καινοτομίες του PARC.
Επιπλέον, η δημιουργία του εργαστηρίου συνέπεσε με την περίοδο που το
σπουδαίο εργαστήριο SRI (Stanford Research Institute) είχε προβλήματα
χρηματοδότησης με αποτέλεσμα σημαντικοί επιστήμονες όπως ο Bill English
να αναζητήσουν δουλειά στο PARC. Εκτός λοιπόν από την γεωγραφική
εγκύτητα με το πανεπιστήμιο του Stanford, το οποίο παράγει συνέχεια
νέους ερευνητές, το εργαστήριο είχε την τύχη να πάρει την σκυτάλη από
την ομάδα του SRI που δημιούργησε το σύστημα NLS και το πρώτο
ποντίκι.</p>
<p>Την δεκαετία του 1980 η άνθιση της βιομηχανίας των προσωπικών
υπολογιστών θα δελεάσει με την σειρά της πολλούς από τους ερευνητές του
PARC, οι οποίοι θα δουλέψουν σε εταιρείες όπως η Apple για την
δημιουργία επιτυχημένων εμπορικών εκδόσεων των δημιουργιών του PARC. Δεν
είναι τυχαίο ότι ο Steve Jobs το 1980 εμπνεύστηκε τον Macintosh κατά την
διάρκεια μιας επίσκεψης εκεί. Το γεγονός ότι η ίδια η μητρική εταιρεία
Xerox δεν μπόρεσε να εκμεταλευτεί τις δικιές της εφευρέσεις είναι
αντιπροσωπευτικό της ανάγκης η έρευνα και η γνώση να είναι ανοιχτά για
όλους, καθώς πολλές φορές οι χρηματοδότες της μπορεί να μην βλέπουν ή να
μην ενδιαφέρονται για ευρήματα που τελικά είναι χρήσιμα για τους
πολλούς.</p>
<p>Το 2020 το PARC συμπληρώνει πενήντα χρόνια συμβολής στην περιοχή της
διάδρασης ανθρώπου-υπολογιστή, περίοδος που αντιστοιχεί και στην ηλικία
αυτής της περιοχής. Αν και έχουν υπάρξει πολλά πανεπιστημιακά ή
βιομηχανικά ερευνητικά κέντρα, καθώς και πολλές εταιρείες με μεγάλη
συμβολή σε αυτόν τον χώρο, το PARC είναι με διαφορά το μόνο που έχει μια
διαχρονική συμβολή.<a href="#fn31" id="fnref31" class="footnote-ref"
role="doc-noteref"><sup>31</sup></a> Πράγματι, την δεκαετία του 2010, ο
επιτραπέζιος υπολογισμός δίνει την θέση του στον διάχυτο υπολογισμός
(κινητά, τάμπλετες, φορετά) και τα οικοσυστημάτα συνεργασίας ανθρώπων
και συσκευών, που ήταν ένα από τα βασικά ερευνητικά θέματα του Marc
Weiser στο Parc στις αρχές της δεκαετίας του 1990.</p>
<section id="footnotes" class="footnotes footnotes-end-of-section"
role="doc-endnotes">
<hr />
<ol start="30">
<li><div id="fn30">
<p>fig:xerox-star-pc<a href="#fnref30" class="footnote-back"
role="doc-backlink">↩︎</a></p>
</div></li>
<li><div id="fn31">
<p>fig:xerox-cedar<a href="#fnref31" class="footnote-back"
role="doc-backlink">↩︎</a></p>
</div></li>
</ol>
</section>
<h2 id="σύντομη-βιογραφία-του-alan-kay">Σύντομη βιογραφία του Alan
Kay</h2>
<p>Από πολύ μικρή ηλικία ο Alan Kay έχει παρουσιάσει σημαντικά ταλέντα,
όπως ανάγνωση πριν πάει στο δημοτικό, με αποτέλεσμα να βαριέται στην
τάξη, αφού ήδη γνώριζε την ύλη. Οι βασικές του σπουδές ήταν σε
μαθηματικά και βιολογία, ενώ ο ίδιος για μεγάλο διάστημα
αυτοπροσδιορίζεται περισσότερο ως μουσικός παρά ως επιστήμονας των
υπολογιστών,<a href="#fn32" id="fnref32" class="footnote-ref"
role="doc-noteref"><sup>32</sup></a> που ήταν τελικά η επαγγελματική
κατεύθυνση που τον έκανε γνωστό. Μάλιστα, λέγεται ότι αποφεύγει τα
ταξίδια και τις μετακινήσεις μακρυά από το σπίτι του γιατί θέλει να
μπορεί να συντηρεί και να παίζει στο μεγάλο εκλησιαστικό μουσικό όργανο
που έχει σπίτι του.</p>
<figure id="fig:kay-profile">
<img src="../images/kay-profile.jpg"
alt="Ο Alan Kay μετέφερε τον προγραμματισμό με γραφικά σε ένα προσωπικό διαδραστικό σύστημα, το οποίο σε μια εκδοχή του δημιούργησε όλα τα σύγχρονα επιτραπέζια συστήματα. Παράλληλα, ο ίδιος παραμένει με συνέπεια ένας από τους λίγους συνεχιστές της φιλοσοφίας του Douglas Engelbart με σύγχρονα συστήματα που δίνουν έμφαση στις προσωπικές δεξιότητες και στην εκφραστική δύναμη, παρά στην ευχρηστία ως βολικότητα." />
<figcaption aria-hidden="true">Ο Alan Kay μετέφερε τον προγραμματισμό με
γραφικά σε ένα προσωπικό διαδραστικό σύστημα, το οποίο σε μια εκδοχή του
δημιούργησε όλα τα σύγχρονα επιτραπέζια συστήματα. Παράλληλα, ο ίδιος
παραμένει με συνέπεια ένας από τους λίγους συνεχιστές της φιλοσοφίας του
Douglas Engelbart με σύγχρονα συστήματα που δίνουν έμφαση στις
προσωπικές δεξιότητες και στην εκφραστική δύναμη, παρά στην ευχρηστία ως
βολικότητα.</figcaption>
</figure>
<figure id="fig:squeakos">
<img src="../images/squeakos.jpg"
alt="Το σύστημα Squeak βασίζεται στο περιβάλλον προγραμματισμού Smalltalk η οποία επιτρέπει τις απευθείας αλλαγές σε όλα τα αντικείμενα του συστήματος και ταυτόχρονα δεν κάνει καμία διάκριση ανάμεσα σε αρχεία, εφαρμογές, λειτουργικό σύστημα, έτσι ώστε ο χρήστης να έχει τον πλήρη έλεγχο με έμφαση στα έργα του." />
<figcaption aria-hidden="true">Το σύστημα Squeak βασίζεται στο
περιβάλλον προγραμματισμού Smalltalk η οποία επιτρέπει τις απευθείας
αλλαγές σε όλα τα αντικείμενα του συστήματος και ταυτόχρονα δεν κάνει
καμία διάκριση ανάμεσα σε αρχεία, εφαρμογές, λειτουργικό σύστημα, έτσι
ώστε ο χρήστης να έχει τον πλήρη έλεγχο με έμφαση στα έργα
του.</figcaption>
</figure>
<p>Η πρώτη σημαντική συνεισφορά του ήταν το όραμα και ο σχεδιασμός του
Dynabook το 1968, το οποίο μορφολογικά και λειτουργικά μοιάζει πολύ με
ένα σύγχρονο (2010) τάμπλετ. Αυτός ο αρχικός σχεδιασμός όμως ήταν τόσο
φιλόδοξος που ακόμη και ο ίδιος θεωρεί πως οι σύγχρονοι υπολογιστές δεν
εφαρμόζουν ακόμη όλες εκείνες τις οδηγίες τουλάχιστον από την ποιοτική
πλευρά. Για να φτάσει στο όραμα του Dynabook ο Alan Kay εστίασε την
προσοχή του στο λογισμικό, το οποίο αρχικά ήταν το περιβάλλον Smalltalk
που έτρεχε σε έναν από τους πρώτους πειραματικούς επιτραπέζιους
υπολογιστές, τον Xerox Alto.</p>
<p>Μετά την εργασία του στο Xerox Parc συνέχισε να δουλεύει στην Apple
και μετά στο Viewpoints Institute, αλλά σε κάθε περίπτωση συνέχισε να
εργάζεται πάνω στο αρχικό όραμα του Dynabook με ιδιαίτερη έμφαση στον
τρόπο που μαθαίνουν τα παιδιά. Δουλεύοντας επίμονα πάνω στο ίδιο
αντικείμενο έκανε πολλές επαναλήψεις με το προσωρινό Dynabook (Xerox
Alto, Xerox Notetaker), τα οποία μπορούσαν να εκτελέσουν προγράμματα
Smalltalk. Το περιβάλλον Smalltalk αποτέλεσε την βάση για την δημιουργία
της Squeak (eToys),<a href="#fn33" id="fnref33" class="footnote-ref"
role="doc-noteref"><sup>33</sup></a> η οποία με την σειρά της επηρέασε
περισσότερο ως κίνητρο και λιγότερο ως σχεδίαση τα σύγχρονα εργαλεία
εκμάθησης προγραμματισμού όπως το Scratch Blocks. Τρεις δεκαετίες μετά
θα συμβάλει στην δημιουργία της διεπαφής για το πρόγραμμα του ενός
φορητού υπολογιστή για κάθε παιδί.</p>
<p>Δεν είναι τυχαίο ότι ο Alan Kay επηρεάστηκε ιδιαίτερα από το έργο του
Ivan Sutherland (δημιουργός του Sketchpad το 1963), ενώ o ίδιος ο Alan
Kay αποτέλεσε σημαντική επιροή του Bret Victor. Παρατηρούμε ότι η
δουλειά όλων βασίζεται στον προγραμματισμό της διάδρασης με αντικείμενα
στην οθόνη του υπολογιστή με στόχο την διευκόλυνση της επεξεργασίας της
πληροφορίας και κυρίως της προσωπικής έκφρασης. Η πιο σημαντική όμως
συνεισφορά του Alan Kay δεν είναι τόσο το ίδιο το υλικό και λογισμικό
των υπολογιστών που οραματίστηκε και έφτιαξε, αλλά η προσπάθεια να
ενδυναμώσει την ανθρώπινη σκέψη και αντίληψη μέσα από τον προγραμματισμό
της διάδρασης.</p>
<section id="footnotes" class="footnotes footnotes-end-of-section"
role="doc-endnotes">
<hr />
<ol start="32">
<li><div id="fn32">
<p>fig:kay-profile<a href="#fnref32" class="footnote-back"
role="doc-backlink">↩︎</a></p>
</div></li>
<li><div id="fn33">
<p>fig:squeakos<a href="#fnref33" class="footnote-back"
role="doc-backlink">↩︎</a></p>
</div></li>
</ol>
</section>
<h2 class="unnumbered" id="βιβλιογραφία">Βιβλιογραφία</h2>
<div id="refs" class="references csl-bib-body hanging-indent"
role="list">
<div id="ref-bardini2000bootstrapping" class="csl-entry"
role="listitem">
Bardini, Thierry. 2000. <em>Bootstrapping: Douglas Engelbart,
coevolution, and the origins of personal computing</em>. Stanford
University Press.
</div>
<div id="ref-bolter2000remediation" class="csl-entry" role="listitem">
Bolter, Jay David, και Richard Grusin. 2000. <em>Remediation:
Understanding new media</em>. mit Press.
</div>
<div id="ref-engelbart1962augmenting" class="csl-entry" role="listitem">
Engelbart, Douglas C. 1962. <em>Augmenting human intellect: A conceptual
framework</em>. SRI, Menlo Park, CA.
</div>
<div id="ref-computer1993connections" class="csl-entry" role="listitem">
Gildall, Gary. 1993. <em>Computer Connections: People, Places, and
Events in the Evolution of the Personal Computer Industry</em>.
Unpublished.
</div>
<div id="ref-hiltzik1999dealers" class="csl-entry" role="listitem">
Hiltzik, Michael. 1999. <span>‘Dealers of Lightning: Xerox PARC and the
Dawning of the Computer Age’</span>.
</div>
<div id="ref-ihde2012technics" class="csl-entry" role="listitem">
Ihde, Don. 2012. <em>Technics and praxis: A philosophy of
technology</em>. Τ. 24. Springer Science &amp; Business Media.
</div>
<div id="ref-ingalls2020evolution" class="csl-entry" role="listitem">
Ingalls, Daniel. 2020. <span>‘The evolution of Smalltalk: from
Smalltalk-72 through Squeak’</span>. <em>Proceedings of the ACM on
Programming Languages</em> 4 (HOPL): 1–101.
</div>
<div id="ref-kay1993early" class="csl-entry" role="listitem">
Kay, Alan C. 1993. <span>‘The early history of Smalltalk’</span>.
<em>ACM SIGPLAN Notices</em> 28 (3): 69–95.
</div>
<div id="ref-lakoff2008metaphors" class="csl-entry" role="listitem">
Lakoff, George, και Mark Johnson. 2008. <em>Metaphors we live by</em>.
University of Chicago press.
</div>
<div id="ref-lanier2010you" class="csl-entry" role="listitem">
Lanier, Jaron. 2010. <em>You are not a gadget: A manifesto</em>.
Vintage.
</div>
<div id="ref-mumford2010technics" class="csl-entry" role="listitem">
Mumford, Lewis. 2010. <em>Technics and civilization</em>. University of
Chicago Press.
</div>
<div id="ref-nelson2010possiplex" class="csl-entry" role="listitem">
Nelson, Theodor H. 2010. <em>POSSIPLEX: movies, intellect, creative
control, my computer life and the fight for civilization: an
autobiography of Ted Nelson</em>. Mindful Press.
</div>
<div id="ref-raskin2000humane" class="csl-entry" role="listitem">
Raskin, Jef. 2000. <em>The humane interface: new directions for
designing interactive systems</em>. Addison-Wesley Professional.
</div>
<div id="ref-roszak1986satori" class="csl-entry" role="listitem">
Roszak, Theodore. 1986. <em>From Satori to Silicon Valley: San Francisco
and the American Counterculture</em>. Don’t Call It Frisco Press.
</div>
<div id="ref-shasha1998out" class="csl-entry" role="listitem">
Shasha, Dennis, και Cathy Lazere. 1998. <em>Out of their minds: the
lives and discoveries of 15 great computer scientists</em>. Springer
Science &amp; Business Media.
</div>
<div id="ref-wirth1992project" class="csl-entry" role="listitem">
Wirth, Niklaus, και Jürg Gutknecht. 1992. <em>Project Oberon</em>.
Addison-Wesley Reading.
</div>
</div>
<h1 id="κατασκευή-του-βιβλίου">Κατασκευή του Βιβλίου</h1>
<blockquote>
<p>Όπως η τέχνη θεωρήθηκε ως μίμηση της ζωής, έτσι και οι τέχνες των
υπολογιστών μπορούν να θεωρηθούν ως η μίμηση της ίδιας της δημιουργίας
Alan Kay</p>
</blockquote>
<h2 id="τι-είναι-ένα-βιβλίο">Τι είναι ένα βιβλίο;</h2>
<p>Για τους περισσότερους αναγνώστες αυτή είναι μάλλον ρητορική, αν όχι
περιττή ερώτηση. Δεν υπάρχει αμφιβολία ότι ένα βιβλίο είναι ένα φυσικό
αντικείμενο που περιέχει δεμένες σελίδες. Πράγματι, αυτός είναι ένας από
τους τέσσερις ορισμούς που βρίσκουμε για την φύση του σύγχρονου
βιβλίου.<a href="#fn1" id="fnref1" class="footnote-ref"
role="doc-noteref"><sup>1</sup></a> Ένα βιβλίο είναι πρώτα από όλα ένα
αντικείμενο, αλλά είναι επίσης και το περιεχόμενο του, το οποίο μπορεί
να είναι διαθέσιμο σε άλλες μορφές όπως είναι η ιστοσελίδα ή ο
ηλεκτρονικός αναγνώστης, τα οποία έχουν πολύ διαφορετική φυσική μορφή
από το βιβλίο, αλλά έχουν το ίδιο ακριβώς περιεχόμενο. Επίσης, ένα
βιβλίο είναι μια ιδέα, με την έννοια ότι το περιεχόμενο θα μπορούσε να
γίνει διαθέσιμο μέσω άλλων σημαντικών ιδεών, όπως για παράδειγμα ένα
άρθρο. Τέλος, ένα βιβλίο είναι μια διεπαφή, γιατί μέσω της οργάνωσης του
περιεχομένου σε σελίδες, ο αναγνώστης μπορεί να πλοηγηθεί όπως θέλει και
όπως το σχεδίασαν ο συγγραφέας και ο εκδότης. Με αυτό το βιβλίο,
επιχειρούμε να προσθέσουμε έναν ακόμη ορισμό για την φύση του βιβλίου,
<em>ένα βιβλίο είναι επίσης και η διαδικασία κατασκευής του.</em></p>
<section id="footnotes" class="footnotes footnotes-end-of-section"
role="doc-endnotes">
<hr />
<ol>
<li><div id="fn1">
<p><span class="citation" data-cites="borsuk2018book">Borsuk
(2018)</span><a href="#fnref1" class="footnote-back"
role="doc-backlink">↩︎</a></p>
</div></li>
</ol>
</section>
<h2 id="πως-κατασκευάζουμε-ένα-βιβλίο">Πως κατασκευάζουμε ένα
βιβλίο;</h2>
<p>Η διαδικασία κατασκευής των περισσότερων βιβλίων τις τελευταίες
δεκαετίες μετά την διάδοση του επιτραπέζιου υπολογιστή και της
επιφάνειας εργασίας, γίνεται με τις αντίστοιχες εφαρμογές. Ενδεικτικά,
ένας συγγραφέας θα χρησιμοποιήσει μια εφαρμογή όπως το Microsoft Word ή
το Apple Pages για να γράψει ένα βιβλίο και στην συνέχεια η εκδοτική
ομάδα θα το μετατρέψει στο τελικό βιβλίο με ένα πρόγραμμα όπως το Adobe
InDesign. Οι εφαρμογές αυτές μπορεί να είναι από διαφορετικές εταιρείες
και να αλλάζουν σταδιακά, αλλά η βασική τους φιλοσοφία είναι η ίδια
ακριβώς και τοποθετεί έναν αδιαπέραστο τοίχο ανάμεσα στην συγγραφή και
την παραγωγή του βιβλίου.</p>
<p>Η διαδικασία κατασκευής αυτού του βιβλίου γκρεμίζει τον τοίχο που
χωρίζει την συγγραφή από την παραγωγή με μια διαδικασία κατασκευής που
βασίζεται στην τεχνολογία λογισμικού και στα εργαλεία της γραμμής
εντολών. Τα πλεονεκτήματα αυτής της επιλογής είναι πάρα πολλά, ανάμεσα
στα οποία το πιο απλό και χρήσιμο είναι ότι οι διορθώσεις που γίνονται
από τον συγγραφέα περνάνε απευθείας στο τελικό βιβλίο, αφού υπάρχει μόνο
ένα πηγαίο κείμενο σε ένα μόνο αρχείο. Αντίθετα, στην επιτραπέζια
σελιδοποίηση βιβλίων, για κάθε αλλαγή που κάνει ο συγγραφέας στο δικό
του αρχείο, θα πρέπει να περαστεί χειροκίνητα στο διαφορετικό αρχείο
παραγωγής. Η συντήρηση δύο διακριτών αρχείων με το ίδιο περιεχόμενο
είναι μια από τις πιο κακές πρακτικές στην πληροφορική, γιατί είναι θέμα
χρόνου τα δύο αυτά αρχεία να χάσουν τον συγχρονισμό τους.</p>
<p>Η πιο καλή πρακτική για την συντήρηση πολλών διαφορετικών εκδοχών του
ίδιου αρχείου είναι ένα σύστημα ελέγχου εκδόσεων. Για αυτόν τον λόγο, η
συγγραφή αυτού του βιβλίου έχει γίνει στο σύστημα Github, το οποίο
βασίζεται στην τεχνολογία git για τον έλεγχο εκδόσεων αρχείων κειμένου.
Με αυτόν τον τρόπο, για κάθε αλλαγή που γίνεται διατηρείται ιστορικό. Αν
και δεν είναι πιθανό να θέλουμε να γυρίσουμε σε παλιότερες εκδόσεις του
αρχείου κειμένου, είναι πολύ πιθανό να θέλουμε να γίνουν διορθώσεις από
τρίτους, όπως είναι η γλωσσική επιμέλεια. Τα σύγχρονα συστήματα ελέγχου
εκδόσεων διευκολύνουν την συνεργασία πολλών συγγραφέων πάνω σε αρχεία
κειμένου, όπου εκτός από τις αλλαγές κρατάνε και το ιστορικό των
συγγραφέων. Επομένως, η παραγωγή του βιβλίου μπορεί να γίνει από την
ομάδα συγγραφής και υποστήριξης με χρήση απλών εργαλείων λογισμικού και
αρχεία απλού κειμένου, και η συνεισφορά του κάθε μέλους να τεκμηριώνεται
αυτόματα από την δραστηριότητά του.</p>
<p>Καθώς το πηγαίο κείμενο και η διαδικασία παραγωγής του τελικού
βιβλίου βρίσκονται αποθηκευμένα σε δημόσια αποθετήρια με έλεγχο εκδόσεων
σε μια συνεργατική πλατφόρμα ανάπτυξης λογισμικού, αυτόματα προκύπτουν
πρόσθετα πλεονεκτήματα. Για παράδειγμα, ο επιμελής αναγνώστης μπορεί να
διορθώσει σφάλματα και αυτόματα να προστεθεί στους συντελεστές. Επίσης,
το συνολικό έργο μπορεί να διακλαδωθεί σε νέες κατευθύνσεις. Η
δυνατότητα διακλαδώσεων επιτρέπει την προσθήκη νέου περιεχομένου το
οποίο προαιρετικά θα μπορούσε να προστεθεί και στο κεντρικό αποθετήριο
του βιβλίου. Με αυτόν τον τρόπο, όχι μόνο η διαδικασία παραγωγής, αλλά
και η ίδια η συγγραφή του βιβλίου μετασχηματίζεται προς μια συνεργατική
κατεύθυνση. Η δυνατότητα αυτή έχει ήδη χρησιμεύσει ως άσκηση για τους
φοιτητές των αντίστοιχων μαθημάτων. Επιπλέον, η δυνατότητα διαφανούς και
τεκμηριωμένης συνεργασίας μπορεί να χρησιμεύσει σε συλλογικούς
τόμους.</p>
<p>Πέρα από τα πρακτικές βελτιώσεις στην παραγωγή που συνοδεύουν αυτήν
την διαδικασία κατασκευής, υπάρχουν επιπλέον κίνητρα που ενθάρρυναν
αυτές τις προδιαγραφές για αυτό το έργο συγγραφής. Η επεξεργασία
εγγράφων ήταν από τις πρώτες δημοφιλείς χρήσεις των πρώτων προσωπικών
υπολογιστών και συνεχίζει να έχει έναν σημαντικό ρόλο. Οι περισσότεροι
χρήστες υπολογιστών έχουν ήδη μια σχετική εμπειρία από τις αντίστοιχες
γραφικές εφαρμογές, αλλά πολλοί λίγοι γνωρίζουν ότι το ίδιο αποτέλεσμα
μπορούν να το πετύχουν με έναν πολύ διαφορετικό τρόπο. Η θεωρητική
κατανοήση των διαφορετικών μορφών στα συστήματα διάδρασης είναι το
κεντρικό θέμα σε αυτό το βιβλίο, άρα θα ήταν σχεδόν αντιφατικό να
χρησιμοποιήσουμε την κυρίαρχη μορφή διάδρασης, ειδικά αφού έχει και τόσα
μειονεκτήματα.</p>
<figure id="fig:book-making">
<img src="../images/book-making.jpg"
alt="Για την κατασκευή της μορφής του βιβλίου, είτε αυτή είναι ηλεκτρονική, είτε είναι φυσική, μπορεί να χρησιμοποιηθεί ένας εξομοιωτής τερματικού. Η ροή της εργασίας είναι παρόμοια με αυτήν της δεκαετίας του 1970, με την διαφορά ότι σε μια μεγάλη οθόνη μπορεί να γίνει πολυπλεξία πολλών τερματικών, όπου στο καθένα τρέχουν διαφορετικά μικρά προγράμματα και εντολές δημιουργώντας έτσι ένα ολοκληρωμένο και ταυτόχρονα δυναμικό περιβάλλον επεξεργασίας κειμένου και σελιδοποίησης." />
<figcaption aria-hidden="true">Για την κατασκευή της μορφής του βιβλίου,
είτε αυτή είναι ηλεκτρονική, είτε είναι φυσική, μπορεί να χρησιμοποιηθεί
ένας εξομοιωτής τερματικού. Η ροή της εργασίας είναι παρόμοια με αυτήν
της δεκαετίας του 1970, με την διαφορά ότι σε μια μεγάλη οθόνη μπορεί να
γίνει πολυπλεξία πολλών τερματικών, όπου στο καθένα τρέχουν διαφορετικά
μικρά προγράμματα και εντολές δημιουργώντας έτσι ένα ολοκληρωμένο και
ταυτόχρονα δυναμικό περιβάλλον επεξεργασίας κειμένου και
σελιδοποίησης.</figcaption>
</figure>
<p>Η κατασκευή του βιβλίου μπορεί να θεωρηθεί όπως η κατασκευή ενός
συστήματος διάδρασης. Παραδοσιακά η κατασκευή του βιβλίου γίνεται από
δύο διακριτές ομάδες, δηλαδή την συγγραφική και την εκδοτική.
Αντίστοιχα, η κατασκευή ενός συστήματος διάδρασης συνήθως έχει δύο
όψεις, τους προγραμματιστές και τους σχεδιαστές. Στην κατασκευή
συστημάτων διάδρασης είδαμε ότι η βέλτιστη πρακτική είναι να έχουμε μια
σύνθεση αυτών των δύο διαστάσεων που έχει σφαιρική κατανόηση του
αντικειμένου ή τουλάχιστον μια γεφύρωση της απόστασης ανάμεσα τους. Αυτό
ακριβώς το κεντρικό θεώρημα της κατασκευής της διάδρασης εφαρμόζουμε και
στην κατασκευή αυτού του βιβλίου. Ο συγγραφέας του βιβλίου μπορεί να
είναι ταυτόχρονα και εκδότης, αλλά κυρίως αντιλαμβάνεται αυτήν την
παραδοσιακά διακριτή διαδικασία ως μια σύνθεση, όπου η συγγραφή
συντελείται μαζί με την παραγωγή. Εκτός από μια πρακτική εφαρμογή της
θεωρίας του βιβλίου, αυτή η οπτική επιτρέπει και στον αναγνώστη να γίνει
συμμέτοχος. Ο αναγνώστης μπορεί να αντιγράψει, να μελετήσει, να
επεξεργαστεί, και τελικά να κατανοήσει καλύτερα αυτό το βιβλίο και
κυρίως το πνεύμα του, μέσα από την διαδικασία της ίδιας της κατασκευής
του που είναι διαθέσιμη στο αποθετήριο <a
href="https://github.com/mibook"
class="uri">https://github.com/mibook</a></p>
<h2 class="unnumbered" id="βιβλιογραφία">Βιβλιογραφία</h2>
<div id="refs" class="references csl-bib-body hanging-indent"
role="list">
<div id="ref-borsuk2018book" class="csl-entry" role="listitem">
Borsuk, Amaranth. 2018. <em>The Book</em>. MIT Press.
</div>
</div>
<h1 id="ιστοσελίδα-και-συνοδευτικό-περιεχόμενο">Ιστοσελίδα και
συνοδευτικό περιεχόμενο</h1>
<blockquote>
<p>Συνέχεια προσπαθώ να κάνω αυτό που δεν μπορώ, έτσι ώστε κάποια στιγμή
να μπορώ να το κάνω. Πάμπλο Πικάσο</p>
</blockquote>
<p>Αν και φτάσατε στην τελευταία σελίδα, το βιβλίο αυτό δεν τελειώνει
εδώ, αλλά συνεχίζεται στην συνοδευτική ηλεκτρονική του έκδοση, η οποία
περιέχει πολυμεσικό και διαδραστικό περιεχόμενο, όπως είναι θεματικές
διαφάνειες και τα χρονολόγια. Επίσης, σκόπιμα το βιβλίο δεν περιέχει μια
σειρά από ενότητες όπως οι ασκήσεις και οι εργασίες, γιατί αυτές
βρίσκονται στην ιστοσελίδα, έτσι ώστε να μπορούν να ενημερώνονται
συνέχεια: <a href="https://pibook.epidro.me"
class="uri">https://pibook.epidro.me</a></p>
<h1 id="σύντομο-βιογραφικό">Σύντομο βιογραφικό</h1>
<h2 id="κωνσταντίνος-χωριανόπουλος">Κωνσταντίνος Χωριανόπουλος</h2>
<p>Ο συγγραφέας αυτού του βιβλίου έχει εργαστεί για περισσότερα από
είκοσι χρόνια στην έρευνα και ανάπτυξη συστημάτων διάδρασης μεταξύ
ανθρώπου και υπολογιστή. Στις αρχές της πρώτης δεκαετίας αυτού του
αιώνα, έκανε σημαντικές συνεισφορές για τον μετασχηματισμό της παθητικής
κατανάλωσης τηλεοπτικού περιεχομένου προς μια περισσότερο διαδραστική
κατεύθυνση. Μια δεκαετία αργότερα, διαπίστωσε, με έκπληξη, ότι η
πλειονότητα των χρηστών είχε στραφεί σε νέες ψηφιακές υπηρεσίες, οι
οποίες θεωρούν τα σύγχρονα επιτραπέζια και κινητά συστήματα σαν συσκευές
κατανάλωσης, παρόμοια με την παραδοσιακή τηλεόραση. Τα τελευταία δέκα
χρόνια, εργάζεται για την διάδοση συστημάτων και πρακτικών που
υποστηρίζουν περισσότερο υγιείς και βιώσιμες ανθρώπινες αξίες και
βασίζονται σε ανθρωπιστικές και διαφανείς τεχνολογίες.</p>
</body>
</html>
